STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
        </registers>
    </peripheral>
	<peripheral derivedFrom="ADC1">
      <name>ADC2</name>
      <baseAddress>0x48004000</baseAddress>
	  <interrupt>
        <name>ADC2</name>
        <description>ADC2 global interrupt</description>
        <value>19</value>
      </interrupt>
    </peripheral>
	<peripheral>
        <name>AXIMC</name>
        <description>AXIMC</description>
		<groupName>AXIMC</groupName>
        <baseAddress>0x57000000</baseAddress>
		<addressBlock>
          <offset>0x0</offset>
          <size>0x100000</size>
          <usage>registers</usage>
        </addressBlock>
        <registers>
          <register>
            <name>AXIMC_PERIPH_ID_4</name>
            <displayName>AXIMC_PERIPH_ID_4</displayName>
            <description>AXIMC peripheral ID4 register </description>
            <addressOffset>0x1fd0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000004</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>JEP106CON</name>
                <description>JEP106 continuation code</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>K4COUNT</name>
                <description>register file size</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMC_PERIPH_ID_5</name>
            <displayName>AXIMC_PERIPH_ID_5</displayName>
            <description>AXIMC peripheral ID5 register </description>
            <addressOffset>0x1fd4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PERIPH_ID_5</name>
                <description>reserved, not used.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMC_PERIPH_ID_6</name>
            <displayName>AXIMC_PERIPH_ID_6</displayName>
            <description>AXIMC peripheral ID6 register </description>
            <addressOffset>0x1fd8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PERIPH_ID_6</name>
                <description>reserved, not used.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMC_PERIPH_ID_7</name>
            <displayName>AXIMC_PERIPH_ID_7</displayName>
            <description>AXIMC peripheral ID7 register </description>
            <addressOffset>0x1fdc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PERIPH_ID_7</name>
                <description>reserved, not used.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMC_PERIPH_ID_0</name>
            <displayName>AXIMC_PERIPH_ID_0</displayName>
            <description>AXIMC peripheral ID0 register </description>
            <addressOffset>0x1fe0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PERIPH_ID_0</name>
                <description>part number [7:0]</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMC_PERIPH_ID_1</name>
            <displayName>AXIMC_PERIPH_ID_1</displayName>
            <description>AXIMC peripheral ID1 register </description>
            <addressOffset>0x1fe4</addressOffset>
            <size>0x20</size>
            <resetValue>0x000000B4</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PERIPH_ID_1</name>
                <description>JEP106 identity [3:0], part number [11:8]</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMC_PERIPH_ID_2</name>
            <displayName>AXIMC_PERIPH_ID_2</displayName>
            <description>AXIMC peripheral ID2 register </description>
            <addressOffset>0x1fe8</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000003B</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PERIPH_ID_2</name>
                <description>part revision, JEP106 code flag, JEP106 identity [6:4]</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMC_PERIPH_ID_3</name>
            <displayName>AXIMC_PERIPH_ID_3</displayName>
            <description>AXIMC peripheral ID3 register </description>
            <addressOffset>0x1fec</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CUST_MOD_NUM</name>
                <description>customer modification</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>none</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REV_AND</name>
                <description>customer version</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>none</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMC_COMP_ID_0</name>
            <displayName>AXIMC_COMP_ID_0</displayName>
            <description>AXIMC component ID0 register </description>
            <addressOffset>0x1ff0</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000000D</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PREAMBLE</name>
                <description>preamble bits [7:0]</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMC_COMP_ID_1</name>
            <displayName>AXIMC_COMP_ID_1</displayName>
            <description>AXIMC component ID1 register </description>
            <addressOffset>0x1ff4</addressOffset>
            <size>0x20</size>
            <resetValue>0x000000F0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PREAMBLE</name>
                <description>preamble bits [11:8]</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>common ID value</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLASS</name>
                <description>Component class</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0xF</name>
                    <description>generic IP component class</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMC_COMP_ID_2</name>
            <displayName>AXIMC_COMP_ID_2</displayName>
            <description>AXIMC component ID2 register </description>
            <addressOffset>0x1ff8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000005</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PREAMBLE</name>
                <description>preamble bits [19:12]</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMC_COMP_ID_3</name>
            <displayName>AXIMC_COMP_ID_3</displayName>
            <description>AXIMC component ID3 register </description>
            <addressOffset>0x1ffc</addressOffset>
            <size>0x20</size>
            <resetValue>0x000000B1</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PREAMBLE</name>
                <description>preamble bits [27:20]</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMC_M0_FN_MOD2</name>
            <displayName>AXIMC_M0_FN_MOD2</displayName>
            <description>AXIMC master 0 packing functionality register</description>
            <addressOffset>0x42024</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BYPASS_MERGE</name>
                <description>Disable packing of beats to match the output data width
Unaligned transactions are not realigned to the input data word boundary.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>disable packing</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMC_M0_FN_MOD_AHB</name>
            <displayName>AXIMC_M0_FN_MOD_AHB</displayName>
            <description>AXIMC master 0 AHB conversion override functionality register</description>
            <addressOffset>0x42028</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RD_INC_OVERRIDE</name>
                <description>Converts all AHB-Lite write transactions to a series of single beat AXI transactions, and each AHB-Lite write beat is acknowledged with the AXI buffered write response.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>override disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>override enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WR_INC_OVERRIDE</name>
                <description>Converts all AHB-Lite read transactions to a series of single beat AXI transactions</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>override disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>override enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMC_M0_READ_QOS</name>
            <displayName>AXIMC_M0_READ_QOS</displayName>
            <description>AXIMC master 0 read priority register</description>
            <addressOffset>0x42100</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000006</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AR_QOS</name>
                <description>read channel QoS setting</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>lowest priority</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xF</name>
                    <description>highest priority</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMC_M0_WRITE_QOS</name>
            <displayName>AXIMC_M0_WRITE_QOS</displayName>
            <description>AXIMC master 0 write priority register</description>
            <addressOffset>0x42104</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000006</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AW_QOS</name>
                <description>write channel QoS setting</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>lowest priority</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xF</name>
                    <description>highest priority</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMC_M0_FN_MOD</name>
            <displayName>AXIMC_M0_FN_MOD</displayName>
            <description>AXIMC master 0 issuing capability override functionality register</description>
            <addressOffset>0x42108</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>READ_ISS_OVERRIDE</name>
                <description>override AMIB read issuing capability</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal issuing capability</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>force issuing capability to 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WRITE_ISS_OVERRIDE</name>
                <description>override AMIB write issuing capability</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal issuing capability</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>force issuing capability to 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMC_M1_FN_MOD2</name>
            <displayName>AXIMC_M1_FN_MOD2</displayName>
            <description>AXIMC master 1 packing functionality register</description>
            <addressOffset>0x43024</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BYPASS_MERGE</name>
                <description>Disable packing of beats to match the output data width
Unaligned transactions are not realigned to the input data word boundary.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>disable packing</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMC_M1_FN_MOD_AHB</name>
            <displayName>AXIMC_M1_FN_MOD_AHB</displayName>
            <description>AXIMC master 1 AHB conversion override functionality register</description>
            <addressOffset>0x43028</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RD_INC_OVERRIDE</name>
                <description>Converts all AHB-Lite write transactions to a series of single beat AXI transactions, and each AHB-Lite write beat is acknowledged with the AXI buffered write response.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>override disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>override enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WR_INC_OVERRIDE</name>
                <description>Converts all AHB-Lite read transactions to a series of single beat AXI transactions</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>override disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>override enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMC_M1_READ_QOS</name>
            <displayName>AXIMC_M1_READ_QOS</displayName>
            <description>AXIMC master 1 read priority register</description>
            <addressOffset>0x43100</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000006</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AR_QOS</name>
                <description>read channel QoS setting</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>lowest priority</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xF</name>
                    <description>highest priority</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
