STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>AXIMC_M9_READ_QOS</name>
            <displayName>AXIMC_M9_READ_QOS</displayName>
            <description>AXIMC master 9 read priority register</description>
            <addressOffset>0x4b100</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AR_QOS</name>
                <description>read channel QoS setting</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>lowest priority</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xF</name>
                    <description>highest priority</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMC_M9_WRITE_QOS</name>
            <displayName>AXIMC_M9_WRITE_QOS</displayName>
            <description>AXIMC master 9 write priority register</description>
            <addressOffset>0x4b104</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AW_QOS</name>
                <description>write channel QoS setting</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>lowest priority</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xF</name>
                    <description>highest priority</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMC_M9_FN_MOD</name>
            <displayName>AXIMC_M9_FN_MOD</displayName>
            <description>AXIMC master 9 issuing capability override functionality register</description>
            <addressOffset>0x4b108</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>READ_ISS_OVERRIDE</name>
                <description>override AMIB read issuing capability</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal issuing capability</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>force issuing capability to 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WRITE_ISS_OVERRIDE</name>
                <description>override AMIB write issuing capability</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal issuing capability</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>force issuing capability to 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMC_M10_READ_QOS</name>
            <displayName>AXIMC_M10_READ_QOS</displayName>
            <description>AXIMC master 10 read priority register</description>
            <addressOffset>0x4c100</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AR_QOS</name>
                <description>read channel QoS setting</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>lowest priority</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xF</name>
                    <description>highest priority</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMC_M10_WRITE_QOS</name>
            <displayName>AXIMC_M10_WRITE_QOS</displayName>
            <description>AXIMC master 10 write priority register</description>
            <addressOffset>0x4c104</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AW_QOS</name>
                <description>write channel QoS setting</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>lowest priority</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xF</name>
                    <description>highest priority</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMC_M10_FN_MOD</name>
            <displayName>AXIMC_M10_FN_MOD</displayName>
            <description>AXIMC master 10 issuing capability override functionality register</description>
            <addressOffset>0x4c108</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>READ_ISS_OVERRIDE</name>
                <description>override AMIB read issuing capability</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal issuing capability</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>force issuing capability to 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WRITE_ISS_OVERRIDE</name>
                <description>override AMIB write issuing capability</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal issuing capability</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>force issuing capability to 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMC_M11_READ_QOS</name>
            <displayName>AXIMC_M11_READ_QOS</displayName>
            <description>AXIMC master 11 read priority register</description>
            <addressOffset>0x4d100</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AR_QOS</name>
                <description>read channel QoS setting</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>lowest priority</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xF</name>
                    <description>highest priority</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMC_M11_WRITE_QOS</name>
            <displayName>AXIMC_M11_WRITE_QOS</displayName>
            <description>AXIMC master 11 write priority register</description>
            <addressOffset>0x4d104</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AW_QOS</name>
                <description>write channel QoS setting</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>lowest priority</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xF</name>
                    <description>highest priority</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMC_M11_FN_MOD</name>
            <displayName>AXIMC_M11_FN_MOD</displayName>
            <description>AXIMC master 11 issuing capability override functionality register</description>
            <addressOffset>0x4d108</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>READ_ISS_OVERRIDE</name>
                <description>override AMIB read issuing capability</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal issuing capability</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>force issuing capability to 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WRITE_ISS_OVERRIDE</name>
                <description>override AMIB write issuing capability</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal issuing capability</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>force issuing capability to 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
