STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>BSEC_OTP_SPLOCK2</name>
            <displayName>BSEC_OTP_SPLOCK2</displayName>
            <description>BSEC OTP sticky programming lock register 2</description>
            <addressOffset>0x6c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SPLOCK</name>
                <description>lock programming for the OTP word until next power-on reset</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>OTP word not locked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>OTP word locked for programming</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BSEC_OTP_SWLOCK0</name>
            <displayName>BSEC_OTP_SWLOCK0</displayName>
            <description>BSEC OTP shadow write sticky lock register 0</description>
            <addressOffset>0x7c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000001</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SWLOCK</name>
                <description>lock the writing for the OTP shadow word until next power-on reset.
Note: BSEC_OTP_SWLOCK0 bit 0 is forced to 1 by hardware, writing to this bit has no effect.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>shadow word not locked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>shadow word locked and cannot be written by software</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BSEC_OTP_SWLOCK1</name>
            <displayName>BSEC_OTP_SWLOCK1</displayName>
            <description>BSEC OTP shadow write sticky lock register 1</description>
            <addressOffset>0x80</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000001</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SWLOCK</name>
                <description>lock the writing for the OTP shadow word until next power-on reset.
Note: BSEC_OTP_SWLOCK0 bit 0 is forced to 1 by hardware, writing to this bit has no effect.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>shadow word not locked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>shadow word locked and cannot be written by software</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BSEC_OTP_SWLOCK2</name>
            <displayName>BSEC_OTP_SWLOCK2</displayName>
            <description>BSEC OTP shadow write sticky lock register 2</description>
            <addressOffset>0x84</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000001</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SWLOCK</name>
                <description>lock the writing for the OTP shadow word until next power-on reset.
Note: BSEC_OTP_SWLOCK0 bit 0 is forced to 1 by hardware, writing to this bit has no effect.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>shadow word not locked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>shadow word locked and cannot be written by software</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BSEC_OTP_SRLOCK0</name>
            <displayName>BSEC_OTP_SRLOCK0</displayName>
            <description>BSEC OTP shadow read sticky lock register 0</description>
            <addressOffset>0x94</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFF0</resetMask>
            <fields>
              <field>
                <name>SRLOCK</name>
                <description>prevent reloading of the shadow word from OTP until next power-on reset.
Note: Reloading of OTP word 0 is prevented after its initial read on a system reset.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>OTP word not locked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>OTP word locked and cannot be reloaded</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BSEC_OTP_SRLOCK1</name>
            <displayName>BSEC_OTP_SRLOCK1</displayName>
            <description>BSEC OTP shadow read sticky lock register 1</description>
            <addressOffset>0x98</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFF0</resetMask>
            <fields>
              <field>
                <name>SRLOCK</name>
                <description>prevent reloading of the shadow word from OTP until next power-on reset.
Note: Reloading of OTP word 0 is prevented after its initial read on a system reset.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>OTP word not locked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>OTP word locked and cannot be reloaded</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BSEC_OTP_SRLOCK2</name>
            <displayName>BSEC_OTP_SRLOCK2</displayName>
            <description>BSEC OTP shadow read sticky lock register 2</description>
            <addressOffset>0x9c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFF0</resetMask>
            <fields>
              <field>
                <name>SRLOCK</name>
                <description>prevent reloading of the shadow word from OTP until next power-on reset.
Note: Reloading of OTP word 0 is prevented after its initial read on a system reset.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>OTP word not locked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>OTP word locked and cannot be reloaded</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BSEC_JTAGIN</name>
            <displayName>BSEC_JTAGIN</displayName>
            <description>BSEC JTAG input register </description>
            <addressOffset>0xac</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>JTAG input data
32-bit copy from JTAG SoC register</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BSEC_JTAGOUT</name>
            <displayName>BSEC_JTAGOUT</displayName>
            <description>BSEC JTAG output register </description>
            <addressOffset>0xb0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>JTAG output data
32-bit copy to JTAG SoC register</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BSEC_SCRATCH</name>
            <displayName>BSEC_SCRATCH</displayName>
            <description>BSEC scratch register </description>
            <addressOffset>0xb4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>scratch data
This register is a general purpose register.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BSEC_OTP_DATA0</name>
            <displayName>BSEC_OTP_DATA0</displayName>
            <description>BSEC shadow register 0</description>
            <addressOffset>0x200</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>shadow register read from OTP or written by software (OTP emulation mode)
The update of shadow registers is controlled by other registers and by OTP security mode.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BSEC_OTP_DATA1</name>
            <displayName>BSEC_OTP_DATA1</displayName>
            <description>BSEC shadow register 1</description>
            <addressOffset>0x204</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>shadow register read from OTP or written by software (OTP emulation mode)
The update of shadow registers is controlled by other registers and by OTP security mode.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BSEC_OTP_DATA2</name>
            <displayName>BSEC_OTP_DATA2</displayName>
            <description>BSEC shadow register 2</description>
            <addressOffset>0x208</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>shadow register read from OTP or written by software (OTP emulation mode)
The update of shadow registers is controlled by other registers and by OTP security mode.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BSEC_OTP_DATA3</name>
            <displayName>BSEC_OTP_DATA3</displayName>
            <description>BSEC shadow register 3</description>
            <addressOffset>0x20c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>shadow register read from OTP or written by software (OTP emulation mode)
The update of shadow registers is controlled by other registers and by OTP security mode.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BSEC_OTP_DATA4</name>
            <displayName>BSEC_OTP_DATA4</displayName>
            <description>BSEC shadow register 4</description>
            <addressOffset>0x210</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>shadow register read from OTP or written by software (OTP emulation mode)
The update of shadow registers is controlled by other registers and by OTP security mode.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BSEC_OTP_DATA5</name>
            <displayName>BSEC_OTP_DATA5</displayName>
            <description>BSEC shadow register 5</description>
            <addressOffset>0x214</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>shadow register read from OTP or written by software (OTP emulation mode)
The update of shadow registers is controlled by other registers and by OTP security mode.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BSEC_OTP_DATA6</name>
            <displayName>BSEC_OTP_DATA6</displayName>
            <description>BSEC shadow register 6</description>
            <addressOffset>0x218</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>shadow register read from OTP or written by software (OTP emulation mode)
The update of shadow registers is controlled by other registers and by OTP security mode.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BSEC_OTP_DATA7</name>
            <displayName>BSEC_OTP_DATA7</displayName>
            <description>BSEC shadow register 7</description>
            <addressOffset>0x21c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>shadow register read from OTP or written by software (OTP emulation mode)
The update of shadow registers is controlled by other registers and by OTP security mode.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BSEC_OTP_DATA8</name>
            <displayName>BSEC_OTP_DATA8</displayName>
            <description>BSEC shadow register 8</description>
            <addressOffset>0x220</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>shadow register read from OTP or written by software (OTP emulation mode)
The update of shadow registers is controlled by other registers and by OTP security mode.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BSEC_OTP_DATA9</name>
            <displayName>BSEC_OTP_DATA9</displayName>
            <description>BSEC shadow register 9</description>
            <addressOffset>0x224</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>shadow register read from OTP or written by software (OTP emulation mode)
The update of shadow registers is controlled by other registers and by OTP security mode.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BSEC_OTP_DATA10</name>
            <displayName>BSEC_OTP_DATA10</displayName>
            <description>BSEC shadow register 10</description>
            <addressOffset>0x228</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>shadow register read from OTP or written by software (OTP emulation mode)
The update of shadow registers is controlled by other registers and by OTP security mode.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BSEC_OTP_DATA11</name>
            <displayName>BSEC_OTP_DATA11</displayName>
            <description>BSEC shadow register 11</description>
            <addressOffset>0x22c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>shadow register read from OTP or written by software (OTP emulation mode)
The update of shadow registers is controlled by other registers and by OTP security mode.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BSEC_OTP_DATA12</name>
            <displayName>BSEC_OTP_DATA12</displayName>
            <description>BSEC shadow register 12</description>
            <addressOffset>0x230</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>shadow register read from OTP or written by software (OTP emulation mode)
The update of shadow registers is controlled by other registers and by OTP security mode.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BSEC_OTP_DATA13</name>
            <displayName>BSEC_OTP_DATA13</displayName>
            <description>BSEC shadow register 13</description>
            <addressOffset>0x234</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>shadow register read from OTP or written by software (OTP emulation mode)
The update of shadow registers is controlled by other registers and by OTP security mode.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
