STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>BSEC_VERR</name>
            <displayName>BSEC_VERR</displayName>
            <description>BSEC version register </description>
            <addressOffset>0xff4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000020</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MINREV</name>
                <description>minor revision information</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>MAJREV</name>
                <description>major revision information</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BSEC_IPIDR</name>
            <displayName>BSEC_IPIDR</displayName>
            <description>BSEC identification register </description>
            <addressOffset>0xff8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00100032</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ID</name>
                <description>BSEC identification</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BSEC_SIDR</name>
            <displayName>BSEC_SIDR</displayName>
            <description>BSEC size identification register </description>
            <addressOffset>0xffc</addressOffset>
            <size>0x20</size>
            <resetValue>0xA3C5DD04</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SID</name>
                <description>BSEC size identification</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </registers>
    </peripheral>
	<peripheral>
        <name>CCU</name>
        <description>CCU</description>
		<groupName>CCU</groupName>
        <baseAddress>0x44010000</baseAddress>
		<addressBlock>
          <offset>0x0</offset>
          <size>0x400</size>
          <usage>registers</usage>
        </addressBlock>
		<interrupt>
          <name>FDCAN_CAL</name>
          <description>FDCAN CCU interrupt</description>
          <value>64</value>
        </interrupt>
        <registers>
          <register>
            <name>CCU_CREL</name>
            <displayName>CCU_CREL</displayName>
            <description>Clock calibration unit core release register </description>
            <addressOffset>0x0</addressOffset>
			<size>0x20</size>
            <resetValue>0x11141218</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
			<fields>
              <field>
                <name>DAY</name>
                <description>Timestamp day = 18</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>MON</name>
                <description>Timestamp month = 12</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>YEAR</name>
                <description>Timestamp year =</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>SUBSTEP</name>
                <description>Sub-step of core release = 1</description>
                <bitOffset>20</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>STEP</name>
                <description>Step of core release = 1</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>REL</name>
                <description>Core release = 1</description>
                <bitOffset>28</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>            
          </register>
          <register>
            <name>CCU_CCFG</name>
            <displayName>CCU_CCFG</displayName>
            <description>Calibration configuration register </description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
			<resetValue>0x00000004</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
			<fields>
              <field>
                <name>TQBT</name>
                <description>Time quanta per bit time
Configures the number of time quanta per bit time. Same value as configured in FDCAN modules. The range of the resulting time quanta clock fdcan_tq_ck is from 0.5 MHz (bitrate of 125 kbit/s with 4 tq per bit time) to 25 MHz (bitrate of 1 Mbit/s with 25 tq per bit time). Valid values are 4 to 25. Configured values below 4 are interpreted as 4, values above 25 are interpreted as 25.
Write access by the Host CPU to registers/bits marked with P=Protected Write is possible only when the FDCAN control bits FDCAN_CCCR.CCE = 1 AND FDCAN_CCCR.INIT = 1.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>BCC</name>
                <description>Bypass clock calibration
If this bit is set, the clock input fdcan_ker_ck is routed to the time quanta clock through a clock divider configurable via CDIV, cu_cok is always 1. In this case the baudrate prescaler of the connected FDCANs has to be configured to generate the FDCAN internal time quanta clock.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Clock calibration unit generates time quanta clock</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Clock calibration unit bypassed (default configuration)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFL</name>
                <description>Calibration field length
Write access by the Host CPU to registers/bits marked with P=Protected Write is possible only when the FDCAN control bits FDCAN_CCCR.CCE = 1 AND FDCAN_CCCR.INIT = 1.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Calibration field length is 32 bits</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Calibration field length is 64 bits</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OCPM</name>
                <description>Oscillator clock periods minimum
Configures the minimum number of periods in two CAN bit times. OCPM is used in basic calibration to avoid false measurements in case of glitches on the bus line. The configured number of periods is OCPM  32. The configuration depends on the frequency and the bitrate configured in FDCAN modules (from 125 kbit/s up to 1 Mbit/s). It is recommended to configure a value slightly below two CAN bit times. The reset value is 1.6 bit times at 80 MHz fdcan_ker_ck and 1 Mbit/s CAN bitrate.
Write access by the Host CPU to registers/bits marked with P=Protected Write is possible only when the FDCAN control bits FDCAN_CCCR.CCE = 1 AND FDCAN_CCCR.INIT = 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CDIV</name>
                <description>Clock divider
The clock divider has to be configured when the clock calibration is bypassed (BCC = 1) to ensure that the FDCAN requirement is fulfilled.
Write access by the Host CPU to registers/bits marked with P=Protected Write is possible only when the FDCAN control bits FDCAN_CCCR.CCE = 1 AND FDCAN_CCCR.INIT = 1.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Divide by 1</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Divide by 2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>Divide by 4</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>Divide by 6</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>Divide by 8</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x5</name>
                    <description>Divide by 10</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x6</name>
                    <description>Divide by 12</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7</name>
                    <description>Divide by 14</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x8</name>
                    <description>Divide by 16</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x9</name>
                    <description>Divide by 18</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xA</name>
                    <description>Divide by 20</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xB</name>
                    <description>Divide by 22</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xC</name>
                    <description>Divide by 24</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xD</name>
                    <description>Divide by 26</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xE</name>
                    <description>Divide by 28</description>
                    <value>0xE</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xF</name>
                    <description>Divide by 30</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SWR</name>
                <description>Software reset
Writing a 1 to this bit resets the calibration FSM to state Not_Calibrated
(FDCAN_CCU_CSTAT.CALS = 00). The calibration watchdog value CWD.WDV is also reset. Registers FDCAN_CCFG, FDCAN_CCU_CSTAT and the calibration watchdog configuration CWD.WDC are unchanged. The bit remains set until reset is completed.
Write access by the Host CPU to registers/bits marked with P=Protected Write is possible only when the FDCAN control bits FDCAN_CCCR.CCE = 1 AND FDCAN_CCCR.INIT = 1.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>           
          </register>
          <register>
            <name>CCU_CSTAT</name>
            <displayName>CCU_CSTAT</displayName>
            <description>Calibration status register </description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <resetValue>0x0203FFFF</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>OCPC</name>
                <description>Oscillator clock period counter
Captured number of oscillator clock periods in calibration field (32 or 64 bits). Only valid when the clock calibration unit is in state Precision_Calibrated.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>TQC</name>
                <description>Time quanta counter
Captured number of time quanta in calibration field (32 or 64 bits). Only valid when the clock calibration unit is in state Precision_Calibrated.</description>
                <bitOffset>18</bitOffset>
                <bitWidth>11</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CALS</name>
                <description>Calibration state</description>
                <bitOffset>30</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Not_Calibrated</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Basic_Calibrated</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>Precision_Calibrated</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CCU_CWD</name>
            <displayName>CCU_CWD</displayName>
            <description>Calibration watchdog register </description>
			<addressOffset>0xC</addressOffset>
            <size>0x20</size>
			<resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>WDC</name>
                <description>WDC
Watchdog configuration
Start value of the calibration watchdog counter. With the reset value of 00 the counter is disabled.
Write access by the Host CPU to registers/bits marked with P = Protected Write is possible only when the FDCAN control bits FDCAN_CCCR.CCE = 1 AND FDCAN_CCCR.INIT = 1.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>WDV</name>
                <description>Watchdog value
Actual calibration watchdog counter value.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CCU_IR</name>
            <displayName>CCU_IR</displayName>
            <description>Clock calibration unit interrupt register </description>
            <addressOffset>0x10</addressOffset>
            <size>0x20</size>
		    <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
			<fields>
              <field>
                <name>CWE</name>
                <description>Calibration watchdog event</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No calibration watchdog event</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Calibration watchdog event occurred</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CSC</name>
                <description>Calibration state changed</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Calibration state unchanged</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Calibration state has changed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CCU_IE</name>
            <displayName>CCU_IE</displayName>
            <description>Clock calibration unit interrupt enable register </description>
            <addressOffset>0x14</addressOffset>
            <size>0x20</size>
			 <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
			<fields>
              <field>
                <name>CWEE</name>
                <description>Calibration watchdog event enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Interrupt disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Interrupt enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CSCE</name>
                <description>Calibration state changed enable</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Interrupt disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Interrupt enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>          
          </register>
