STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
        </registers>
    </peripheral>
	<peripheral>
        <name>CRYP</name>
        <description>CRYP</description>
		<groupName>CRYP</groupName>
        <baseAddress>0x54002000</baseAddress>
		<addressBlock>
          <offset>0x0</offset>
          <size>0x400</size>
          <usage>registers</usage>
        </addressBlock>
		<interrupt>
          <name>CRYP</name>
          <description>CRYP global interrupt</description>
          <value>80</value>
        </interrupt>
        <registers>
          <register>
            <name>CRYP_CR</name>
            <displayName>CRYP_CR</displayName>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ALGODIR</name>
                <description>Algorithm Direction
Writing ALGODIR bit while BUSY = 1 has no effect.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Encrypt</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Decrypt</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ALGOMODE</name>
                <description>Algorithm mode
Below definition includes the bit 19:
Writing ALGOMODE bits while BUSY = 1 has no effect.
Others: Reserved, must no be used
Changing ALGOMODE from AES algorithm to DES or TDES (or the reverse) clears KEYVALID. KEYVALID is not cleared when the algorithm type is kept between two ALGOMODE, that is between TDES-ECB and TDES-CBC or between AES-ECB and AES_CTR.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATATYPE</name>
                <description>Data Type selection
This bitfield defines the format of data written in CRYP_DIN or read from CRYP_DOUT registers. For more details refer to registers and data swapping).
Writing DATATYPE bits while BUSY = 1 has no effect.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>32-bit data. No swapping for each word. First word pushed into the IN FIFO (or popped off the OUT FIFO) forms bits 1...32 of the data block, the second word forms bits 33...64 etc.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>16-bit data, or half-word. Each word pushed into the IN FIFO (or popped off the OUT FIFO) is considered as 2 half-words, which are swapped with each other.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>8-bit data, or bytes. Each word pushed into the IN FIFO (or popped off the OUT FIFO) is considered as 4 bytes, which are swapped with each other.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>bit data, or bit-string. Each word pushed into the IN FIFO (or popped off the OUT FIFO) is considered as 32 bits (1st bit of the string at position 0), which are swapped with each other.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>KEYSIZE</name>
                <description>Key size selection (AES mode only)
This bitfield defines the bit-length of the key used for the AES cryptographic core. This bitfield is 'dont care in the DES or TDES modes.
Writing KEYSIZE bits while BUSY = 1 has no effect.
When KEYSIZE is changed KEYVALID is cleared.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>128-bit key length</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>192-bit key length</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>256-bit key length</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>Reserved, do not use this value</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FFLUSH</name>
                <description>CRYP FIFO Flush
When CRYPEN = 0, writing this bit to 1 flushes the IN and OUT FIFOs (that is read and write pointers of the FIFOs are reset). Writing this bit to 0 has no effect. When CRYPEN = 1, writing this bit to 0 or 1 has no effect.
Reading this bit always returns 0.
FFLUSH bit has to be set only when BUSY = 0. If not, the FIFO is flushed, but the block being processed may be pushed into the output FIFO just after the flush operation, resulting in a non-empty FIFO condition.</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No FIFO flush</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>FIFO flush enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CRYPEN</name>
                <description>CRYP processor Enable
This bit is automatically cleared by hardware when the key preparation process ends (ALGOMODE = 0111) or after GCM/GMAC or CCM Initialization phase.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Cryptographic processor peripheral is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Cryptographic processor peripheral is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GCM_CCMPH</name>
                <description>GCM or CCM Phase selection
This bitfield has no effect if GCM, GMAC or CCM algorithm is not selected in ALGOMODE field.
Writing to GCM_CCMPH bits while BUSY = 1 has no effect.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Initialization phase</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Header phase</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>Payload phase</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>Final phase</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ALGOMODE3</name>
                <description>Algorithm mode
Below definition includes the bit 19:
Writing ALGOMODE bits while BUSY = 1 has no effect.
Others: Reserved, must no be used
Changing ALGOMODE from AES algorithm to DES or TDES (or the reverse) clears KEYVALID. KEYVALID is not cleared when the algorithm type is kept between two ALGOMODE, that is between TDES-ECB and TDES-CBC or between AES-ECB and AES_CTR.</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>NPBLB</name>
                <description>Number of Padding Bytes in Last Block of payload.
This padding information must be filled by software before processing the last block of GCM payload encryption or CCM payload decryption, otherwise authentication tag computation is incorrect.
...
Writing NPBLB bits while BUSY = 1 has no effect.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>All bytes are valid (no padding)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Padding for the last LSB byte</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xF</name>
                    <description>Padding for the 15 LSB bytes of last block.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>KMOD0</name>
                <description>Key mode selection
This bitfield defines how the CRYP key is used by the application:
Others: Reserved, must not be used.
When KMOD[1:0] = 10 the selected key value is available in the key registers when KEYVALID is set in SAES_SR register. Otherwise the key error flag KERF is set in CRYP_SR register.
KMOD[1:0] must be set to 10 only when KEYSIZE is correct and a shared key decryption sequence has been successfully completed by the SAES co-processor. Otherwise the key error flag KERF is set in CRYP_SR.
Writing to KMOD bits while BUSY = 1 has no effect.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>KMOD1</name>
                <description>Key mode selection
This bitfield defines how the CRYP key is used by the application:
Others: Reserved, must not be used.
When KMOD[1:0] = 10 the selected key value is available in the key registers when KEYVALID is set in SAES_SR register. Otherwise the key error flag KERF is set in CRYP_SR register.
KMOD[1:0] must be set to 10 only when KEYSIZE is correct and a shared key decryption sequence has been successfully completed by the SAES co-processor. Otherwise the key error flag KERF is set in CRYP_SR.
Writing to KMOD bits while BUSY = 1 has no effect.</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IPRST</name>
                <description>CRYP software reset
Setting the bit resets the CRYP processor, resetting all registers to their default values except the IPRST bit itself.
This bit must be kept cleared while writing any configuration registers.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CRYP_SR</name>
            <displayName>CRYP_SR</displayName>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000003</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>IFEM</name>
                <description>Input FIFO empty flag</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Input FIFO is not empty</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Input FIFO is empty</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IFNF</name>
                <description>Input FIFO not full flag</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Input FIFO is full</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Input FIFO is not full</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OFNE</name>
                <description>Output FIFO not empty flag</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Output FIFO is empty</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Output FIFO is not empty</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OFFU</name>
                <description>Output FIFO full flag</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Output FIFO is not full</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Output FIFO is full</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BUSY</name>
                <description>Busy bit
either that the CRYP core is disabled (CRYPEN = 0 in the CRYP_CR register) and the last processing has completed,
or the CRYP core is waiting for enough data in the input FIFO or enough free space in the output FIFO (that is in each case at least 2 words in the DES, 4 words in the AES).</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The CRYP core is not processing any data. The reason is: </description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The CRYP core is currently processing a block of data or a key preparation is ongoing (AES ECB or CBC decryption only). BUSY is also set when an AES key is being transfered from SAES to CRYP.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>KERF</name>
                <description>Key error flag
KERF is a read-only bit. It is set by hardware when key information failed to load into key registers.
KERF is set if one of the below errors occurred:
The user application did not write the key registers in the correct sequence (refer to  for details).
The CRYP failed to load the AES key shared by SAES peripheral (KMOD = 10).
KMOD = 10 with ALGOMODE selecting either DES or TDES algorithm.
KERF must be cleared by the application, for example through IPRST bit of CRYP_CR, otherwise KEYVALID cannot be set.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No key error detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Key information failed to load into key registers</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>KEYVALID</name>
                <description>Key valid
KEYVALID is a read-only bit. It is set by hardware when the expected amount of key information has been loaded in CRYP_KEYx key registers. It is valid for both AES and DES/TDES algorithms.
When KMOD = 00, the use application must write the key registers in the correct sequence, otherwise KERF flag is set and KEYVALID remains at zero.
When KMOD = 10 (AES Shared key mode), the shared key is loaded successfully from SAES to CRYP when KEYVALID is set. When an error occurs KERF flag is set in CRYP_SR and KEYVALID remains at zero.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No valid key information is available in key registers. CRYPEN bit in CRYP_CR cannot be set.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Valid key information, defined by KEYSIZE in CRYP_CR, is loaded in key registers.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CRYP_DIN</name>
            <displayName>CRYP_DIN</displayName>
            <description>CRYP data input register </description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DATAIN</name>
                <description>Data Input
On read FIFO is popped (last written value is returned), and its value is returned if CRYPEN = 0. If CRYPEN = 1 DATAIN register returns an undefined value.
On write current register content is pushed inside the FIFO.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CRYP_DOUT</name>
            <displayName>CRYP_DOUT</displayName>
            <description>CRYP data output register </description>
            <addressOffset>0xc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DATAOUT</name>
                <description>Data Output
On read returns output FIFO content (pointed to by read pointer), else returns an undefined value.
On write, no effect.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
