STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>CRYP_CSGCMCCM5R</name>
            <displayName>CRYP_CSGCMCCM5R</displayName>
            <description>CRYP context swap GCM-CCM registers</description>
            <addressOffset>0x64</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSGCMCCM5</name>
                <description>CRYP processor internal register states for GCM, GMAC and CCM modes.
Note: This register is not used in DES/TDES or other AES modes than the ones indicated</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CRYP_CSGCMCCM6R</name>
            <displayName>CRYP_CSGCMCCM6R</displayName>
            <description>CRYP context swap GCM-CCM registers</description>
            <addressOffset>0x68</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSGCMCCM6</name>
                <description>CRYP processor internal register states for GCM, GMAC and CCM modes.
Note: This register is not used in DES/TDES or other AES modes than the ones indicated</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CRYP_CSGCMCCM7R</name>
            <displayName>CRYP_CSGCMCCM7R</displayName>
            <description>CRYP context swap GCM-CCM registers</description>
            <addressOffset>0x6c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSGCMCCM7</name>
                <description>CRYP processor internal register states for GCM, GMAC and CCM modes.
Note: This register is not used in DES/TDES or other AES modes than the ones indicated</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CRYP_CSGCM0R</name>
            <displayName>CRYP_CSGCM0R</displayName>
            <description>CRYP context swap GCM registers</description>
            <addressOffset>0x70</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSGCM0</name>
                <description>CRYP processor internal register states for GCM and GMAC modes.
Note: This register is not used in DES/TDES or other AES modes than the ones indicated</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CRYP_CSGCM1R</name>
            <displayName>CRYP_CSGCM1R</displayName>
            <description>CRYP context swap GCM registers</description>
            <addressOffset>0x74</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSGCM1</name>
                <description>CRYP processor internal register states for GCM and GMAC modes.
Note: This register is not used in DES/TDES or other AES modes than the ones indicated</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CRYP_CSGCM2R</name>
            <displayName>CRYP_CSGCM2R</displayName>
            <description>CRYP context swap GCM registers</description>
            <addressOffset>0x78</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSGCM2</name>
                <description>CRYP processor internal register states for GCM and GMAC modes.
Note: This register is not used in DES/TDES or other AES modes than the ones indicated</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CRYP_CSGCM3R</name>
            <displayName>CRYP_CSGCM3R</displayName>
            <description>CRYP context swap GCM registers</description>
            <addressOffset>0x7c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSGCM3</name>
                <description>CRYP processor internal register states for GCM and GMAC modes.
Note: This register is not used in DES/TDES or other AES modes than the ones indicated</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CRYP_CSGCM4R</name>
            <displayName>CRYP_CSGCM4R</displayName>
            <description>CRYP context swap GCM registers</description>
            <addressOffset>0x80</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSGCM4</name>
                <description>CRYP processor internal register states for GCM and GMAC modes.
Note: This register is not used in DES/TDES or other AES modes than the ones indicated</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CRYP_CSGCM5R</name>
            <displayName>CRYP_CSGCM5R</displayName>
            <description>CRYP context swap GCM registers</description>
            <addressOffset>0x84</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSGCM5</name>
                <description>CRYP processor internal register states for GCM and GMAC modes.
Note: This register is not used in DES/TDES or other AES modes than the ones indicated</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CRYP_CSGCM6R</name>
            <displayName>CRYP_CSGCM6R</displayName>
            <description>CRYP context swap GCM registers</description>
            <addressOffset>0x88</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSGCM6</name>
                <description>CRYP processor internal register states for GCM and GMAC modes.
Note: This register is not used in DES/TDES or other AES modes than the ones indicated</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CRYP_CSGCM7R</name>
            <displayName>CRYP_CSGCM7R</displayName>
            <description>CRYP context swap GCM registers</description>
            <addressOffset>0x8c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSGCM7</name>
                <description>CRYP processor internal register states for GCM and GMAC modes.
Note: This register is not used in DES/TDES or other AES modes than the ones indicated</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CRYP_HWCFGR</name>
            <displayName>CRYP_HWCFGR</displayName>
            <addressOffset>0x3f0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000131</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CFG1</name>
                <description>HW Generic 1
This field returns the tdes_impl generic value (0x1).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFG2</name>
                <description>HW Generic 2
This field returns the aes_impl generic value (0x3).</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFG3</name>
                <description>HW Generic 3
This field returns the dma_version generic value (0x1).</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFG4</name>
                <description>HW Generic 4
Reserved, must be kept at reset value.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CRYP_VERR</name>
            <displayName>CRYP_VERR</displayName>
            <addressOffset>0x3f4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000023</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MINVER</name>
                <description>CRYP processor minor version
This field returns the CRYP processor minor version.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>MAJVER</name>
                <description>CRYP processor major version
This field returns the CRYP processor major version.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CRYP_IPIDR</name>
            <displayName>CRYP_IPIDR</displayName>
            <addressOffset>0x3f8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00170011</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ID</name>
                <description>Identification Code
This field returns the identification code of the CRYP processor.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CRYP_SIDR</name>
            <displayName>CRYP_SIDR</displayName>
            <addressOffset>0x3fc</addressOffset>
            <size>0x20</size>
            <resetValue>0xA3C5DD01</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SID</name>
                <description>Size identification code
This field returns the size identification code of the CRYP processor as defined below:
SID[31:8] = 0xA3C5DD (fixed code)
SID[7:0] = 0x01 (1-Kbyte address decoding)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
