STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
        </registers>
    </peripheral>
	<peripheral>
        <name>DBGMCU</name>
        <description>Microcontroller Debug Unit</description>
        <groupName>DBGMCU</groupName>
		<baseAddress>0x50081000</baseAddress>
		<addressBlock>
          <offset>0x0</offset>
          <size>0x1000</size>
          <usage>registers</usage>
        </addressBlock>
        <registers>
          <register>
            <name>DBGMCU_IDC</name>
            <displayName>DBGMCU_IDC</displayName>
            <description>DBGMCU identity code register </description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <resetValue>0x10006501</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DEV_ID</name>
                <description>device ID</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x501</name>
                    <description>STM32MP13xx</description>
                    <value>0x501</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REV_ID</name>
                <description>revision
0x1000 = Rev. 1</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_CR</name>
            <displayName>DBGMCU_CR</displayName>
            <description>DBGMCU configuration register </description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DBGLP</name>
                <description>Low power mode debug enable</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. In Stop, LP-Stop, LPLV-Stop, LPLV-Stop2 and Standby mode, debug access is lost.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>automatic clock stop/power down disabled. All active clocks and oscillators continue to run during low power mode, and the VDDCORE and VDDCPU supplies are maintained, allowing full debug capability. On exit from Standby or LPLV-Stop2 modes, the Cortex-A7 is reset.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_APB4FZ</name>
            <displayName>DBGMCU_APB4FZ</displayName>
            <description>DBGMCU APB4 peripheral freeze register </description>
            <addressOffset>0x2c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>IWDG2</name>
                <description>IWDG2 stop in debug</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. IWDG2 continues to operate while Cortex-A7 is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. IWDG2 is frozen while  Cortex-A7 core is in debug mode. No accesses are allowed on its APB interface.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_APB1FZ</name>
            <displayName>DBGMCU_APB1FZ</displayName>
            <description>DBGMCU APB1 peripheral freeze register </description>
            <addressOffset>0x34</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TIM2</name>
                <description>TIM2 stop in debug</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Normal operation. TIM2 continues to operate while Cortex-A7 is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Stop in debug. TIM2 is frozen while the Cortex-A7 core is in debug mode. </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM3</name>
                <description>TIM3 stop in debug</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. TIM3 continues to operate while Cortex-A7 is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. TIM3 is frozen while the Cortex-A7 core is in debug mode. </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM4</name>
                <description>TIM4 stop in debug</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. TIM4 continues to operate while Cortex-A7 is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. TIM4 is frozen while the Cortex-A7 core is in debug mode. </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM5</name>
                <description>TIM5 stop in debug</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. TIM5 continues to operate while Cortex-A7 is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. TIM5 is frozen while the Cortex-A7 core is in debug mode. </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM6</name>
                <description>TIM6 stop in debug</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. TIM6 continues to operate while Cortex-A7 is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. TIM6 is frozen while the Cortex-A7 core is in debug mode. </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM7</name>
                <description>TIM7 stop in debug</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. TIM7 continues to operate while Cortex-A7 is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. TIM7 is frozen while the Cortex-A7 core is in debug mode. </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LPTIM1</name>
                <description>LPTIM1 stop in debug</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. LPTIM1 continues to operate while Cortex-A7 is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. LPTIM1 is frozen while the Cortex-A7 core is in debug mode. </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C1</name>
                <description>I2C1 SMBUS timeout stop in debug</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. I2C1 SMBUS timeout continues to operate while Cortex-A7 is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. I2C1 SMBUS timeout is frozen while the Cortex-A7 core is in debug mode. </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C2</name>
                <description>I2C2 SMBUS timeout stop in debug</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. I2C2 SMBUS timeout continues to operate while Cortex-A7 is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. I2C2 SMBUS timeout is frozen while the Cortex-A7 core is in debug mode. </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_APB2FZ</name>
            <displayName>DBGMCU_APB2FZ</displayName>
            <description>DBGMCU APB2 peripheral freeze register </description>
            <addressOffset>0x3c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TIM1</name>
                <description>TIM1 stop in debug</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. TIM1 continues to operate while Cortex-A7 is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. TIM1 is frozen while the Cortex-A7 core is in debug mode.  </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM8</name>
                <description>TIM8 stop in debug</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. TIM8 continues to operate while Cortex-A7 is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. TIM8 is frozen while the Cortex-A7 core is in debug mode.  </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FDCAN</name>
                <description>FDCAN stop in debug</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. FDCAN continues to operate while Cortex-A7 is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. FDCAN is frozen while  Cortex-A7 core is in debug mode. </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_APB3FZ</name>
            <displayName>DBGMCU_APB3FZ</displayName>
            <description>DBGMCU APB3 peripheral freeze register </description>
            <addressOffset>0x44</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LPTIM2</name>
                <description>LPTIM2 stop in debug</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. LPTIM2 continues to operate while Cortex-A7 is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. LPTIM2 is frozen while the Cortex-A7 core is in debug mode.  </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LPTIM3</name>
                <description>LPTIM3 stop in debug</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. LPTIM3 continues to operate while Cortex-A7 is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. LPTIM3 is frozen while the Cortex-A7 core is in debug mode.  </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LPTIM4</name>
                <description>LPTIM4 stop in debug</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. LPTIM4 continues to operate while Cortex-A7 is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. LPTIM4 is frozen while the Cortex-A7 core is in debug mode.  </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LPTIM5</name>
                <description>LPTIM5 stop in debug</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. LPTIM5 continues to operate while Cortex-A7 is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. LPTIM5 is frozen while the Cortex-A7 core is in debug mode.  </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_APB5FZ</name>
            <displayName>DBGMCU_APB5FZ</displayName>
            <description>DBGMCU APB5 peripheral freeze register </description>
            <addressOffset>0x4c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>IWDG1</name>
                <description>independent watchdog 1 stop in debug</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. Watchdog continues to count while Cortex-A7 is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. IWGD1 is frozen while the Cortex-A7 core is in debug mode. No accesses are allowed on its APB interface. </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RTC</name>
                <description>RTC stop in debug</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. RTC continues to operate while Cortex-A7 is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. RTC is frozen while the Cortex-A7 core is in debug mode.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
