STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>DBGMCU_APB6FZ</name>
            <displayName>DBGMCU_APB6FZ</displayName>
            <description>DBGMCU APB6 peripheral freeze register </description>
            <addressOffset>0x54</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>I2C3</name>
                <description>I2C3 SMBUS stop in debug</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. I2C3 SMBUS timeout continues to operate while Cortex-A7 is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. I2C3 SMBUS timeout is frozen while Cortex-A7 is in debug mode. </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C4</name>
                <description>I2C4 SMBUS stop in debug</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. I2C4 SMBUS timeout continues to operate while Cortex-A7 is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. I2C4 SMBUS timeout is frozen while Cortex-A7 is in debug mode. </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C5</name>
                <description>I2C5 SMBUS stop in debug</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. I2C5 SMBUS timeout continues to operate while Cortex-A7 is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. I2C5 SMBUS timeout is frozen while Cortex-A7 is in debug mode. </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM12</name>
                <description>TIM12 stop in debug</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. TIM12 continues to operate while Cortex-A7 is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. TIM12 is frozen while Cortex-A7 is in debug mode. </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM13</name>
                <description>TIM13 stop in debug</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. TIM13 continues to operate while Cortex-A7 is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. TIM13 is frozen while Cortex-A7 is in debug mode. </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM14</name>
                <description>TIM14 stop in debug</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. TIM14 continues to operate while Cortex-A7 is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. TIM14 is frozen while Cortex-A7 is in debug mode. </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM15</name>
                <description>TIM15 stop in debug</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. TIM15 continues to operate while Cortex-A7 is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. TIM15 is frozen while Cortex-A7 is in debug mode. </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM16</name>
                <description>TIM16 stop in debug</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. TIM16 continues to operate while Cortex-A7 is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. TIM16 is frozen while Cortex-A7 is in debug mode. </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM17</name>
                <description>TIM17 stop in debug</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. TIM17 continues to operate while Cortex-A7 is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. TIM17 is frozen while Cortex-A7 is in debug mode. </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_PIDR4</name>
            <displayName>DBGMCU_PIDR4</displayName>
            <description>DBGMCU peripheral ID4 register </description>
            <addressOffset>0xfd0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DES_2</name>
                <description>JEDEC continuation code
Indicates the designer of the component, together with the identity code.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>indicates that STMicroelectronics JEDEC identity code is on the 1st bank</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SIZE</name>
                <description>component memory size indicator
Indicates the total contiguous size of the memory window used by the component in powers of two from the standard 4 Kbytes. If a component only requires the standard 4 Kbytes, this bit field must read as 0x0. For 8 Kbytes it is set to 0x1. For 16 Kbytes it set to 0x2. For 32 Kbytes it is set to 0x3, and similarly for larger memory windows.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>the device only occupies 4 Kbytes of memory</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_PIDR0</name>
            <displayName>DBGMCU_PIDR0</displayName>
            <description>DBGMCU peripheral ID0 register </description>
            <addressOffset>0xfe0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PART_0</name>
                <description>bits [7:0] of the component part number
This field is specified by the designer of the component.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>CoreSight DBGMCU Part Number[7:0]. Eight least significant bits of the part number (0x000).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_PIDR1</name>
            <displayName>DBGMCU_PIDR1</displayName>
            <description>DBGMCU peripheral ID1 register </description>
            <addressOffset>0xfe4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PART_1</name>
                <description>bits [11:8] of the component part number
Specified by the designer of the component.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>CoreSight DBGMCU part number[11:8]. Most significant four bits of the part number (0x000).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DES_0</name>
                <description>bits [3:0] of the JEDEC identity code
Indicates the designer of the component, together with the continuation code.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>least significant four bits of the JEP106 identity code (0x20 = STMicroelectronics)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_PIDR2</name>
            <displayName>DBGMCU_PIDR2</displayName>
            <description>DBGMCU peripheral ID2 register </description>
            <addressOffset>0xfe8</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000000A</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DES_1</name>
                <description>bits [6:4] of the JEDEC identity code
Indicates the designer of the component, together with the continuation code.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>most significant three bits of the JEP106 identity code (0x20 = STMicroelectronics)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>JEDEC</name>
                <description>JEDEC assigned value usage
Indicates the use of a JEDEC assigned value. This bit is always set.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>the designer ID is specified by JEDEC (refer to http://www.jedec.org)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REVISION</name>
                <description>incremental component design version
An incremental value starting from 0x0 for the first design of this component. The value increases by one at both major and minor revisions and is used as a look-up to establish the exact major and minor revisions.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>this component is at rev0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_PIDR3</name>
            <displayName>DBGMCU_PIDR3</displayName>
            <description>DBGMCU peripheral ID3 register </description>
            <addressOffset>0xfec</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CMOD</name>
                <description>customer modification indicator
When the component is a reusable IP, this value indicates if the customer has modified the behavior of the component. In most cases this field is 0x0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>no modification made</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REVAND</name>
                <description>minor fix indicator
Indicates minor errata fixes specific to the design, for example metal fixes after implementation. In most cases this field is 0x0. Arm recommends that the component designers ensure that the bit field can be changed by a metal fix if required, for example by driving the bit field from registers that reset to zero.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>no metal fix in the component</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_CIDR0</name>
            <displayName>DBGMCU_CIDR0</displayName>
            <description>DBGMCU component ID0 register </description>
            <addressOffset>0xff0</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000000D</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRMBL_0</name>
                <description>bits [31:24] of component identification
Component identification register, that indicates that the identification registers are present.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0xD</name>
                    <description>identification value</description>
                    <value>0xD</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_CIDR1</name>
            <displayName>DBGMCU_CIDR1</displayName>
            <description>DBGMCU component ID1 register </description>
            <addressOffset>0xff4</addressOffset>
            <size>0x20</size>
            <resetValue>0x000000F0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRMBL_1</name>
                <description>bits [19:16] of component identification.
Component identification register, that indicates that the identification registers are present.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>identification value</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLASS</name>
                <description>component class
Indicates the class of the component, for example, ROM table or CoreSight component.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0xF</name>
                    <description>indicates that the component is a non-CoreSight component</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_CIDR2</name>
            <displayName>DBGMCU_CIDR2</displayName>
            <description>DBGMCU component ID2 register </description>
            <addressOffset>0xff8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000005</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRMBL_2</name>
                <description>bits [15:8] of component identification
Component identification register, that indicates that the identification registers are present.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x5</name>
                    <description>identification value</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_CIDR3</name>
            <displayName>DBGMCU_CIDR3</displayName>
            <description>DBGMCU component ID3 register </description>
            <addressOffset>0xffc</addressOffset>
            <size>0x20</size>
            <resetValue>0x000000B1</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRMBL_3</name>
                <description>bits [7:0] of component identification
Component identification register, that indicates that the identification registers are present.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0xB1</name>
                    <description>identification value</description>
                    <value>0xB1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
