STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
        </registers>
    </peripheral>
    <peripheral>
      <name>DCMIPP</name>
      <description>DCMIPP register block</description>
      <groupName>DCMIPP</groupName>
      <baseAddress>0x5A000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DCMIPP_IPGR1</name>
          <displayName>DCMIPP_IPGR1</displayName>
          <description>DCMIPP IP-Plug global register 1</description>
          <addressOffset>0x000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MEMORYPAGE</name>
              <description>Memory page size, as power of 2 of 64-byte units:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>64 bytes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>128 bytes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QOS_MODE</name>
              <description>Quality of service
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMIPP_IPGR2</name>
          <displayName>DCMIPP_IPGR2</displayName>
          <description>DCMIPP IP-Plug global register 2</description>
          <addressOffset>0x004</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PSTART</name>
              <description>Request to lock the IP-Plug, to allow reconfiguration.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No lock requested, IP-Plug runs on demand by background HW.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Lock requested: IP-Plug freezes shortly (see IDLE bit when lock is active).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMIPP_IPGR3</name>
          <displayName>DCMIPP_IPGR3</displayName>
          <description>DCMIPP IP-Plug global register 3</description>
          <addressOffset>0x008</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDLE</name>
              <description>Status of IP-Plug
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>IP-Plug is running (on demand by background HW)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>IP-Plug is currently locked and can be reconfigured</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMIPP_IPGR8</name>
          <displayName>DCMIPP_IPGR8</displayName>
          <description>DCMIPP IP-Plug identification register</description>
          <addressOffset>0x01C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0xAA040314</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DID</name>
              <description>Division identifier (0x14)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REVID</name>
              <description>Revision identifier (0x03)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ARCHIID</name>
              <description>Architecture identifier (0x04)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IPPID</name>
              <description>IP identifier (0xAA)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMIPP_IPC1R1</name>
          <displayName>DCMIPP_IPC1R1</displayName>
          <description>DCMIPP IP-Plug Clientx register 1</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRAFFIC</name>
              <description>Burst size as power of 2 of 8-byte units
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>8 bytes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>16 bytes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OTR</name>
              <description>Maximum outstanding transactions
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Maximum two outstanding transactions ongoing.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMIPP_IPC1R2</name>
          <displayName>DCMIPP_IPC1R2</displayName>
          <description>DCMIPP IP-Plug Clientx register 2</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00010000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SVCMAPPING</name>
              <description>Non-user, must be kept at reset value.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WLRU</name>
              <description>Ratio for WLRU[3:0] arbitration
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Ratio part = 1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Ratio part = 2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMIPP_IPC1R3</name>
          <displayName>DCMIPP_IPC1R3</displayName>
          <description>DCMIPP IP-Plug Clientx register 3</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x003F0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DPREGSTART</name>
              <description>Start word (AXI width = 64 bits) of the FIFO of Clientx.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPREGEND</name>
              <description>End word (AXI width = 64 bits) of the FIFO of Clientx.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMIPP_PRCR</name>
          <displayName>DCMIPP_PRCR</displayName>
          <description>DCMIPP parallel interface control register</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ESS</name>
              <description>Embedded synchronization select
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Hardware synchronization data capture (frame/line start/stop) is synchronized with the HSYNC/VSYNC signals.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Embedded synchronization data capture is synchronized with synchronization codes embedded in the data flow.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCKPOL</name>
              <description>Pixel clock polarity
</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Falling edge active</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising edge active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSPOL</name>
              <description>Horizontal synchronization polarity
</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>HSYNC active low</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>HSYNC active high</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VSPOL</name>
              <description>Vertical synchronization polarity
</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>VSYNC active low</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>VSYNC active high</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDM</name>
              <description>Extended data mode
</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Interface captures 8-bit data on every pixel clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Interface captures 10-bit data on every pixel clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>Interface captures 12-bit data on every pixel clock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>Interface captures 14-bit data on every pixel clock</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x4</name>
                  <description>Interface captures 16-bit data on every pixel clock</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Parallel interface enable
</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Parallel interface disabled to lower power consumption</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Parallel interface enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORMAT</name>
              <description>Other values: data are captured and output as-is only through the data/dump pipeline (for example JPEG or byte input format).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x1E</name>
                  <description>YUV422</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x22</name>
                  <description>RGB565</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x24</name>
                  <description>RGB888 (= YUV444)</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2A</name>
                  <description>RAW8</description>
                  <value>0x2A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2B</name>
                  <description>RAW10</description>
                  <value>0x2B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2C</name>
                  <description>RAW12</description>
                  <value>0x2C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2D</name>
                  <description>RAW14</description>
                  <value>0x2D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x4A</name>
                  <description>monochrome 8-bit</description>
                  <value>0x4A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x4B</name>
                  <description>monochrome 10-bit</description>
                  <value>0x4B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x4C</name>
                  <description>monochrome 12-bit</description>
                  <value>0x4C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x4D</name>
                  <description>monochrome 14-bit</description>
                  <value>0x4D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x5A</name>
                  <description>byte stream (JPEG, compressed video)</description>
                  <value>0x5A</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWAPCYCLES</name>
              <description>Swap data (cycle 0 vs.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Swap active: the data of cycle 1 is used before the data of cycle 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWAPBITS</name>
              <description>Swap LSB vs.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>As received</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Swapped MSB vs.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMIPP_PRESCR</name>
          <displayName>DCMIPP_PRESCR</displayName>
          <description>DCMIPP parallel interface embedded synchronization code register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FSC</name>
              <description>Frame start delimiter code
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSC</name>
              <description>Line start delimiter code
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEC</name>
              <description>Line end delimiter code
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEC</name>
              <description>Frame end delimiter code
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
