STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
      </registers>
    </peripheral>
	<peripheral>
        <name>DDRCTRL</name>
        <description>DDRCTRL</description>
		<groupName>DDRCTRL</groupName>
        <baseAddress>0x5A003000</baseAddress>
        <addressBlock>
          <offset>0x0</offset>
          <size>0x1000</size>
          <usage>registers</usage>
        </addressBlock>
        <registers>
          <register>
            <name>DDRCTRL_MSTR</name>
            <displayName>DDRCTRL_MSTR</displayName>
            <description>DDRCTRL master register 0 </description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00040001</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DDR3</name>
                <description>Selects DDR3 SDRAM
- 1 - DDR3 SDRAM device in use
- 0 - non-DDR3 SDRAM device in use
Only present in designs that support DDR3.
Programming mode: Static</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LPDDR2</name>
                <description>Selects LPDDR2 SDRAM
- 1 - LPDDR2 SDRAM device in use.
- 0 - non-LPDDR2 device in use
Present only in designs configured to support LPDDR2.
Programming mode: Static</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LPDDR3</name>
                <description>Selects LPDDR3 SDRAM
- 1 - LPDDR3 SDRAM device in use.
- 0 - non-LPDDR3 device in use
Present only in designs configured to support LPDDR3.
Programming mode: Static</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>BURSTCHOP</name>
                <description>When set, enable burst-chop (BC4 or 8 on-the-fly) in DDR3/DDR4. The burst-chop for Reads is exercised only in HIF configurations (UMCTL2_INCL_ARB not set) and if in full bus width mode (MSTR.data_bus_width = 00) and if MEMC_BURST_LENGTH=8 or 16. The burst-chop for writes is exercised only if partial writes enabled (UMCTL2_PARTIAL_WR=1) and if CRC is disabled (CRCPARCTL1.crc_enable = 0).
The BC4 (fixed) mode is not supported.
Programming mode: Static</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EN_2T_TIMING_MODE</name>
                <description>If 1, then the DDRCTRL uses 2T timing. Otherwise, uses 1T timing. In 2T timing, all command signals (except chip select) are held for 2 clocks on the SDRAM bus. The chip select is asserted on the second cycle of the command
Note: 2T timing is not supported in LPDDR2/LPDDR3/LPDDR4 mode
Note: 2T timing is not supported if the configuration parameter MEMC_CMD_RTN2IDLE is set
Note: 2T timing is not supported in DDR4 geardown mode.
Note: 2T timing is not supported in Shared-AC dual channel mode and the register value is don't care.
Programming mode: Static</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA_BUS_WIDTH</name>
                <description>Selects proportion of DQ bus width that is used by the SDRAM
- 00 - Full DQ bus width to SDRAM
- 01 - Half DQ bus width to SDRAM
- 10 - Quarter DQ bus width to SDRAM
- 11 - Reserved.
Note that half bus width mode is only supported when the SDRAM bus width is a multiple of 16, and quarter bus width mode is only supported when the SDRAM bus width is a multiple of 32 and the configuration parameter MEMC_QBUS_SUPPORT is set. the bus width refers to DQ bus width (excluding any ECC width).
Programming mode: Static</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DLL_OFF_MODE</name>
                <description>Set to 1 when the DDRCTRL and DRAM has to be put in DLL-off mode for low frequency operation.
Set to 0 to put DDRCTRL and DRAM in DLL-on mode for normal frequency operation.
If DDR4 CRC/parity retry is enabled (CRCPARCTL1.crc_parity_retry_enable = 1), dll_off_mode is not supported, and this bit must be set to '0'.
Programming mode: Quasi-dynamic Group 2</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>BURST_RDWR</name>
                <description>SDRAM burst length used:
- 0001 - Burst length of 2 (only supported for mDDR)
- 0010 - Burst length of 4
- 0100 - Burst length of 8
- 1000 - Burst length of 16 (only supported for mDDR, LPDDR2, and LPDDR4)
All other values are reserved.
This controls the burst size used to access the SDRAM. This must match the burst length mode register setting in the SDRAM. (For BC4/8 on-the-fly mode of DDR3 and DDR4, set this field to 0x0100) The burst length of 2 is not supported with the AXI port when MEMC_BURST_LENGTH is 8.
The burst length of 2 is only supported when the controller is operating in 1:1 frequency mode.
For DDR3, DDR4 and LPDDR3, this must be set to 0x0100 (BL8).
For LPDDR4, this must be set to 0x1000 (BL16).
Programming mode: Static</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_STAT</name>
            <displayName>DDRCTRL_STAT</displayName>
            <description>DDRCTRL operating mode status register </description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>OPERATING_MODE</name>
                <description>Operating mode. This is 3-bits wide in configurations with mDDR/LPDDR2/LPDDR3/LPDDR4/DDR4 support and 2-bits in all other configurations.
Condition non-mDDR/LPDDR2/LPDDR3/LPDDR4 and non-DDR4 designs:
- 000 - Init
- 001 - Normal
- 010 - Power-down
- 011 - Self refresh
Condition mDDR/LPDDR2/LPDDR3 or DDR4 designs:
- 000 - Init
- 001 - Normal
- 010 - Power-down
- 011 - Self refresh
- 1XX - Deep power-down / Maximum Power Saving Mode
- 000 - Init
- 001 - Normal
- 010 - Power-down
- 011 - Self refresh / Self refresh power-down
Programming mode: Dynamic</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>SELFREF_TYPE</name>
                <description>Flags if Self Refresh (except LPDDR4) or SR-Powerdown (LPDDR4) is entered and if it was under Automatic Self Refresh control only or not.
- 00 - SDRAM is not in Self Refresh (except LPDDR4) or SR-Powerdown (LPDDR4). If retry is enabled by CRCPARCTRL1.crc_parity_retry_enable, this also indicates SRE command is still in parity error window or retry is in-progress.
- 11 - SDRAM is in Self Refresh (except LPDDR4) or SR-Powerdown (LPDDR4), which was caused by Automatic Self Refresh only. If retry is enabled, this guarantees SRE command is executed correctly without parity error.
- 10 - SDRAM is in Self Refresh (except LPDDR4) or SR-Powerdown (LPDDR4), which was not caused solely under Automatic Self Refresh control. It could have been caused by Hardware Low-power Interface and/or Software (PWRCTL.selfref_sw). If retry is enabled, this guarantees SRE command is executed correctly without parity error.
- 01 - SDRAM is in Self Refresh, which was caused by PHY Master Request.
Programming mode: Dynamic</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>SELFREF_CAM_NOT_EMPTY</name>
                <description>Self refresh with CAMs not empty. Set to 1 when Self Refresh is entered but CAMs are not drained. Cleared after exiting Self Refresh.
Programming mode: Dynamic</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_MRCTRL0</name>
            <displayName>DDRCTRL_MRCTRL0</displayName>
            <description>DDRCTRL mode register read/write control register 0	</description>
            <addressOffset>0x10</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000010</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MR_TYPE</name>
                <description>Indicates whether the mode register operation is read or write. Only used for LPDDR2/LPDDR3/LPDDR4/DDR4.
- 0 - Write
- 1 - Read
Programming mode: Dynamic</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MR_ADDR</name>
                <description>Address of the mode register that is to be written to.
- 0000 - MR0
- 0001 - MR1
- 0010 - MR2
- 0011 - MR3
- 0100 - MR4
- 0101 - MR5
- 0110 - MR6
- 0111 - MR7
Don't Care for LPDDR2/LPDDR3/LPDDR4 (see MRCTRL1.mr_data for mode register addressing in LPDDR2/LPDDR3/LPDDR4)
This signal is also used for writing to control words of the register chip on RDIMMs/LRDIMMs. In that case, it corresponds to the bank address bits sent to the RDIMM/LRDIMM
In case of DDR4, the bit[3:2] corresponds to the bank group bits. Therefore, the bit[3] as well as the bit[2:0] must be set to an appropriate value which is considered both the Address Mirroring of UDIMMs/RDIMMs/LRDIMMs and the Output Inversion of RDIMMs/LRDIMMs.
Programming mode: Dynamic</description>
                <bitOffset>12</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MR_WR</name>
                <description>Setting this register bit to 1 triggers a mode register read or write operation. When the MR operation is complete, the DDRCTRL automatically clears this bit. The other register fields of this register must be written in a separate APB transaction, before setting this mr_wr bit. It is recommended NOT to set this signal if in Init, Deep power-down or MPSM operating modes.
Programming mode: Dynamic</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_MRCTRL1</name>
            <displayName>DDRCTRL_MRCTRL1</displayName>
            <description>DDRCTRL mode register read/write control register 1	</description>
            <addressOffset>0x14</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MR_DATA</name>
                <description>Mode register write data for all non-LPDDR2/non-LPDDR3/non-LPDDR4 modes.
For LPDDR2/LPDDR3/LPDDR4, MRCTRL1[15:0] are interpreted as
[15:8] MR Address
[7:0] MR data for writes, don't care for reads. This is 18-bits wide in configurations with DDR4 support and 16-bits in all other configurations.
Programming mode: Dynamic</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_MRSTAT</name>
            <displayName>DDRCTRL_MRSTAT</displayName>
            <description>DDRCTRL mode register read/write status register	</description>
            <addressOffset>0x18</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MR_WR_BUSY</name>
                <description>The SoC core may initiate a MR write operation only if this signal is low. This signal goes high in the clock after the DDRCTRL accepts the MRW/MRR request. It goes low when the MRW/MRR command is issued to the SDRAM. It is recommended not to perform MRW/MRR commands when 'MRSTAT.mr_wr_busy' is high.
- 0 - Indicates that the SoC core can initiate a mode register write operation
- 1 - Indicates that mode register write operation is in progress
Programming mode: Dynamic</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_DERATEEN</name>
            <displayName>DDRCTRL_DERATEEN</displayName>
            <description>DDRCTRL temperature derate enable register	</description>
            <addressOffset>0x20</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DERATE_ENABLE</name>
                <description>Enables derating
- 0 - Timing parameter derating is disabled
- 1 - Timing parameter derating is enabled using MR4 read value.
Present only in designs configured to support LPDDR2/LPDDR3/LPDDR4
This field must be set to '0' for non-LPDDR2/LPDDR3/LPDDR4 mode.
Programming mode: Dynamic</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DERATE_VALUE</name>
                <description>Derate value
- 0 - Derating uses +1.
- 1 - Derating uses +2.
Present only in designs configured to support LPDDR2/LPDDR3/LPDDR4
Set to 0 for all LPDDR2 speed grades as derating value of +1.875 ns is less than a core_ddrc_core_clk period.
For LPDDR3/4, if the period of core_ddrc_core_clk is less than 1.875ns, this register field should be set to 1; otherwise it should be set to 0.
Programming mode: Quasi-dynamic Group 2 and Group 4</description>
                <bitOffset>1</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DERATE_BYTE</name>
                <description>Derate byte
Present only in designs configured to support LPDDR2/LPDDR3/LPDDR4
Indicates which byte of the MRR data is used for derating. The maximum valid value depends
on MEMC_DRAM_TOTAL_DATA_WIDTH.
Programming mode: Static</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_DERATEINT</name>
            <displayName>DDRCTRL_DERATEINT</displayName>
            <description>DDRCTRL temperature derate interval register	</description>
            <addressOffset>0x24</addressOffset>
            <size>0x20</size>
            <resetValue>0x00800000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MR4_READ_INTERVAL</name>
                <description>Interval between two MR4 reads, used to derate the timing parameters.
Present only in designs configured to support LPDDR2/LPDDR3/LPDDR4. This register must not be set to zero.
Unit: DFI clock cycle.
Programming mode: Static</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_PWRCTL</name>
            <displayName>DDRCTRL_PWRCTL</displayName>
            <description>DDRCTRL low power control register </description>
            <addressOffset>0x30</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SELFREF_EN</name>
                <description>If true then the DDRCTRL puts the SDRAM into Self Refresh after a programmable number of cycles 'maximum idle clocks before Self Refresh (PWRTMG.selfref_to_x32)'. This register bit may be re-programmed during the course of normal operation.
Programming mode: Dynamic</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>POWERDOWN_EN</name>
                <description>If true then the DDRCTRL goes into power-down after a programmable number of cycles 'maximum idle clocks before power down' (PWRTMG.powerdown_to_x32).
This register bit may be re-programmed during the course of normal operation.
Programming mode: Dynamic</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DEEPPOWERDOWN_EN</name>
                <description>When this is 1, DDRCTRL puts the SDRAM into deep power-down mode when the transaction store is empty.
This register must be reset to '0' to bring DDRCTRL out of deep power-down mode. Controller performs automatic SDRAM initialization on deep power-down exit.
Present only in designs configured to support mDDR or LPDDR2 or LPDDR3. For non-mDDR/non-LPDDR2/non-LPDDR3, this register should not be set to 1.
For performance only
Programming mode: Dynamic</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EN_DFI_DRAM_CLK_DISABLE</name>
                <description>Enable the assertion of dfi_dram_clk_disable whenever a clock is not required by the SDRAM.
If set to 0, dfi_dram_clk_disable is never asserted.
Assertion of dfi_dram_clk_disable is as follows:
In DDR2/DDR3, can only be asserted in Self Refresh.
In DDR4, can be asserted in following:
- in Self Refresh.
- in Maximum Power Saving Mode
In mDDR/LPDDR2/LPDDR3, can be asserted in following:
- in Self Refresh
- in Power Down
- in Deep Power Down
- during Normal operation (Clock Stop)
In LPDDR4, can be asserted in following:
- in Self Refresh Power Down
- in Power Down
- during Normal operation (Clock Stop)
Programming mode: Dynamic</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SELFREF_SW</name>
                <description>A value of 1 to this register causes system to move to Self Refresh state immediately, as long as it is not in INIT or DPD/MPSM operating_mode. This is referred to as Software Entry/Exit to Self Refresh.
- 1 - Software Entry to Self Refresh
- 0 - Software Exit from Self Refresh
Programming mode: Dynamic</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DIS_CAM_DRAIN_SELFREF</name>
                <description>Indicates whether skipping CAM draining is allowed when entering Self-Refresh.
This register field cannot be modified while PWRCTL.selfref_sw==1.
- 0 - CAMs must be empty before entering SR
- 1 - CAMs are not emptied before entering SR (unsupported)
Note, PWRCTL.dis_cam_drain_selfref=1 is unsupported in this release. PWRCTL.dis_cam_drain_selfref=0 is required.
Programming mode: Dynamic</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_PWRTMG</name>
            <displayName>DDRCTRL_PWRTMG</displayName>
            <description>DDRCTRL low power timing register </description>
            <addressOffset>0x34</addressOffset>
            <size>0x20</size>
            <resetValue>0x00402010</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>POWERDOWN_TO_X32</name>
                <description>After this many clocks of the DDRC command channel being idle the DDRCTRL automatically puts the SDRAM into power-down. The DDRC command channel is considered idle when there are no HIF commands outstanding. This must be enabled in the PWRCTL.powerdown_en.
Unit: Multiples of 32 DFI clocks
For performance only.
Programming mode: Quasi-dynamic Group 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>T_DPD_X4096</name>
                <description>Minimum deep power-down time.
For mDDR, value from the JEDEC specification is 0 as mDDR exits from deep power-down mode immediately after PWRCTL.deeppowerdown_en is de-asserted.
For LPDDR2/LPDDR3, value from the JEDEC specification is 500 us.
Unit: Multiples of 4096 DFI clocks.
Present only in designs configured to support mDDR, LPDDR2 or LPDDR3.
For performance only.
Programming mode: Quasi-dynamic Group 4</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SELFREF_TO_X32</name>
                <description>After this many clocks of the DDRC command channel being idle the DDRCTRL automatically puts the SDRAM into Self Refresh. The DDRC command channel is considered idle when there are no HIF commands outstanding. This must be enabled in the PWRCTL.selfref_en.
Unit: Multiples of 32 DFI clocks.
For performance only.
Programming mode: Quasi-dynamic Group 4</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
