STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>DDRCTRL_HWLPCTL</name>
            <displayName>DDRCTRL_HWLPCTL</displayName>
            <description>DDRCTRL hardware low power control register 	</description>
            <addressOffset>0x38</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000003</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HW_LP_EN</name>
                <description>Enable for hardware low power interface.
Programming mode: Quasi-dynamic Group 3</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HW_LP_EXIT_IDLE_EN</name>
                <description>When this bit is programmed to 1 the cactive_in_ddrc pin of the DDRC can be used to exit from the automatic clock stop, automatic power down or automatic self-refresh modes. Note, it does not cause exit of Self-Refresh that is caused by Hardware Low power interface and/or software (PWRCTL.selfref_sw).
Programming mode: Static</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HW_LP_IDLE_X32</name>
                <description>Hardware idle period. The cactive_ddrc output is driven low if the DDRC command channel is idle for hw_lp_idle * 32 cycles if not in INIT or DPD/MPSM operating_mode. The DDRC command channel is considered idle when there are no HIF commands outstanding. The hardware idle function is disabled when hw_lp_idle_x32=0.
Unit: Multiples of 32 DFI clocks.
For performance only.
Programming mode: Static</description>
                <bitOffset>16</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_RFSHCTL0</name>
            <displayName>DDRCTRL_RFSHCTL0</displayName>
            <description>DDRCTRL refresh control register 0 </description>
            <addressOffset>0x50</addressOffset>
            <size>0x20</size>
            <resetValue>0x00210000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PER_BANK_REFRESH</name>
                <description>- 1 - Per bank refresh;
- 0 - All bank refresh.
Per bank refresh allows traffic to flow to other banks. Per bank refresh is not supported by all LPDDR2 devices but should be supported by all LPDDR3/LPDDR4 devices. Present only in designs configured to support LPDDR2/LPDDR3/LPDDR4
Programming mode: Static</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>REFRESH_BURST</name>
                <description>The programmed value + 1 is the number of refresh timeouts that is allowed to accumulate before traffic is blocked and the refreshes are forced to execute. Closing pages to perform a refresh is a one-time penalty that must be paid for each group of refreshes. Therefore, performing refreshes in a burst reduces the per-refresh penalty of these page closings. Higher numbers for RFSHCTL.refresh_burst slightly increases utilization; lower numbers decreases the worst-case latency associated with refreshes.
- 0 - single refresh
- 1 - burst-of-2 refresh
- 7 - burst-of-8 refresh
For information on burst refresh feature refer to section 3.9 of DDR2 JEDEC specification - JESD79-2F.pdf.
For DDR2/3, the refresh is always per-rank and not per-bank. The rank refresh can be accumulated over 8*tREFI cycles using the burst refresh feature.
In DDR4 mode, according to Fine Granularity feature, 8 refreshes can be postponed in 1X mode, 16 refreshes in 2X mode and 32 refreshes in 4X mode. If using PHY-initiated updates, care must be taken in the setting of RFSHCTL0.refresh_burst, to ensure that tRFCmax is not violated due to a PHY-initiated update occurring shortly before a refresh burst was due. In this situation, the refresh burst is delayed until the PHY-initiated update is complete.
Programming mode: dynamic - refresh related</description>
                <bitOffset>4</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>REFRESH_TO_X32</name>
                <description>If the refresh timer (tRFCnom, also known as tREFI) has expired at least once, but it has not expired (RFSHCTL0.refresh_burst+1) times yet, then a speculative refresh may be performed. A speculative refresh is a refresh performed at a time when refresh would be useful, but before it is absolutely required. When the SDRAM bus is idle for a period of time determined by this RFSHCTL0.refresh_to_x32 and the refresh timer has expired at least once since the last refresh, then a speculative refresh is performed. Speculative refreshes continues successively until there are no refreshes pending or until new reads or writes are issued to the DDRCTRL.
For performance only.
Unit: Multiples of 32 DFI clocks.
Programming mode: Dynamic - Refresh Related</description>
                <bitOffset>12</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>REFRESH_MARGIN</name>
                <description>Threshold value in number of DFI clock cycles before the critical refresh or page timer expires. A critical refresh is to be issued before this threshold is reached. It is recommended that this not be changed from the default value, currently shown as 0x2. It must always be less than internally used t_rfc_nom/32. Note that internally used t_rfc_nom is equal to RFSHTMG.t_rfc_nom_x1_x32 * 32 if RFSHTMG.t_rfc_nom_x1_sel=0. If RFSHTMG.t_rfc_nom_x1_sel=1 (for LPDDR2/LPDDR3/LPDDR4 per-bank refresh only), internally used t_rfc_nom is equal to RFSHTMG.t_rfc_nom_x1_x32. Note that, in LPDDR2/LPDDR3/LPDDR4, internally used t_rfc_nom may be divided by four if derating is enabled (DERATEEN.derate_enable=1).
Unit: Multiples of 32 DFI clocks.
Programming mode: Dynamic - Refresh Related</description>
                <bitOffset>20</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_RFSHCTL3</name>
            <displayName>DDRCTRL_RFSHCTL3</displayName>
            <description>DDRCTRL refresh control register 3 </description>
            <addressOffset>0x60</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DIS_AUTO_REFRESH</name>
                <description>When '1', disable auto-refresh generated by the DDRCTRL. When auto-refresh is disabled, the SoC core must generate refreshes using the registers DBGCMD.rankn_refresh.
When dis_auto_refresh transitions from 0 to 1, any pending refreshes are immediately scheduled by the DDRCTRL.
If DDR4 CRC/parity retry is enabled (CRCPARCTL1.crc_parity_retry_enable = 1), disable auto-refresh is not supported, and this bit must be set to '0'.
(DDR4 only) If FGR mode is enabled (RFSHCTL3.refresh_mode &gt; 0), disable auto-refresh is not supported, and this bit must be set to '0'.
This register field is changeable on the fly.
Programming mode: Dynamic - Refresh Related</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>REFRESH_UPDATE_LEVEL</name>
                <description>Toggles this signal (either from 0 to 1 or from 1 to 0) to indicate that the refresh register(s) have been updated.
refresh_update_level must not be toggled when the DDRC is in reset (core_ddrc_rstn = 0).
The refresh register(s) are automatically updated when exiting reset.
Programming mode: Dynamic</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_RFSHTMG</name>
            <displayName>DDRCTRL_RFSHTMG</displayName>
            <description>DDRCTRL refresh timing register </description>
            <addressOffset>0x64</addressOffset>
            <size>0x20</size>
            <resetValue>0x0062008C</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>T_RFC_MIN</name>
                <description>tRFC (min): Minimum time from refresh to refresh or activate.
When the controller is operating in 1:1 mode, t_rfc_min should be set to RoundUp(tRFCmin/tCK).
When the controller is operating in 1:2 mode, t_rfc_min should be set to RoundUp(RoundUp(tRFCmin/tCK)/2).
In LPDDR2/LPDDR3/LPDDR4 mode:
- If using all-bank refreshes, the tRFCmin value in the above equations is equal to tRFCab
- If using per-bank refreshes, the tRFCmin value in the above equations is equal to tRFCpb
In DDR4 mode, the tRFCmin value in the above equations is different depending on the refresh mode (fixed 1X,2X,4X) and the device density. The user should program the appropriate value from the spec based on the 'refresh_mode' and the device density that is used.
Unit: Clocks.
Programming mode: Dynamic - Refresh Related</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LPDDR3_TREFBW_EN</name>
                <description>Used only when LPDDR3 memory type is connected. Should only be changed when DDRCTRL is in reset. Specifies whether to use the tREFBW parameter (required by some LPDDR3 devices which comply with earlier versions of the LPDDR3 JEDEC specification) or not:
- 0 - tREFBW parameter not used
- 1 - tREFBW parameter used
Programming mode: Static</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>T_RFC_NOM_X1_X32</name>
                <description>tREFI: Average time interval between refreshes per rank (Specification: 7.8us for DDR2, DDR3 and DDR4. See JEDEC specification for mDDR, LPDDR2, LPDDR3 and LPDDR4).
For LPDDR2/LPDDR3/LPDDR4:
- If using all-bank refreshes (RFSHCTL0.per_bank_refresh = 0), this register should be set to tREFIab
- If using per-bank refreshes (RFSHCTL0.per_bank_refresh = 1), this register should be set to tREFIpb
When the controller is operating in 1:2 frequency ratio mode, program this to (tREFI/2), no rounding up.
In DDR4 mode, tREFI value is different depending on the refresh mode. The user should program the appropriate value from the spec based on the value programmed in the refresh mode register.
Note that if RFSHTMG.t_rfc_nom_x1_sel == 1, RFSHTMG.t_rfc_nom_x1_x32 must be greater than RFSHTMG.t_rfc_min; if RFSHTMG.t_rfc_nom_x1_sel == 0, RFSHTMG.t_rfc_nom_x1_x32 * 32 must be greater than RFSHTMG.t_rfc_min; RFSHTMG.t_rfc_nom_x1_x32 must be greater than 0x1.
- Non-DDR4 or DDR4 Fixed 1x mode: RFSHTMG.t_rfc_nom_x1_x32 must be less than or equal to 0xFFE.
- DDR4 Fixed 2x mode: RFSHTMG.t_rfc_nom_x1_x32 must be less than or equal to 0x7FF.
- DDR4 Fixed 4x mode: RFSHTMG.t_rfc_nom_x1_x32 must be less than or equal to 0x3FF.
Unit: Clocks or multiples of 32 clocks, depending on RFSHTMG.t_rfc_nom_x1_sel.
Programming mode: Dynamic - Refresh Related</description>
                <bitOffset>16</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>T_RFC_NOM_X1_SEL</name>
                <description>Specifies whether the t_rfc_nom_x1_x32 register value is x1 or x32.
Programming mode: Dynamic - Refresh Related</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_CRCPARCTL0</name>
            <displayName>DDRCTRL_CRCPARCTL0</displayName>
            <description>DDRCTRL CRC parity control register 0 </description>
            <addressOffset>0xc0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DFI_ALERT_ERR_INT_EN</name>
                <description>Interrupt enable bit for DFI alert error. If this bit is set, any parity/CRC error detected on the dfi_alert_n input results in an interrupt being set on CRCPARSTAT.dfi_alert_err_int.
Programming mode: Dynamic</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DFI_ALERT_ERR_INT_CLR</name>
                <description>Interrupt clear bit for DFI alert error. If this bit is set, the alert error interrupt on CRCPARSTAT.dfi_alert_err_int is cleared. When the clear operation is complete, the DDRCTRL automatically clears this bit.
Programming mode: Dynamic</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DFI_ALERT_ERR_CNT_CLR</name>
                <description>DFI alert error count clear. Clear bit for DFI alert error counter. Asserting this bit, clears the DFI alert error counter, CRCPARSTAT.dfi_alert_err_cnt. When the clear operation is complete, the DDRCTRL automatically clears this bit.
Programming mode: Dynamic</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_CRCPARSTAT</name>
            <displayName>DDRCTRL_CRCPARSTAT</displayName>
            <description>DDRCTRL CRC parity status register </description>
            <addressOffset>0xcc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DFI_ALERT_ERR_CNT</name>
                <description>DFI alert error count.
If a parity/CRC error is detected on dfi_alert_n, this counter be incremented. This is independent of the setting of CRCPARCTL0.dfi_alert_err_int_en.  It saturates at 0xFFFF, and can be cleared by asserting CRCPARCTL0.dfi_alert_err_cnt_clr.
Programming mode: Static</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DFI_ALERT_ERR_INT</name>
                <description>DFI alert error interrupt.
If a parity/CRC error is detected on dfi_alert_n, and the interrupt is enabled by CRCPARCTL0.dfi_alert_err_int_en, this interrupt bit is set.  It remains set until cleared by CRCPARCTL0.dfi_alert_err_int_clr
Programming mode: Static</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_INIT0</name>
            <displayName>DDRCTRL_INIT0</displayName>
            <description>DDRCTRL SDRAM initialization register 0 </description>
            <addressOffset>0xd0</addressOffset>
            <size>0x20</size>
            <resetValue>0x0002004E</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRE_CKE_X1024</name>
                <description>Cycles to wait after reset before driving CKE high to start the SDRAM initialization sequence.
Unit: 1024 DFI clock cycles.
DDR2 specifications typically require this to be programmed for a delay of &gt;= 200 us.
LPDDR2/LPDDR3: tINIT1 of 100 ns (min)
LPDDR4: tINIT3 of 2 ms (min)
When the controller is operating in 1:2 frequency ratio mode, program this to JEDEC spec value divided by 2, and round it up to the next integer value.
For DDR3/DDR4 RDIMMs, this should include the time needed to satisfy tSTAB
Programming mode: Static</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>POST_CKE_X1024</name>
                <description>Cycles to wait after driving CKE high to start the SDRAM initialization sequence.
Unit: 1024 DFI clock cycles.
DDR2 typically requires a 400 ns delay, requiring this value to be programmed to 2 at all clock speeds.
LPDDR2/LPDDR3 typically requires this to be programmed for a delay of 200 us.
LPDDR4 typically requires this to be programmed for a delay of 2 us.
When the controller is operating in 1:2 frequency ratio mode, program this to JEDEC spec value divided by 2, and round it up to the next integer value.
Programming mode: Static</description>
                <bitOffset>16</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SKIP_DRAM_INIT</name>
                <description>If lower bit is enabled the SDRAM initialization routine is skipped. The upper bit decides what state the controller starts up in when reset is removed
- 00 - SDRAM Initialization routine is run after power-up
- 01 - SDRAM Initialization routine is skipped after power-up. Controller starts up in Normal Mode
- 11 - SDRAM Initialization routine is skipped after power-up. Controller starts up in Self-refresh Mode
- 10 - Reserved.
Programming mode: Quasi-dynamic Group 2</description>
                <bitOffset>30</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_INIT1</name>
            <displayName>DDRCTRL_INIT1</displayName>
            <description>DDRCTRL SDRAM initialization register 1 </description>
            <addressOffset>0xd4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRE_OCD_X32</name>
                <description>Wait period before driving the OCD complete command to SDRAM.
Unit: Counts of a global timer that pulses every 32 DFI clock cycles.
There is no known specific requirement for this; it may be set to zero.
Programming mode: Static</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DRAM_RSTN_X1024</name>
                <description>Number of cycles to assert SDRAM reset signal during init sequence.
This is only present for designs supporting DDR3, DDR4 or LPDDR4 devices. For use with a DDR PHY, this should be set to a minimum of 1.
When the controller is operating in 1:2 frequency ratio mode, program this to JEDEC spec value divided by 2, and round it up to the next integer value.
Unit: 1024 DFI clock cycles.
Programming mode: Static</description>
                <bitOffset>16</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_INIT2</name>
            <displayName>DDRCTRL_INIT2</displayName>
            <description>DDRCTRL SDRAM initialization register 2 </description>
            <addressOffset>0xd8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000D05</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MIN_STABLE_CLOCK_X1</name>
                <description>Time to wait after the first CKE high, tINIT2. Present only in designs configured to support LPDDR2/LPDDR3.
LPDDR2/LPDDR3 typically requires 5 x tCK delay.
When the controller is operating in 1:2 frequency ratio mode, program this to JEDEC spec value divided by 2, and round it up to the next integer value.
Unit: DFI clock cycles.
Programming mode: Static</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IDLE_AFTER_RESET_X32</name>
                <description>Idle time after the reset command, tINIT4. Present only in designs configured to support LPDDR2.
When the controller is operating in 1:2 frequency ratio mode, program this to JEDEC spec value divided by 2, and round it up to the next integer value.
Unit: 32 DFI clock cycles.
Programming mode: Static</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_INIT3</name>
            <displayName>DDRCTRL_INIT3</displayName>
            <description>DDRCTRL SDRAM initialization register 3 </description>
            <addressOffset>0xdc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000510</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EMR</name>
                <description>DDR2: Value to write to EMR register. Bits 9:7 are for OCD and the setting in this register is ignored. The DDRCTRL sets those bits appropriately.
DDR3/DDR4: Value to write to MR1 register  Set bit 7 to 0.  If PHY-evaluation mode training is enabled, this bit is set appropriately by the DDRCTRL during write leveling.
mDDR: Value to write to EMR register.
LPDDR2/LPDDR3/LPDDR4 - Value to write to MR2 register
Programming mode: Quasi-dynamic Group 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MR</name>
                <description>DDR2: Value to write to MR register. Bit 8 is for DLL and the setting here is ignored. The DDRCTRL sets this bit appropriately.
DDR3/DDR4: Value loaded into MR0 register.
mDDR: Value to write to MR register.
LPDDR2/LPDDR3/LPDDR4 - Value to write to MR1 register
Programming mode: Quasi-dynamic Group 1 and Group 4</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
