STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>DDRCTRL_DRAMTMG5</name>
            <displayName>DDRCTRL_DRAMTMG5</displayName>
            <description>DDRCTRL SDRAM timing register 5 </description>
            <addressOffset>0x114</addressOffset>
            <size>0x20</size>
            <resetValue>0x05050403</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>T_CKE</name>
                <description>Minimum number of cycles of CKE HIGH/LOW during power-down and self refresh.
- LPDDR2/LPDDR3 mode: Set this to the larger of tCKE or tCKESR
- LPDDR4 mode: Set this to the larger of tCKE or tSR.
- Non-LPDDR2/non-LPDDR3/non-LPDDR4 designs: Set this to tCKE value.
When the controller is operating in 1:2 frequency ratio mode, program this to (value described above)/2 and round it up to the next integer value.
Unit: Clocks.
Programming mode: Quasi-dynamic Group 2 and Group 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>T_CKESR</name>
                <description>Minimum CKE low width for Self refresh or Self refresh power down entry to exit timing in memory clock cycles.
Recommended settings:
- mDDR: tRFC
- LPDDR2: tCKESR
- LPDDR3: tCKESR
- LPDDR4: max(tCKE, tSR)
- DDR2: tCKE
- DDR3: tCKE + 1
- DDR4: tCKE + 1 (+ PL(parity latency)(*))
(*)Only if CRCPARCTL1.caparity_disable_before_sr=0, this register should be increased by PL.
When the controller is operating in 1:2 frequency ratio mode, program this to recommended value divided by two and round it up to next integer.
Programming mode: Quasi-dynamic Group 2 and Group 4</description>
                <bitOffset>8</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>T_CKSRE</name>
                <description>This is the time after Self Refresh Down Entry that CK is maintained as a valid clock. Specifies the clock disable delay after SRE.
Recommended settings:
- mDDR: 0
- LPDDR2: 2
- LPDDR3: 2
- LPDDR4: tCKELCK
- DDR2: 1
- DDR3: max (10 ns, 5 tCK)
- DDR4: max (10 ns, 5 tCK) (+ PL(parity latency)(*))
(*)Only if CRCPARCTL1.caparity_disable_before_sr=0, this register should be increased by PL.
When the controller is operating in 1:2 frequency ratio mode, program this to recommended value divided by two and round it up to next integer.
Programming mode: Quasi-dynamic Group 2 and Group 4</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>T_CKSRX</name>
                <description>This is the time before Self Refresh Exit that CK is maintained as a valid clock before issuing SRX. Specifies the clock stable time before SRX.
Recommended settings:
- mDDR: 1
- LPDDR2: 2
- LPDDR3: 2
- LPDDR4: tCKCKEH
- DDR2: 1
- DDR3: tCKSRX
- DDR4: tCKSRX
When the controller is operating in 1:2 frequency ratio mode, program this to recommended value divided by two and round it up to next integer.
Programming mode: Quasi-dynamic Group 2 and Group 4</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_DRAMTMG6</name>
            <displayName>DDRCTRL_DRAMTMG6</displayName>
            <description>DDRCTRL SDRAM timing register 6 </description>
            <addressOffset>0x118</addressOffset>
            <size>0x20</size>
            <resetValue>0x02020005</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>T_CKCSX</name>
                <description>This is the time before Clock Stop Exit that CK is maintained as a valid clock before issuing Clock Stop Exit. Specifies the clock stable time before next command after Clock Stop Exit.
Recommended settings:
- mDDR: 1
- LPDDR2: tXP + 2
- LPDDR3: tXP + 2
- LPDDR4: tXP + 2
When the controller is operating in 1:2 frequency ratio mode, program this to recommended value divided by two and round it up to next integer.
This is only present for designs supporting mDDR or LPDDR2/LPDDR3/LPDDR4 devices.
Programming mode: Quasi-dynamic Group 2 and Group 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>T_CKDPDX</name>
                <description>This is the time before Deep Power Down Exit that CK is maintained as a valid clock before issuing DPDX. Specifies the clock stable time before DPDX.
Recommended settings:
- mDDR: 1
- LPDDR2: 2
- LPDDR3: 2
When the controller is operating in 1:2 frequency ratio mode, program this to recommended value divided by two and round it up to next integer.
This is only present for designs supporting mDDR or LPDDR2 devices.
Programming mode: Quasi-dynamic Group 2 and Group 4</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>T_CKDPDE</name>
                <description>This is the time after Deep Power Down Entry that CK is maintained as a valid clock. Specifies the clock disable delay after DPDE.
Recommended settings:
- mDDR: 0
- LPDDR2: 2
- LPDDR3: 2
When the controller is operating in 1:2 frequency ratio mode, program this to recommended value divided by two and round it up to next integer.
This is only present for designs supporting mDDR or LPDDR2/LPDDR3 devices.
Programming mode: Quasi-dynamic Group 2 and Group 4</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_DRAMTMG7</name>
            <displayName>DDRCTRL_DRAMTMG7</displayName>
            <description>DDRCTRL SDRAM timing register 7 </description>
            <addressOffset>0x11c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000202</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>T_CKPDX</name>
                <description>This is the time before Power Down Exit that CK is maintained as a valid clock before issuing PDX. Specifies the clock stable time before PDX.
Recommended settings:
- mDDR: 0
- LPDDR2: 2
- LPDDR3: 2
- LPDDR4: 2
When using DDR2/3/4 SDRAM, this register should be set to the same value as DRAMTMG5.t_cksrx.
When the controller is operating in 1:2 frequency ratio mode, program this to recommended value divided by two and round it up to next integer.
This is only present for designs supporting mDDR or LPDDR2/LPDDR3/LPDDR4 devices.
Programming mode: Quasi-dynamic Group 2 and Group 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>T_CKPDE</name>
                <description>This is the time after Power Down Entry that CK is maintained as a valid clock. Specifies the clock disable delay after PDE.
Recommended settings:
- mDDR: 0
- LPDDR2: 2
- LPDDR3: 2
- LPDDR4: tCKELCK
When using DDR2/3/4 SDRAM, this register should be set to the same value as DRAMTMG5.t_cksre.
When the controller is operating in 1:2 frequency ratio mode, program this to recommended value divided by two and round it up to next integer.
This is only present for designs supporting mDDR or LPDDR2/LPDDR3/LPDDR4 devices.
Programming mode: Quasi-dynamic Group 2 and Group 4</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_DRAMTMG8</name>
            <displayName>DDRCTRL_DRAMTMG8</displayName>
            <description>DDRCTRL SDRAM timing register 8 </description>
            <addressOffset>0x120</addressOffset>
            <size>0x20</size>
            <resetValue>0x00004405</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>T_XS_X32</name>
                <description>tXS: Exit Self Refresh to commands not requiring a locked DLL.
When the controller is operating in 1:2 frequency ratio mode, program this to the above value divided by 2 and round up to next integer value.
Unit: Multiples of 32 clocks.
Note: Used only for DDR2, DDR3 and DDR4 SDRAMs.
Programming mode: Quasi-dynamic Group 2 and Group 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>T_XS_DLL_X32</name>
                <description>tXSDLL: Exit Self Refresh to the commands requiring a locked DLL.
When the controller is operating in 1:2 frequency ratio mode, program this to the above value divided by 2 and round up to next integer value.
Unit: Multiples of 32 clocks.
Note: Used only for DDR2, DDR3 and DDR4 SDRAMs.
Programming mode: Quasi-dynamic Group 2 and Group 4</description>
                <bitOffset>8</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_DRAMTMG14</name>
            <displayName>DDRCTRL_DRAMTMG14</displayName>
            <description>DDRCTRL SDRAM timing register 14 </description>
            <addressOffset>0x138</addressOffset>
            <size>0x20</size>
            <resetValue>0x000000A0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>T_XSR</name>
                <description>tXSR: Exit Self Refresh to any command.
When the controller is operating in 1:2 frequency ratio mode, program this to the above value divided by 2 and round up to next integer value.
Note: Used only for mDDR/LPDDR2/LPDDR3/LPDDR4 mode.
Programming mode: Quasi-dynamic Group 2 and Group 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_DRAMTMG15</name>
            <displayName>DDRCTRL_DRAMTMG15</displayName>
            <description>DDRCTRL SDRAM timing register 15 </description>
            <addressOffset>0x13c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>T_STAB_X32</name>
                <description>tSTAB: Stabilization time.
It is required in the following two cases for DDR3/DDR4 RDIMM:
- When exiting power saving mode, if the clock was stopped, after re-enabling it the clock must be stable for a time specified by tSTAB
- In the case of input clock frequency change (DDR4)
- After issuing control words that refers to clock timing (Specification: 6us for DDR3, 5us for DDR4).
When the controller is operating in 1:2 frequency ratio mode, program this to recommended value divided by two and round it up to next integer.
Unit: Multiples of 32 clock cycles.
Programming mode: Quasi-dynamic Group 2 and Group 4.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EN_DFI_LP_T_STAB</name>
                <description>- 1 - Enable using tSTAB when exiting DFI LP. Needs to be set when the PHY is stopping the clock during DFI LP to save maximum power.
- 0 - Disable using tSTAB when exiting DFI LP
Programming mode: Quasi-dynamic Group 2 and Group 4.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_ZQCTL0</name>
            <displayName>DDRCTRL_ZQCTL0</displayName>
            <description>DDRCTRL ZQ control register 0 </description>
            <addressOffset>0x180</addressOffset>
            <size>0x20</size>
            <resetValue>0x02000040</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>T_ZQ_SHORT_NOP</name>
                <description>tZQCS for DDR3/DD4/LPDDR2/LPDDR3, tZQLAT for LPDDR4: Number of DFI clock cycles of NOP required after a ZQCS (ZQ calibration short)/MPC(ZQ Latch) command is issued to SDRAM.
When the controller is operating in 1:2 frequency ratio mode, program this to tZQCS/2 and round it up to the next integer value.
This is only present for designs supporting DDR3/DDR4 or LPDDR2/LPDDR3/LPDDR4 devices.
Programming mode: Static.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>T_ZQ_LONG_NOP</name>
                <description>tZQoper for DDR3/DDR4, tZQCL for LPDDR2/LPDDR3, tZQCAL for LPDDR4: Number of DFI clock cycles of NOP required after a ZQCL (ZQ calibration long)/MPC(ZQ Start) command is issued to SDRAM.
When the controller is operating in 1:2 frequency ratio mode:
DDR3/DDR4: program this to tZQoper/2 and round it up to the next integer value.
LPDDR2/LPDDR3: program this to tZQCL/2 and round it up to the next integer value.
LPDDR4: program this to tZQCAL/2 and round it up to the next integer value.
This is only present for designs supporting DDR3/DDR4 or LPDDR2/LPDDR3/LPDDR4 devices.
Programming mode: Static.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>11</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ZQ_RESISTOR_SHARED</name>
                <description>- 1 - Denotes that ZQ resistor is shared between ranks. Means ZQinit/ZQCL/ZQCS/MPC(ZQ calibration) commands are sent to one rank at a time with tZQinit/tZQCL/tZQCS/tZQCAL/tZQLAT timing met between commands so that commands to different ranks do not overlap.
- 0 - ZQ resistor is not shared.
This is only present for designs supporting DDR3/DDR4 or LPDDR2/LPDDR3/LPDDR4 devices.
Programming mode: Static.</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DIS_SRX_ZQCL</name>
                <description>- 1 - Disable issuing of ZQCL/MPC(ZQ calibration) command at Self-Refresh/SR-Powerdown exit. Only applicable when run in DDR3 or DDR4 or LPDDR2 or LPDDR3 or LPDDR4 mode.
- 0 - Enable issuing of ZQCL/MPC(ZQ calibration) command at Self-Refresh/SR-Powerdown exit. Only applicable when run in DDR3 or DDR4 or LPDDR2 or LPDDR3 or LPDDR4 mode.
This is only present for designs supporting DDR3/DDR4 or LPDDR2/LPDDR3/LPDDR4 devices.
Programming mode: Quasi-dynamic Group 2 and Group 4.</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DIS_AUTO_ZQ</name>
                <description>- 1 - Disable DDRCTRL generation of ZQCS/MPC(ZQ calibration) command.  Register DBGCMD.zq_calib_short can be used instead to issue ZQ calibration request from APB module.
- 0 - Internally generate ZQCS/MPC(ZQ calibration) commands based on ZQCTL1.t_zq_short_interval_x1024.
This is only present for designs supporting DDR3/DDR4 or LPDDR2/LPDDR3/LPDDR4 devices.
Programming mode: Dynamic</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_ZQCTL1</name>
            <displayName>DDRCTRL_ZQCTL1</displayName>
            <description>DDRCTRL ZQ control register 1 </description>
            <addressOffset>0x184</addressOffset>
            <size>0x20</size>
            <resetValue>0x02000100</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>T_ZQ_SHORT_INTERVAL_X1024</name>
                <description>Average interval to wait between automatically issuing ZQCS (ZQ calibration short)/MPC(ZQ calibration) commands to DDR3/DDR4/LPDDR2/LPDDR3/LPDDR4 devices.
Meaningless, if ZQCTL0.dis_auto_zq=1.
Unit: 1024 DFI clock cycles.
This is only present for designs supporting DDR3/DDR4 or LPDDR2/LPDDR3/LPDDR4 devices.
Programming mode: Static.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>T_ZQ_RESET_NOP</name>
                <description>tZQReset: Number of DFI clock cycles of NOP required after a ZQReset (ZQ calibration Reset) command is issued to SDRAM.
When the controller is operating in 1:2 frequency ratio mode, program this to tZQReset/2 and round it up to the next integer value.
This is only present for designs supporting LPDDR2/LPDDR3/LPDDR4 devices.
Programming mode: Static.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_ZQCTL2</name>
            <displayName>DDRCTRL_ZQCTL2</displayName>
            <description>DDRCTRL ZQ control register 2 </description>
            <addressOffset>0x188</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ZQ_RESET</name>
                <description>Setting this register bit to 1 triggers a ZQ Reset operation. When the ZQ Reset operation is complete, the DDRCTRL automatically clears this bit. It is recommended NOT to set this register bit if in Init, in Self-Refresh(except LPDDR4) or SR-Powerdown(LPDDR4) or Deep power-down operating modes.
For Self-Refresh(except LPDDR4) or SR-Powerdown(LPDDR4) it is scheduled after SR(except LPDDR4) or SPRD(LPDDR4) has been exited.
For Deep power down, it is not scheduled, although ZQSTAT.zq_reset_busy is de-asserted.
This is only present for designs supporting LPDDR2/LPDDR3/LPDDR4 devices.
Programming mode: Dynamic</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_ZQSTAT</name>
            <displayName>DDRCTRL_ZQSTAT</displayName>
            <description>DDRCTRL ZQ status register </description>
            <addressOffset>0x18c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ZQ_RESET_BUSY</name>
                <description>SoC core may initiate a ZQ Reset operation only if this signal is low. This signal goes high in the clock after the DDRCTRL accepts the ZQ Reset request. It goes low when the ZQ Reset command is issued to the SDRAM and the associated NOP period is over. It is recommended not to perform ZQ Reset commands when this signal is high.
- 0 - Indicates that the SoC core can initiate a ZQ Reset operation
- 1 - Indicates that ZQ Reset operation is in progress
Programming mode: Dynamic</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
