STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>DDRCTRL_DFITMG0</name>
            <displayName>DDRCTRL_DFITMG0</displayName>
            <description>DDRCTRL DFI timing register 0 </description>
            <addressOffset>0x190</addressOffset>
            <size>0x20</size>
            <resetValue>0x07020002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DFI_TPHY_WRLAT</name>
                <description>Write latency
Number of clocks from the write command to write data enable (dfi_wrdata_en).  This corresponds to the DFI timing parameter tphy_wrlat.
Refer to PHY specification for correct value.Note that, depending on the PHY, if using RDIMM/LRDIMM, it may be necessary to use the adjusted value of CL in the calculation of tphy_wrlat. This is to compensate for the extra cycle(s) of latency through the RDIMM/LRDIMM.
For LPDDR4, dfi_tphy_wrlat&gt;60 is not supported.
Unit: DFI clock cycles or DFI PHY clock cycles, depending on DFITMG0.dfi_wrdata_use_dfi_phy_clk.
Programming mode: Quasi-dynamic Group 1 and Group 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DFI_TPHY_WRDATA</name>
                <description>Specifies the number of clock cycles between when dfi_wrdata_en is asserted to when the associated write data is driven on the dfi_wrdata signal.  This corresponds to the DFI timing parameter tphy_wrdata.  Refer to PHY specification for correct value. Note, max supported value is 8.
Unit: DFI clock cycles or DFI PHY clock cycles, depending on DFITMG0.dfi_wrdata_use_dfi_phy_clk.
Programming mode: Quasi-dynamic Group 4</description>
                <bitOffset>8</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DFI_T_RDDATA_EN</name>
                <description>Time from the assertion of a read command on the DFI interface to the assertion of the dfi_rddata_en signal.
Refer to PHY specification for correct value.
This corresponds to the DFI parameter trddata_en. Note that, depending on the PHY, if using RDIMM/LRDIMM, it may be necessary to use the adjusted value of CL in the calculation of trddata_en. This is to compensate for the extra cycle(s) of latency through the RDIMM/LRDIMM.
Unit: DFI clock cycles or DFI PHY clock cycles, depending on DFITMG0.dfi_rddata_use_dfi_phy_clk.
Programming mode: Quasi-dynamic Group 1 and Group 4</description>
                <bitOffset>16</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DFI_T_CTRL_DELAY</name>
                <description>Specifies the number of DFI clock cycles after an assertion or de-assertion of the DFI control signals that the control signals at the PHY-DRAM interface reflect the assertion or de-assertion. If the DFI clock and the memory clock are not phase-aligned, this timing parameter should be rounded up to the next integer value. Note that if using RDIMM/LRDIMM, it is necessary to increment this parameter by RDIMM's/LRDIMM's extra cycle of latency in terms of DFI clock.
Programming mode: Quasi-dynamic Group 4</description>
                <bitOffset>24</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_DFITMG1</name>
            <displayName>DDRCTRL_DFITMG1</displayName>
            <description>DDRCTRL DFI timing register 1 </description>
            <addressOffset>0x194</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000404</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DFI_T_DRAM_CLK_ENABLE</name>
                <description>Specifies the number of DFI clock cycles from the de-assertion of the dfi_dram_clk_disable signal on the DFI until the first valid rising edge of the clock to the DRAM memory devices, at the PHY-DRAM boundary. If the DFI clock and the memory clock are not phase aligned, this timing parameter should be rounded up to the next integer value.
Programming mode: Quasi-dynamic Group 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DFI_T_DRAM_CLK_DISABLE</name>
                <description>Specifies the number of DFI clock cycles from the assertion of the dfi_dram_clk_disable signal on the DFI until the clock to the DRAM memory devices, at the PHY-DRAM boundary, maintains a low value. If the DFI clock and the memory clock are not phase aligned, this timing parameter should be rounded up to the next integer value.
Programming mode: Quasi-dynamic Group 4</description>
                <bitOffset>8</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DFI_T_WRDATA_DELAY</name>
                <description>Specifies the number of DFI clock cycles between when the dfi_wrdata_en
signal is asserted and when the corresponding write data transfer is completed on the DRAM bus.
This corresponds to the DFI timing parameter twrdata_delay.  Refer to PHY specification for correct value.
For DFI 3.0 PHY, set to twrdata_delay, a new timing parameter introduced in DFI 3.0.
For DFI 2.1 PHY, set to tphy_wrdata + (delay of DFI write data to the DRAM).
Value to be programmed is in terms of DFI clocks, not PHY clocks.
In FREQ_RATIO=2, divide PHY's value by 2 and round up to next integer.
If using DFITMG0.dfi_wrdata_use_dfi_phy_clk=1, add 1 to the value.
Unit: Clocks
Programming mode: Quasi-dynamic Group 4</description>
                <bitOffset>16</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_DFILPCFG0</name>
            <displayName>DDRCTRL_DFILPCFG0</displayName>
            <description>DDRCTRL low power configuration register 0 	</description>
            <addressOffset>0x198</addressOffset>
            <size>0x20</size>
            <resetValue>0x07000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DFI_LP_EN_PD</name>
                <description>Enables DFI Low Power interface handshaking during Power Down Entry/Exit.
- 0 - Disabled
- 1 - Enabled
Programming mode: Static</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DFI_LP_WAKEUP_PD</name>
                <description>Value in DFI clock cycles to drive on dfi_lp_wakeup signal when Power Down mode is entered.
Determines the DFI's tlp_wakeup time:
- 0x0 - 16 cycles
- 0x1 - 32 cycles
- 0x2 - 64 cycles
- 0x3 - 128 cycles
- 0x4 - 256 cycles
- 0x5 - 512 cycles
- 0x6 - 1024 cycles
- 0x7 - 2048 cycles
- 0x8 - 4096 cycles
- 0x9 - 8192 cycles
- 0xA - 16384 cycles
- 0xB - 32768 cycles
- 0xC - 65536 cycles
- 0xD - 131072 cycles
- 0xE - 262144 cycles
- 0xF - Unlimited
Programming mode: Static</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DFI_LP_EN_SR</name>
                <description>Enables DFI Low Power interface handshaking during Self Refresh Entry/Exit.
- 0 - Disabled
- 1 - Enabled
Programming mode: Static</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DFI_LP_WAKEUP_SR</name>
                <description>Value in DFI clpck cycles to drive on dfi_lp_wakeup signal when Self Refresh mode is entered.
Determines the DFI's tlp_wakeup time:
- 0x0 - 16 cycles
- 0x1 - 32 cycles
- 0x2 - 64 cycles
- 0x3 - 128 cycles
- 0x4 - 256 cycles
- 0x5 - 512 cycles
- 0x6 - 1024 cycles
- 0x7 - 2048 cycles
- 0x8 - 4096 cycles
- 0x9 - 8192 cycles
- 0xA - 16384 cycles
- 0xB - 32768 cycles
- 0xC - 65536 cycles
- 0xD - 131072 cycles
- 0xE - 262144 cycles
- 0xF - Unlimited
Programming mode: Static</description>
                <bitOffset>12</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DFI_LP_EN_DPD</name>
                <description>Enables DFI Low-power interface handshaking during Deep Power Down Entry/Exit.
- 0 - Disabled
- 1 - Enabled
This is only present for designs supporting mDDR or LPDDR2/LPDDR3 devices.
Programming mode: Static.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DFI_LP_WAKEUP_DPD</name>
                <description>Value in DFI clock cycles to drive on dfi_lp_wakeup signal when Deep Power Down mode is entered.
Determines the DFI's tlp_wakeup time:
- 0x0 - 16 cycles
- 0x1 - 32 cycles
- 0x2 - 64 cycles
- 0x3 - 128 cycles
- 0x4 - 256 cycles
- 0x5 - 512 cycles
- 0x6 - 1024 cycles
- 0x7 - 2048 cycles
- 0x8 - 4096 cycles
- 0x9 - 8192 cycles
- 0xA - 16384 cycles
- 0xB - 32768 cycles
- 0xC - 65536 cycles
- 0xD - 131072 cycles
- 0xE - 262144 cycles
- 0xF - Unlimited
This is only present for designs supporting mDDR or LPDDR2/LPDDR3 devices.
Programming mode: Static.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DFI_TLP_RESP</name>
                <description>Setting in DFI clock cycles for DFI's tlp_resp time.
Same value is used for both Power Down, Self Refresh, Deep Power Down and Maximum Power Saving modes.
DFI 2.1 specification onwards, recommends using a fixed value of 7 always.
Programming mode: Static</description>
                <bitOffset>24</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_DFIUPD0</name>
            <displayName>DDRCTRL_DFIUPD0</displayName>
            <description>DDRCTRL DFI update register 0 </description>
            <addressOffset>0x1a0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00400003</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DFI_T_CTRLUP_MIN</name>
                <description>Specifies the minimum number of DFI clock cycles that the dfi_ctrlupd_req signal must be asserted. The DDRCTRL expects the PHY to respond within this time.  If the PHY does not respond, the DDRCTRL de-asserts dfi_ctrlupd_req after dfi_t_ctrlup_min + 2 cycles.  Lowest value to assign to this variable is 0x3.
Programming mode: Static</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DFI_T_CTRLUP_MAX</name>
                <description>Specifies the maximum number of DFI clock cycles that the dfi_ctrlupd_req signal can assert. Lowest value to assign to this variable is 0x40.
Programming mode: Static</description>
                <bitOffset>16</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CTRLUPD_PRE_SRX</name>
                <description>Selects dfi_ctrlupd_req requirements at SRX:
-0: send ctrlupd after SRX
-1: send ctrlupd before SRX
If DFIUPD0.dis_auto_ctrlupd_srx=1, this register has no impact, because no dfi_ctrlupd_req is issued when SRX.
Programming mode: Static</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DIS_AUTO_CTRLUPD_SRX</name>
                <description>When '1', disable the automatic dfi_ctrlupd_req generation by the DDRCTRL at self-refresh exit.
When '0', DDRCTRL issues a dfi_ctrlupd_req before or after exiting self-refresh,  depending on DFIUPD0.ctrlupd_pre_srx.
Programming mode: Static</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DIS_AUTO_CTRLUPD</name>
                <description>When '1', disable the automatic dfi_ctrlupd_req generation by the DDRCTRL. The core must issue the dfi_ctrlupd_req signal using register DBGCMD.ctrlupd.
When '0', DDRCTRL issues dfi_ctrlupd_req periodically.
Programming mode: Quasi-dynamic Group 3</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_DFIUPD1</name>
            <displayName>DDRCTRL_DFIUPD1</displayName>
            <description>DDRCTRL DFI update register 1 </description>
            <addressOffset>0x1a4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00010001</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DFI_T_CTRLUPD_INTERVAL_MAX_X1024</name>
                <description>This is the maximum amount of time between DDRCTRL initiated DFI update requests. This timer resets with each update request; when the timer expires dfi_ctrlupd_req is sent and traffic is blocked until the dfi_ctrlupd_ackx is received. PHY can use this idle time to recalibrate the delay lines to the DLLs. The DFI controller update is also used to reset PHY FIFO pointers in case of data capture errors. Updates are required to maintain calibration over PVT, but frequent updates may impact performance. Minimum allowed value for this field is 1.
Note: Value programmed for DFIUPD1.dfi_t_ctrlupd_interval_max_x1024 must be greater than DFIUPD1.dfi_t_ctrlupd_interval_min_x1024.
Unit: 1024 DFI clock cycles.
Programming mode: Static.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DFI_T_CTRLUPD_INTERVAL_MIN_X1024</name>
                <description>This is the minimum amount of time between DDRCTRL initiated DFI update requests (which is executed whenever the DDRCTRL is idle). Set this number higher to reduce the frequency of update requests, which can have a small impact on the latency of the first read request when the DDRCTRL is idle. Minimum allowed value for this field is 1.
Unit: 1024 DFI clock cycles.
Programming mode: Static.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_DFIUPD2</name>
            <displayName>DDRCTRL_DFIUPD2</displayName>
            <description>DDRCTRL DFI update register 2 </description>
            <addressOffset>0x1a8</addressOffset>
            <size>0x20</size>
            <resetValue>0x80000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DFI_PHYUPD_EN</name>
                <description>Enables the support for acknowledging PHY-initiated updates:
- 0 - Disabled
- 1 - Enabled
Programming mode: Static</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_DFIMISC</name>
            <displayName>DDRCTRL_DFIMISC</displayName>
            <description>DDRCTRL DFI miscellaneous control register </description>
            <addressOffset>0x1b0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000001</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DFI_INIT_COMPLETE_EN</name>
                <description>PHY initialization complete enable signal.
When asserted the dfi_init_complete signal can be used to trigger SDRAM initialisation
Programming mode: Quasi-dynamic Group 3</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CTL_IDLE_EN</name>
                <description>Enables support of ctl_idle signal
Programming mode: Static</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DFI_INIT_START</name>
                <description>PHY init start request signal.When asserted it triggers the PHY init start request
Programming mode: Quasi-dynamic Group 3</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DFI_FREQUENCY</name>
                <description>Indicates the operating frequency of the system. The number of supported frequencies and the mapping of signal values to clock frequencies are defined by the PHY.
Programming mode: Quasi-dynamic Group 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_DFISTAT</name>
            <displayName>DDRCTRL_DFISTAT</displayName>
            <description>DDRCTRL DFI status register </description>
            <addressOffset>0x1bc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DFI_INIT_COMPLETE</name>
                <description>The status flag register which announces when the DFI initialization has been completed. The DFI INIT triggered by dfi_init_start signal and then the dfi_init_complete flag is polled to know when the initialization is done.
Programming mode: Dynamic</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DFI_LP_ACK</name>
                <description>Stores the value of the dfi_lp_ack input to the controller.
Programming mode: Dynamic</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_DFIPHYMSTR</name>
            <displayName>DDRCTRL_DFIPHYMSTR</displayName>
            <description>DDRCTRL DFI PHY master register </description>
            <addressOffset>0x1c4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000001</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DFI_PHYMSTR_EN</name>
                <description>Enables the PHY Master Interface:
- 0 - Disabled
- 1 - Enabled
Programming mode: Dynamic</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_ADDRMAP1</name>
            <displayName>DDRCTRL_ADDRMAP1</displayName>
            <description>DDRCTRL address map register 1 </description>
            <addressOffset>0x204</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ADDRMAP_BANK_B0</name>
                <description>Selects the HIF address bits used as bank address bit 0.
Valid Range: 0 to 32, and 63
Internal Base: 2
The selected HIF address bit for each of the bank address bits is determined by adding the internal base to the value of this field.
If unused, set to 63 and then bank address bit 0 is set to 0.
Programming mode: Static.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ADDRMAP_BANK_B1</name>
                <description>Selects the HIF address bits used as bank address bit 1.
Valid Range: 0 to 32, and 63
Internal Base: 3
The selected HIF address bit for each of the bank address bits is determined by adding the internal base to the value of this field.
If unused, set to 63 and then bank address bit 1 is set to 0.
Programming mode: Static.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ADDRMAP_BANK_B2</name>
                <description>Selects the HIF address bit used as bank address bit 2.
Valid Range: 0 to 31, and 63
Internal Base: 4
The selected HIF address bit is determined by adding the internal base to the value of this field.
If unused, set to 63 and then bank address bit 2 is set to 0.
Programming mode: Static.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
