STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>DDRCTRL_PCFGR_0</name>
            <displayName>DDRCTRL_PCFGR_0</displayName>
            <description>DDRCTRL port x configuration read register </description>
            <addressOffset>0x404</addressOffset>
            <size>0x20</size>
            <resetValue>0x00004000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RD_PORT_PRIORITY</name>
                <description>Determines the initial load value of read aging counters.  These counters are parallel loaded after reset, or after each grant to the corresponding port.  The aging counters down-count every clock cycle where the port is requesting but not  granted. The higher significant 5-bits of the read aging counter sets the priority of the read channel of a given port. Port's priority increases as the higher significant 5-bits of the counter starts to decrease.  When the aging counter becomes 0, the corresponding port channel has the highest priority level (timeout condition - Priority0). For multi-port configurations, the aging counters cannot be used to set port priorities when external dynamic priority  inputs (arqos) are enabled (timeout is still applicable).   For single port configurations, the aging counters are only used when they timeout (become 0) to force read-write direction switching. In this case, external dynamic priority input, arqos (for reads only) can still be used to set the DDRC read priority  (2 priority levels: low priority read - LPR, high priority read - HPR) on a command by command basis.
Note: The two LSBs of this register field are tied internally to 2'b00.
Programming mode: Static</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RD_PORT_AGING_EN</name>
                <description>If set to 1, enables aging function for the read channel of the port.
Programming mode: Static</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RD_PORT_URGENT_EN</name>
                <description>If set to 1, enables the AXI urgent sideband signal (arurgent). When enabled and arurgent  is asserted by the master, that port becomes the highest priority and co_gs_go2critical_lpr/co_gs_go2critical_hpr signal to  DDRC is asserted if enabled in PCCFG.go2critical_en register. Note that arurgent signal can be  asserted anytime and as long as required which is independent of address handshaking (it is not  associated with any particular command).
Programming mode: Static</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RD_PORT_PAGEMATCH_EN</name>
                <description>If set to 1, enables the Page Match feature. If enabled, once a requesting port is granted,  the port is continued to be granted if the following immediate commands are to the same  memory page (same bank and same row). See also related PCCFG.pagematch_limit register.
Programming mode: Static</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RDWR_ORDERED_EN</name>
                <description>Enables ordered read/writes. If set to 1, preserves the ordering between read transaction and write transaction issued to the same address, on a given port. In other words, the controller ensures that all same address read and write commands from the application port interface are transported to the DFI interface in the order of acceptance. This feature is useful in cases where software coherency is desired for masters issuing back-to-back read/write transactions without waiting for write/read responses. Note that this register has an effect only if necessary logic is instantiated via the UMCTL2_RDWR_ORDERED_n parameter.
Programming mode: Static.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_PCFGW_0</name>
            <displayName>DDRCTRL_PCFGW_0</displayName>
            <description>DDRCTRL port x configuration write register	 </description>
            <addressOffset>0x408</addressOffset>
            <size>0x20</size>
            <resetValue>0x00004000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>WR_PORT_PRIORITY</name>
                <description>Determines the initial load value of write aging counters. These counters are parallel loaded after reset, or after each grant to the corresponding port.  The aging counters down-count every clock cycle where the port is requesting but not  granted. The higher significant 5-bits of the write aging counter sets the initial priority of the          write channel of a given port. Port's priority increases as the higher significant 5-bits of the counter starts to decrease. When the aging counter becomes 0, the corresponding port channel has the highest priority level.
For multi-port configurations, the aging counters cannot be used to set port priorities when external dynamic priority  inputs (awqos) are enabled (timeout is still applicable).
For single port configurations, the aging counters are only used when they timeout (become 0) to force read-write direction switching.
Note: The two LSBs of this register field are tied internally to 2'b00.
Programming mode: Static</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>WR_PORT_AGING_EN</name>
                <description>If set to 1, enables aging function for the write channel of the port.
Programming mode: Static</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>WR_PORT_URGENT_EN</name>
                <description>If set to 1, enables the AXI urgent sideband signal (awurgent). When enabled and awurgent  is asserted by the master, that port becomes the highest priority and co_gs_go2critical_wr signal to  DDRC is asserted if enabled in PCCFG.go2critical_en register.
Note that awurgent signal can be  asserted anytime and as long as required which is independent of address handshaking (it is not  associated with any particular command).
Programming mode: Static</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>WR_PORT_PAGEMATCH_EN</name>
                <description>If set to 1, enables the Page Match feature. If enabled, once a requesting port is granted,  the port is continued to be granted if the following immediate commands are to the same  memory page (same bank and same row). See also related PCCFG.pagematch_limit register.
Programming mode: Static</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_PCTRL_0</name>
            <displayName>DDRCTRL_PCTRL_0</displayName>
            <description>DDRCTRL port x control register </description>
            <addressOffset>0x490</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PORT_EN</name>
                <description>Enables AXI port n.
Programming mode: Dynamic</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_PCFGQOS0_0</name>
            <displayName>DDRCTRL_PCFGQOS0_0</displayName>
            <description>DDRCTRL port x read Q0S configuration register 0	</description>
            <addressOffset>0x494</addressOffset>
            <size>0x20</size>
            <resetValue>0x02000E00</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RQOS_MAP_LEVEL1</name>
                <description>Separation level1 indicating the end of region0 mapping; start of region0 is 0. Possible values for level1 are 0 to 13 (for dual RAQ) or 0 to 14 (for single RAQ) which corresponds to arqos.
Note that for PA, arqos values are used directly as port priorities, where the higher the value corresponds to higher port priority.
All of the map_level* registers must be set to distinct values.
Programming mode: Quasi-dynamic Group 3</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RQOS_MAP_REGION0</name>
                <description>This bitfield indicates the traffic class of region 0.
Valid values are:
-0: LPR, 1: VPR, 2: HPR.
For dual address queue configurations, region 0 maps to the blue address queue.
In this case, valid values are:
-0: LPR and 1: VPR only.
When VPR support is disabled (UMCTL2_VPR_EN = 0) and traffic class of region0 is set to 1 (VPR), VPR traffic is aliased to LPR traffic.
Programming mode: Quasi-dynamic Group 3</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RQOS_MAP_REGION1</name>
                <description>This bitfield indicates the traffic class of region 1.
Valid values are:
-0: LPR,
-1: VPR,
- 2: HPR.
For dual address queue configurations, region1 maps to the blue address queue.
In this case, valid values are
-0: LPR and
-1: VPR only.
When VPR support is disabled (UMCTL2_VPR_EN = 0) and traffic class of region 1 is set to 1 (VPR), VPR traffic is aliased to LPR traffic.
Programming mode: Quasi-dynamic Group 3</description>
                <bitOffset>20</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_PCFGQOS1_0</name>
            <displayName>DDRCTRL_PCFGQOS1_0</displayName>
            <description>DDRCTRL port x read Q0S configuration register 1	</description>
            <addressOffset>0x498</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RQOS_MAP_TIMEOUTB</name>
                <description>Specifies the timeout value for transactions mapped to the blue address queue.
Programming mode: Quasi-dynamic Group 3.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>11</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RQOS_MAP_TIMEOUTR</name>
                <description>Specifies the timeout value for transactions mapped to the red address queue. With single read address queue, there is no red queue and this  value  has no effect.
Programming mode: Quasi-dynamic Group 3</description>
                <bitOffset>16</bitOffset>
                <bitWidth>11</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_PCFGWQOS0_0</name>
            <displayName>DDRCTRL_PCFGWQOS0_0</displayName>
            <description>DDRCTRL port x write Q0S configuration register 0	</description>
            <addressOffset>0x49c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000E00</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>WQOS_MAP_LEVEL1</name>
                <description>Separation level indicating the end of region0 mapping; start of region0 is 0. Possible values for level1 are 0 to 13 which corresponds to awqos.
Note that for PA, awqos values are used directly as port priorities, where the higher the value corresponds to higher port priority.
All of the map_level* registers must be set to distinct values.
Programming mode: Quasi-dynamic Group 3</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>WQOS_MAP_LEVEL2</name>
                <description>Separation level2 indicating the end of region1 mapping; start of region1 is (level1 + 1). Possible values for level2 are (level1 + 1) to 14 which corresponds to awqos.
Region2 starts from (level2 + 1) up to 15.
Note that for PA, awqos values are used directly as port priorities, where the higher the value corresponds to higher port priority.
All of the map_level* registers must be set to distinct values.
Programming mode: Quasi-dynamic Group 3</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>WQOS_MAP_REGION0</name>
                <description>This bitfield indicates the traffic class of region 0.
Valid values are:
When VPW support is disabled (UMCTL2_VPW_EN = 0) and traffic class of region 0 is set to 1 (VPW), VPW traffic is aliased to NPW traffic.
Programming mode: Quasi-dynamic Group 3</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>NPW, 1: VPW. </description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WQOS_MAP_REGION1</name>
                <description>This bitfield indicates the traffic class of region 1.
Valid values are:
When VPW support is disabled (UMCTL2_VPW_EN = 0) and traffic class of region 1 is set to 1 (VPW), VPW traffic is aliased to NPW traffic.
Programming mode: Quasi-dynamic Group 3</description>
                <bitOffset>20</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>NPW, 1: VPW.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WQOS_MAP_REGION2</name>
                <description>This bitfield indicates the traffic class of region 2.
Valid values are:
When VPW support is disabled (UMCTL2_VPW_EN = 0) and traffic class of region 2 is set to 1 (VPW), VPW traffic is aliased to NPW traffic.
Programming mode: Quasi-dynamic Group 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>NPW, 1: VPW.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRCTRL_PCFGWQOS1_0</name>
            <displayName>DDRCTRL_PCFGWQOS1_0</displayName>
            <description>DDRCTRL port x write Q0S configuration register 1	</description>
            <addressOffset>0x4a0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>WQOS_MAP_TIMEOUT1</name>
                <description>Specifies the timeout value for write transactions in region 0 and 1.
Programming mode: Quasi-dynamic Group 3.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>11</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>WQOS_MAP_TIMEOUT2</name>
                <description>Specifies the timeout value for write transactions in region 2.
Programming mode: Quasi-dynamic Group 3.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>11</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
