STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
        </registers>
    </peripheral>
	<peripheral>
        <name>DDRPHYC</name>
        <description>DDRPHYC</description>
		<groupName>DDRPHYC</groupName>
        <baseAddress>0x5A004000</baseAddress>
        <addressBlock>
          <offset>0x0</offset>
          <size>0x1000</size>
          <usage>registers</usage>
        </addressBlock>
        <registers>
          <register>
            <name>DDRPHYC_RIDR</name>
            <displayName>DDRPHYC_RIDR</displayName>
            <description>DDRPHYC revision ID register </description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00200200</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PUBMNR</name>
                <description>PUB minor rev</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PUBMDR</name>
                <description>PUB moderate rev</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PUBMJR</name>
                <description>PUB maj rev</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PHYMNR</name>
                <description>PHY minor rev</description>
                <bitOffset>12</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PHYMDR</name>
                <description>PHY moderate rev</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PHYMJR</name>
                <description>PHY maj rev</description>
                <bitOffset>20</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>UDRID</name>
                <description>User-defined rev ID</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRPHYC_PIR</name>
            <displayName>DDRPHYC_PIR</displayName>
            <description>DDRPHYC PHY initialization register </description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>INIT</name>
                <description>Initialization trigger
A write of '1' to this bit triggers the DDR system initialization, including PHY initialization, DRAM initialization, and PHY training.
The exact initialization steps to be executes are specified in bits 1 to 6 of this register. A bit
setting of 1 means the step is executed as part of the initialization sequence, while a setting of '0 means the step is bypassed.
The initialization trigger bit is self-clearing.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>DLLSRST</name>
                <description>DLL soft reset
Soft resets all PHY DLLs by driving the DLL soft reset pin.
Note: - Requires that ctl_clk be toggling for the DLL soft reset signal to be output from the DLL. If ctl_clk (AC DLL's cclk_0) is not guaranteed to be toggling, it is recommended to use the manual DLL soft reset bit DLLSRST of DDRPHYC_ACDLLCR, and not bit DLLSRST of DDRPHYC_PIR.
- Ensure that the minimum requirements for DLL bypass and DLL reset are observed while asserting this bit.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>DLLLOCK</name>
                <description>DLL lock
Waits for the PHY DLLs to lock.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>ZCAL</name>
                <description>Impedance calibration (Driver and ODT)
Performs PHY impedance calibration.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>ITMSRST</name>
                <description>ITM reset
Soft resets the interface timing modules for the data and data strobes, i.e., it asserts the ITM soft reset (srstb) signal.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>DRAMRST</name>
                <description>DRAM reset (DDR3 only)
Issues a reset to the DRAM (by driving the DRAM reset pin low) and wait 200us.
This can be triggered in isolation or with the full DRAM initialization (DRAMINIT). For the latter case, the reset is issued and 200us is waited before starting the full initialization sequence.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>DRAMINIT</name>
                <description>DRAM initialization
Executes the DRAM initialization sequence</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>QSTRN</name>
                <description>Read DQS training
Executes a PUBL training routine to determine the optimum position of the read data DQS strobe for maximum system timing margins.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>RVTRN</name>
                <description>Read DQS gate training DQSTRN) and RV training (RVTRN) should normally be run
together.
It is expected RVTRN is normally set whenever bit QSTRN is set.
If RVTRN=1 and bit QSTRN=0, when bit INIT=1 (triggering the init process) the read DQS gate training algorithm still runs (as if bit QSTRN in DDRPHYC_PIR register was actually set to 1).
If it is necessary to run only RV training stand-alone, with no read DQS gate training, you can prevent the read DQS gate training from running by setting bit LBGDQS=1 in DDRPHYC_PGCR register.
Note: RV training cannot use multi-purpose register (MPR) and must use the user data programmed in DTDR0-1.
Note: RVTRN is not applicable to this version of PUBL.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>ICPC</name>
                <description>Initialization complete pin configuration
Specifies how the DFI 2.1 initialization complete output pin should be used to indicate the status of initialization.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Asserted after PHY initialization (DLL locking and impedance calibration) is complete.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Asserted after PHY initialization is complete and the triggered PUBL initialization (DRAM initialization, data training, or initialization trigger with no selected initialization) is complete.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DLLBYP</name>
                <description>DLL bypass
A setting of 1 on this bit puts all PHY DLLs in bypass mode. A bypassed DLL is also powered down (disabled).</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CTLDINIT</name>
                <description>Controller DRAM initialization
Indicates if set that DRAM initialization is performed by the controller. Otherwise if not set it indicates that DRAM initialization is performed using the built-in initialization sequence or using software through the configuration port.</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CLRSR</name>
                <description>clear status register
Writing 1 to this bits does the following:
Auto-clears itself. This means a following read to bit CLRSR returns 0
Clears the DXnGSR0 bits for DTDONE, DTERR, DTIERR
Clears bit DFTERR in DDRPHYC_PGSR register and bit DFTERR in DDRPHYC_DXnGSR1 register
This bit is primarily for debug purposes and is typically not needed during normal functional operation.
It can be used when bit IDONE=1 in PGSR register, to manually clear the PGSR status bits, however, the PGSR status bits (except for the DFTRR and TQ bits) are automatically cleared by starting a new init process.
The bit can also be used to manually clear the DXnGSR status bits, however, starting a new data training process automatically clears the DXnGSR status bits.</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>LOCKBYP</name>
                <description>DLL lock bypass
Bypasses or stops, if set, the waiting of DLLs to lock. DLL lock wait is automatically triggers after reset.
DLL lock wait may be triggered manually using INIT and DLLLOCK bits of the DDRPHYC_PIR register. This bit is self-clearing.</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>ZCALBYP</name>
                <description>zcal bypass
Bypasses or stops, if set, impedance calibration of all ZQ control blocks that automatically triggers after reset.
Impedance calibration may be triggered manually using INIT and ZCAL bits of the DDRPHYC_PIR register. This bit is self-clearing.</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>INITBYP</name>
                <description>Initialization bypass
Bypasses or stops, if set, all initialization routines currently running, including PHY initialization, DRAM initialization, and PHY training.
Initialization may be triggered manually using INIT and the other relevant bits of the DDRPHYC_PIR register. This bit is self-clearing.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
