STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>DDRPHYC_PGCR</name>
            <displayName>DDRPHYC_PGCR</displayName>
            <description>DDRPHYC PHY global control register </description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <resetValue>0x01842E04</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ITMDMD</name>
                <description>ITM DDR mode
Selects whether ITMS uses DQS and DQS# or it only uses DQS.
Valid values are:
Note: The correct setting is always DQS and DQS#.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>ITMS uses DQS and DQS#</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>ITMS uses DQS only</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DQSCFG</name>
                <description>DQS gating configuration
Selects one of the two DQS gating schemes:
Note: Passive windowing must be used for LPDDR2/3.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>DQS gating is shut off using the rising edge of DQS_b (active windowing mode)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>DQS gating blankets the whole burst (passive windowing mode).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DFTCMP</name>
                <description>DQS drift compensation
Enables or disables DQS drift compensation. Valid values are:
By default, drift compensation is enabled.
Note: Drift compensation is not supported under any of the following situations:
- LPDDR2/3 (bit DDRMD set to LPDDR2 in DDRPHYC_DCR register)
- Burst length 2 (bit BL in DDRPHYC_MR0 register set to burst length of 2)
- Read DQS gating using passive windowing (bit DQSCFG in DDRPHYC_PGCR register set to passive windowing)
Drift compensation must be set to disabled if any of the above are set.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Disables data strobe drift compensation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Enables data strobe drift compensation</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DFTLMT</name>
                <description>DQS drift limit
Specifies the expected limit of drift on read data strobes. A drift of this value or greater is reported as a drift error through the host port error flag. Valid values are:
Note: Although reported through the error flag, this is not an error requiring any action. It is simply an indicator that the drift is greater than expected.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No limit (no error reported)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>90 degree drift</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>180 degree drift</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>270 degree or more drift</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DTOSEL</name>
                <description>Digital test output select
Digital Test Output Select: Selects the PHY digital test output that should be driven
onto PHY digital test output (phy_dto) pin: Valid values are:
Other: Reserved</description>
                <bitOffset>5</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>DATX8 0 DLL digital test output</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>DATX8 1 DLL digital test output</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>DATX8 2 DLL digital test output</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>DATX8 3 DLL digital test output</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>DATX8 4 DLL digital test output</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x5</name>
                    <description>DATX8 5 DLL digital test output</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x6</name>
                    <description>DATX8 6 DLL digital test output</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7</name>
                    <description>DATX8 7 DLL digital test output</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x8</name>
                    <description>DATX8 8 DLL digital test output</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x9</name>
                    <description>AC DLL digital test output</description>
                    <value>0x9</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CKEN</name>
                <description>CK enable
Controls whether the CK going to the SDRAM is enabled (toggling) or
disabled (static value defined by CKDV). One bit for each of the three CK pairs.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CKDV</name>
                <description>CK disable value
Specifies the static value that should be driven on CK/CK# pair(s) when the pair(s) is disabled. CKDV[0] specifies the value for CK and CKDV[1] specifies the value for CK#.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CKINV</name>
                <description>CK invert
Specifies if set that CK/CK# should be inverted. Otherwise CK/CK# toggles with normal polarity.</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IOLB</name>
                <description>I/O loop back select
Selects where inside the I/O the loop-back of signals happens. Not applicable to D3A I/Os.
Valid values are:</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Loopback is after output buffer; output enable must be asserted</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Loopback is before output buffer; output enable is dont care</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IODDRM</name>
                <description>I/O DDR mode
Selects the DDR mode for the I/Os.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RANKEN</name>
                <description>Rank enable
Specifies the ranks that are enabled for data-training.
only Bit 0 is used and controls rank 0.
Setting the bit to '1 enables the rank, and setting it to '0 disables the rank.</description>
                <bitOffset>18</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ZKSEL</name>
                <description>Impedance clock divider selection
Selects the divide ratio for the clock used by the impedance control logic. The source clock for
the divider is the configuration port clock signal (pclk), depending on which configuration port type used (see Impedance Calibration on page tbc).
Valid values are:</description>
                <bitOffset>22</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Divide by 2</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Divide by 8</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>Divide by 32</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>Divide by 64</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PDDISDX</name>
                <description>Power down disabled byte
Indicates if set that the DLL and I/Os of a disabled byte should be powered down.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RFSHDT</name>
                <description>Refresh during training
A non-zero value specifies that a burst of refreshes equal to the number specified in this field should be sent to the SDRAM after training each rank except the last rank.</description>
                <bitOffset>25</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LBDQSS</name>
                <description>Loop back DQS shift
Selects how the read DQS is shifted during loopback to ensure that the read DQS is centered into the read data eye. Valid values are:</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>PUB sets the read DQS delay to 0; DQS is already shifted 90 degrees by write path</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The read DQS shift is set manually through software.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LBGDQS</name>
                <description>Loop back DQS gating
Selects the DQS gating mode that should be used when the PHY is in loopback mode. Valid values are:</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>DQS gate training is triggered on the PUB</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>DQS gate is set manually using software</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LBMODE</name>
                <description>Loop back mode
Indicates if set that the PHY/PUB is in loopback mode</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRPHYC_PGSR</name>
            <displayName>DDRPHYC_PGSR</displayName>
            <description>DDRPHYC PHY global status register </description>
            <addressOffset>0xc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>IDONE</name>
                <description>Initialization done
Indicates if set that the DDR system initialization has completed.
This bit is set after all the selected initialization routines in DDRPHYC_PIR register have completed.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DLDONE</name>
                <description>DLL lock done
Indicates if set that DLL locking has completed.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ZCDDONE</name>
                <description>zcal done
Indicates if set that impedance calibration has completed.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DIDONE</name>
                <description>DRAM initialization done
Indicates if set that DRAM initialization has completed.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DTDONE</name>
                <description>Data training done
Indicates, if set, that the PHY has finished doing data training.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DTERR</name>
                <description>DQS gate training error
If set, indicates that a valid DQS gating window could not be found during DQS gate training.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DTIERR</name>
                <description>DQS gate training intermittent error
If set, indicates that there was an intermittent error during DQS gate training, such as a pass was followed by a fail then followed by another pass.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DFTERR</name>
                <description>DQS drift error
If set, indicates that at least one of the read data strobes has drifted by more than or equal to the drift limit set in the PHY General Configuration Register (PGCR).</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>RVERR</name>
                <description>Read valid training error
If set, indicates that a valid read valid placement could not be found during read valid training.
Note: RVTRN is not applicable to this version of PUBL</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>RVEIRR</name>
                <description>Read valid training intermittent error
If set, indicates that there was an intermittent error during read valid training, such as a pass was followed by a fail then followed by another pass.
Note: RVTRN is not applicable to this version of PUBL</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>TQ</name>
                <description>Temperature output (LPDDR only) N/A</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
