STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>DDRPHYC_DLLGCR</name>
            <displayName>DDRPHYC_DLLGCR</displayName>
            <description>DDRPHYC DDR DLL global control register </description>
            <addressOffset>0x10</addressOffset>
            <size>0x20</size>
            <resetValue>0x03737000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DRES</name>
                <description>Trim reference current versus resistor value variation
1x: Rnom + 20%
Note: For a few processes this field is reserved and is not used by the DLL.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Rnom</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Rnom - 20%</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IPUMP</name>
                <description>Charge pump current trim
Note: If DWC_DDR3PHY_DLL_TYPEA Verilog macro is defined then the default value for this field is 011.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>maximum current</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7</name>
                    <description>minimum current</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TESTEN</name>
                <description>Test enable
Enables digital and analog test outputs selected by DTC and ATC respectively.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DTC</name>
                <description>Digital test control
Selects the digital signal to be output on the DLL digital test output (test_out_d[1]) when TESTEN is high (Output is '0' when TESTEN is low).
Valid settings for master DLL (such as, when TESTSW = '0'):
-000: 0 output clock (clk_0)
-001: 90 output clock (clk_90)
-010: 180 output clock (clk_180)
-011: 270 output clock (clk_270)
-100: 360 internal clock (clk_360_int)
-101: Speed-up pulse (spdup)
-110: Slow-down pulse (slwdn)
-111: 0 MCTL logic clock (cclk_0)
Valid settings for slave DLL (such as when TESTSW = '1'):
-000: Input DQS strobe (dqs)
-001: Input clock reference (clk_90_in)
-010: Internal feedback clock (clk_0_out)
-011: 90 output DQS# strobe (dqsb_90)
-100: 90 output DQS strobe (dqs_90)
-101: Speed-up pulse (spdup)
-110: Slow-down pulse (slwdn)
-111: Auto-lock enable signal</description>
                <bitOffset>6</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ATC</name>
                <description>Analog test control
Selects the analog signal to be output on the DLL analog test output (test_out_a) when TESTEN is high (Output is Vss when TESTEN is low).
The test output either comes from the master DLL or the slave DLL, depending on the setting of the test switch (TESTSW).
Both master DLL and slave DLL output similar analog test signals. Valid settings for analog test control are:</description>
                <bitOffset>9</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Replica bias output for PMOS (Vbp)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Replica bias output for NMOS (Vbn)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>Filter output (Vc)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>VDDCORE</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TESTSW</name>
                <description>Test switch
Selects the test signals of either the master DLL, set to 0, or the slave DLL, set to 1.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MBIAS</name>
                <description>Master bias trim
Used to trim the bias for the master DLL.
Note: If DWC_DDR3PHY_DLL_TYPEA Verilog macro is defined then the default value for this field is 0x00.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SBIAS2_0</name>
                <description>Slave bias trim
Used to trim the bias for the slave DLL.
Note: If DWC_DDR3PHY_DLL_TYPEA Verilog macro is defined then the default value for this field is 0x00.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>BPS200</name>
                <description>Bypass mode frequency range</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>0 to 100 MHz </description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>0 to 200 MHz </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SBIAS5_3</name>
                <description>Slave bias trim
Used to trim the bias for the slave DLL.
Note: If DWC_DDR3PHY_DLL_TYPEA Verilog macro is defined then the default value for this field is 0x00.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FDTRMSL</name>
                <description>Slave bypass fixed delay trim</description>
                <bitOffset>27</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Nominal delay</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Nominal delay  10%</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>Nominal delay + 10%</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>Nominal delay + 20%</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LOCKDET</name>
                <description>Master lock detect enable
Note: This field is only valid for a few processes. For all other processes this field is reserved.</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DLLRSVD2</name>
                <description>These bit are connected to the DLL control bus and reserved for future use.</description>
                <bitOffset>30</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRPHYC_ACDLLCR</name>
            <displayName>DDRPHYC_ACDLLCR</displayName>
            <description>DDRPHYC AC DLL control register </description>
            <addressOffset>0x14</addressOffset>
            <size>0x20</size>
            <resetValue>0x40000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MFBDLY</name>
                <description>Master DLL feed-back delay trim
Used to trim the delay in the master DLL feed-back path:</description>
                <bitOffset>6</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>minimum delay</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7</name>
                    <description>maximum delay</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MFWDLY</name>
                <description>Master DLL feed-forward delay trim
Used to trim the delay in the master DLL feed-forward path:</description>
                <bitOffset>9</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>minimum delay</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7</name>
                    <description>maximum delay</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ATESTEN</name>
                <description>Analog test enable
Enables the analog test signal to be output on the DLL analog test output (ATO pin). The DLL analog test output is tri-stated when this bit is '0'.</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DLLSRST</name>
                <description>DLL soft reset
Soft resets the AC DLL by driving the DLL soft reset pin.</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DLLDIS</name>
                <description>DLL disable
A disabled DLL is bypassed. By default DLL is enabled.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRPHYC_PTR0</name>
            <displayName>DDRPHYC_PTR0</displayName>
            <description>DDRPHYC PT register 0 </description>
            <addressOffset>0x18</addressOffset>
            <size>0x20</size>
            <resetValue>0x0022AF9B</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TDLLSRST</name>
                <description>DLL soft reset
Number of configuration clock cycles that the DLL soft reset pin must remain asserted when the soft reset is triggered through the PHY initialization register (DDRPHYC_PIR).
This must correspond to a value that is equal to or more than 50ns or 8 controller clock cycles, whichever is bigger.
Default value corresponds to 50 ns at 533 MHz.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TDLLLOCK</name>
                <description>DLL lock time
Number of configuration clock cycles for the DLL to stabilize and lock, i.e. number of clock cycles from when the DLL reset pin is de-asserted to when the DLL has locked and is ready for use.
Default value corresponds to 5.12us at 533MHz.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TITMSRST</name>
                <description>ITM soft reset
Number of configuration clock cycles that the ITM soft reset pin must remain asserted when the soft reset is applied to the ITMs.
This must correspond to a value that is equal to or more than 8 controller clock cycles.
Default value corresponds to 8 controller clock cycles.</description>
                <bitOffset>18</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRPHYC_PTR1</name>
            <displayName>DDRPHYC_PTR1</displayName>
            <description>DDRPHYC PT register 1 </description>
            <addressOffset>0x1c</addressOffset>
            <size>0x20</size>
            <resetValue>0x0604111D</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TDINIT0</name>
                <description>tDINIT0
DRAM initialization time corresponding to the following:
DDR3 = CKE low time with power and clock stable (500 us)
LPDDR2 = CKE high time to first command (200 us)
LPDDR3 = CKE high time to first command (200us)
Default value corresponds to DDR3 500 us at 533MHz.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>19</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TDINIT1</name>
                <description>tDINIT1
DRAM initialization time corresponding to the following:
DDR3 = CKE high time to first command (tRFC +10 ns or 5 tCK, whichever value is larger)
LPDDR2 = CKE low time with power and clock stable (100 ns)
LPDDR3 = CKE low time with power and clock stable (100 ns)
Default value corresponds to DDR3 360ns at 533MHz.</description>
                <bitOffset>19</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRPHYC_PTR2</name>
            <displayName>DDRPHYC_PTR2</displayName>
            <description>DDRPHYC PT register 2 </description>
            <addressOffset>0x20</addressOffset>
            <size>0x20</size>
            <resetValue>0x042DA072</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TDINIT2</name>
                <description>tDINIT2
DRAM initialization time corresponding to the following:
DDR3 = Reset low time (200 us on power-up or 100 ns after power-up)
LPDDR2 = Time from reset command to end of auto initialization (1 us + 10 us = 11us)
LPDDR3 = Time from reset command to end of auto initialization (11us)
Default value corresponds to DDR3 200 us at 533MHz</description>
                <bitOffset>0</bitOffset>
                <bitWidth>17</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TDINIT3</name>
                <description>tDINIT3
DRAM initialization time corresponding to the following:
LPDDR2 = Time from ZQ initialization command to first command (1 us)
LPDDR3 = Time from ZQ initialization command to first command (1us)
Default value corresponds to the LPDDR2/3 1 us at 533MHz.</description>
                <bitOffset>17</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRPHYC_ACIOCR</name>
            <displayName>DDRPHYC_ACIOCR</displayName>
            <description>DDRPHYC ACIOC register </description>
            <addressOffset>0x24</addressOffset>
            <size>0x20</size>
            <resetValue>0x30400812</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ACIOM</name>
                <description>AC pins I/O mode
Selects SSTL mode (when set to 0) or CMOS mode (when set to 1) of the I/O for all address and command pins,</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ACOE</name>
                <description>AC pins output enable
Enables, when set, the output driver on the I/O for all address and command pins</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ACODT</name>
                <description>AC pins ODT
Enables, when set, the on-die termination on the I/O for RAS#, CAS#, WE#, BA[2:0], and A[15:0] pins</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ACPDD</name>
                <description>AC pins power down drivers
Powers down, when set, the output driver on the I/O for RAS#, CAS#, WE#, BA[2:0], and A[15:0] pins</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ACPDR</name>
                <description>AC pins power down receivers
Powers down, when set, the input receiver on the I/O for RAS#, CAS#, WE#, BA[2:0], and A[15:0] pins.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CKODT</name>
                <description>CK pin ODT
Enables, when set, the on-die termination on the I/O for CK[0], CK[1], and CK[2] pins, respectively.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CKPDD</name>
                <description>CK pin power down driver
Powers down, when set, the output driver on the I/O for CK[0], CK[1], and CK[2] pins, respectively.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CKPDR</name>
                <description>CK pin power down receiver
Powers down, when set, the input receiver on the I/O for CK[0], CK[1], and CK[2] pins, respectively</description>
                <bitOffset>11</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RANKODT</name>
                <description>Rank ODT
Enables, when set, the on-die termination on the I/O for CKE, ODT, and CS# pins.</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CSPDD</name>
                <description>CS power down driver
Powers down, when set, the output driver on the I/O for CS# pins.
Only PDD[0] is used for single rank.
CKE and ODT driver power down is controlled by DSGCR register.</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RANKPDR</name>
                <description>Rank power down receiver
Powers down, when set, the input receiver on the I/O CKE, ODT, and CS# pins.
Only RANKPDR[0] is used for single rank</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RSTODT</name>
                <description>RST pin ODT
Enables, when set, the on-die termination on the I/O for SDRAM RST# pin.</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RSTPDD</name>
                <description>RST pin power down driver
Powers down, when set, the output driver on the I/O for SDRAM RST# pin.</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RSTPDR</name>
                <description>RST pin power down receiver
Powers down, when set, the input receiver on the I/O for SDRAM RST# pin.</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RSTIOM</name>
                <description>Reset I/O mode
Selects SSTL mode (when set to 0) or CMOS mode (when set to 1) of the I/O for SDRAM Reset.</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ACSR</name>
                <description>AC slew rate
Selects slew rate of the I/O for all address and command pins.</description>
                <bitOffset>30</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
