STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>DDRPHYC_DTPR0</name>
            <displayName>DDRPHYC_DTPR0</displayName>
            <description>DDRPHYC DTP register 0 </description>
            <addressOffset>0x34</addressOffset>
            <size>0x20</size>
            <resetValue>0x3092666E</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TMRD</name>
                <description>tMRD
Load mode cycle time: The minimum time between a load mode register command and any other command.
For DDR3 this is the minimum time between two load mode register commands.
For DDR3, the value used for tMRD is 4 plus the value programmed in these bits, i.e. tMRD value for DDR3 ranges from 4 to 7.
For LPDDR3, the value used for tMRD is 8 plus the value programmed in these bits.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TRTP</name>
                <description>tRTP
Internal read to precharge command delay. Valid values are 2 to 6. Note that even though RTP does not apply to JEDEC DDR devices, this parameter must still be set to a minimum value of 2 for DDR because the Controller always uses the DDR2 equation, AL + BL/2 + max(RTP,2)  2, to compute the read to precharge timing (which is BL/2 for JEDEC DDR).</description>
                <bitOffset>2</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TWTR</name>
                <description>tWTR
Internal write to read command delay. Valid values are 1 to 6.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TRP</name>
                <description>tRP
Precharge command period: The minimum time between a precharge command and any other command.
Note: Note that the controller automatically derives tRPA for 8-bank DDR2 devices by adding 1 to tRP. Valid values are 2 to 11.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TRCD</name>
                <description>tRCD
Activate to read or write delay. Minimum time from when an activate command is issued to when a read or write to the activated row can be issued. Valid values are 2 to 11.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TRAS</name>
                <description>tRAS
Activate to precharge command delay. Valid values are 2 to 31.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TRRD</name>
                <description>tRRD
Activate to activate command delay (different banks). Valid values are 1 to 8.</description>
                <bitOffset>21</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TRC</name>
                <description>tRC
Activate to activate command delay (same bank). Valid values are 2 to 42.</description>
                <bitOffset>25</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TCCD</name>
                <description>tCCDRead to read and write to write command delay</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>BL/2 for DDR2 and 4 for DDR3</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>BL/2 + 1 for DDR2 and 5 for DDR3</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRPHYC_DTPR1</name>
            <displayName>DDRPHYC_DTPR1</displayName>
            <description>DDRPHYC DTP register 1 </description>
            <addressOffset>0x38</addressOffset>
            <size>0x20</size>
            <resetValue>0x09830090</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TAOND</name>
                <description>tAOND/tAOFD
ODT turn-on/turn-off delays (DDR2 only). The delays are in clock cycles.
Valid values are:
Most DDR2 devices utilize a fixed value of 2/2.5. For non-standard SDRAMs, the
user must ensure that the operational Write Latency is always greater than or equal
to the ODT turn-on delay. For example, a DDR2 SDRAM with CAS latency set to 3
and CAS additive latency set to 0 has a Write Latency of 2. Thus 2/2.5 can be used,
but not 3/3.5 or higher.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>2/2.5</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>3/3.5</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>4/4.5</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>5/5.5</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TRTW</name>
                <description>tRTW
Read to Write command delay.
Valid values are:
This parameter allows the user to increase the delay between issuing Write commands to the SDRAM when preceded by Read commands. This provides an option to increase bus turn-around margin for high frequency systems.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>standard bus turn around delay</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>add 1 clock to standard bus turn around delay</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TFAW</name>
                <description>tFAW
4-bank activate period. No more than 4-bank activate commands may be issued in a given tFAW period. Only applies to 8-bank devices.
Valid values are 2 to 31.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TMOD</name>
                <description>tMOD
Load mode update delay (DDR3 only). The minimum time between a load mode register command and a non-load mode register command.
Valid values are:</description>
                <bitOffset>9</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>12</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>13</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>14</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>15</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TRTODT</name>
                <description>tRTODT
Read to ODT delay (DDR3 only). Specifies whether ODT can be enabled immediately after the read post-amble or one clock delay has to be added.
Valid values are:
If tRTODT is set to 1, then the read-to-write latency is increased by 1 if ODT is enabled.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>ODT may be turned on immediately after read post-amble</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>ODT may not be turned on until one clock after the read post-amble</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TRFC</name>
                <description>tRFC
Refresh-to-Refresh: Indicates the minimum time, in clock cycles, between two refresh commands or between a refresh and an active command. This is derived from the minimum refresh interval from the datasheet, tRFC(min), divided by the clock cycle time.
The default number of clock cycles is for the largest JEDEC tRFC(min parameter value supported.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TDQSCKMIN</name>
                <description>tDQSCKmin
DQS output access time from CK/CK# (LPDDR2/3 only).
This value is used for computing the read latency. Valid values are 0 to 7.
This value is derived from the corresponding parameter in the SDRAM datasheet divided by the clock cycle time without rounding up.
The fractional remainder is automatically adjusted for by data training in quarter clock cycle units.
If data training is not performed then this fractional remainder must be converted to quarter clock cycle units and the gating registers (DXnDQSTR) adjusted accordingly.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TDQSCKMAX</name>
                <description>tDQSCKmax
Maximum DQS output access time from CK/CK# (LPDDR2 only).
This value is used for implementing read-to-write spacing. Valid values are 1 to 7.</description>
                <bitOffset>27</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRPHYC_DTPR2</name>
            <displayName>DDRPHYC_DTPR2</displayName>
            <description>DDRPHYC DTP register 2 </description>
            <addressOffset>0x3c</addressOffset>
            <size>0x20</size>
            <resetValue>0x1001A0C8</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TXS</name>
                <description>tXS
Self refresh exit delay. The minimum time between a self refresh exit command and any other command. This parameter must be set to the maximum of the various minimum self refresh exit delay parameters specified in the SDRAM datasheet, i.e. max(tXSNR, tXSRD) for DDR2 and max(tXS, tXSDLL) for DDR3. Valid values are 2 to 1023.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TXP</name>
                <description>tXP
Power down exit delay. The minimum time between a power down exit command and any other command. This parameter must be set to the maximum of the various minimum power down exit delay parameters specified in the SDRAM datasheet, i.e. max(tXP, tXARD, tXARDS) for DDR2 and max(tXP, tXPDLL) for DDR3. Valid values are 2 to 31.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TCKE</name>
                <description>tCKE
CKE minimum pulse width. Also specifies the minimum time that the SDRAM must remain in power down or self refresh mode. For DDR3 this parameter must be set to the value of tCKESR which is usually bigger than the value of tCKE. Valid values are 2 to 15.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TDLLK</name>
                <description>tDLLK
DLL locking time. Valid values are 2 to 1023.</description>
                <bitOffset>19</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRPHYC_DDR3_MR0</name>
            <displayName>DDRPHYC_DDR3_MR0</displayName>
            <description>DDRPHYC MR0 register for DDR3 </description>
            <addressOffset>0x40</addressOffset>
            <size>16</size>
            <resetValue>0x00000A52</resetValue>
            <resetMask>0x0000FFFF</resetMask>
            <fields>
              <field>
                <name>BL</name>
                <description>Burst length
Determines the maximum number of column locations that can be accessed during a given read or write command.
Valid values for DDR3 are:</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>8 (Fixed)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>4 or 8 (On the fly)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>4 (Fixed)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CL0</name>
                <description>CAS latency
The delay, in clock cycles, between when the SDRAM registers a read command to when data is available.
Valid values for CL[3:0] are:
Others: Reserved</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>BT</name>
                <description>Burst type
Indicates whether a burst is sequential (0) or interleaved (1).</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CL</name>
                <description>CAS latency
The delay, in clock cycles, between when the SDRAM registers a read command to when data is available.
Valid values for CL[3:0] are:
Others: Reserved</description>
                <bitOffset>4</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TM</name>
                <description>Operating mode
Selects either normal operating mode (0) or test mode (1). Test mode is reserved for the manufacturer and should not be used.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DR</name>
                <description>DLL reset (autoclear)
Writing a '1 to this bit resets the SDRAM DLL. This bit is self clearing,
i.e. it returns back to '0 after the DLL reset has been issued.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>WR</name>
                <description>Write recovery
This is the value of the write recovery in clock cycles. It is calculated by dividing the data sheet write recovery time, tWR (ns) by the data sheet clock cycle time, tCK (ns) and rounding up a non-integer value to the next integer.
Valid values are:
All other settings are reserved and should not be used.
Note: tWR (ns) is the time from the first SDRAM positive clock edge after the last data-in pair of a write command, to when a precharge of the same bank can be issued.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>5</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>6</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>7</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>8</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x5</name>
                    <description>10</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x6</name>
                    <description>12</description>
                    <value>0x6</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PD</name>
                <description>Power-down control
Controls the exit time for power-down modes. Refer to SDRAM datasheet for details on power-down modes. Valid values are:</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Slow exit (DLL off)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Fast exit (DLL on)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVD</name>
                <description>JEDEC reserved.</description>
                <bitOffset>13</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
