STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>DDRPHYC_DDR3_MR1</name>
            <displayName>DDRPHYC_DDR3_MR1</displayName>
            <description>DDRPHYC MR1 register for DDR3 </description>
            <addressOffset>0x44</addressOffset>
            <size>16</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000FFFF</resetMask>
            <fields>
              <field>
                <name>DE</name>
                <description>DLL enable/disable
Enable (0) or disable (1) the DLL.
DLL must be enabled for normal operation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DIC0</name>
                <description>Output driver impedance control
Controls the output drive strength.
Valid values for {DIC1,DIC0} are:</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>RZQ/6</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>RZQ/7</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RTT0</name>
                <description>On die termination
Selects the effective resistance for SDRAM on die termination.
Valid values for {RTT2,RTT1,RTT0} are:
Others: Reserved</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AL</name>
                <description>Posted CAS Additive Latency:
Setting additive latency that allows read and write commands to be issued to the SDRAM earlier than normal (refer to SDRAM datasheet for details). Valid values are:</description>
                <bitOffset>3</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>0 (AL disabled)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>CL - 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>CL - 2</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIC1</name>
                <description>Output driver impedance control
Controls the output drive strength.
Valid values for {DIC1,DIC0} are:</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>RZQ/6</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>RZQ/7</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RTT1</name>
                <description>On die termination
Selects the effective resistance for SDRAM on die termination.
Valid values for {RTT2,RTT1,RTT0} are:
Others: Reserved</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LEVEL</name>
                <description>Write leveling enable (N/A)</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RTT2</name>
                <description>On die termination
Selects the effective resistance for SDRAM on die termination.
Valid values for {RTT2,RTT1,RTT0} are:
Others: Reserved</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TDQS</name>
                <description>Termination data strobe
When enabled ('1) TDQS provides additional termination resistance outputs that may be useful in some system configurations. (N/A)</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QOFF</name>
                <description>Output enable/disable
This feature is intended to be used for IDD characterization of read current and should not be used in normal operation.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>all outputs function as normal</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>all SDRAM outputs are disabled removing output buffer current.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>		  
		  <register>
			  <name>DDRPHYC_LPDDR2_MR1</name>
			  <displayName>DDRPHYC_LPDDR2_MR1</displayName>
			  <description>DDRPHYC_LPDDR2_MR1</description>
			  <alternateRegister>DDRPHYC_DDR3_MR1</alternateRegister>
			  <addressOffset>0x44</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0x0000FFFF</resetMask>
			  <fields>
				  <field>
					<name>BL</name>
					<description>Burst length
	Determines the maximum number of column locations that can be accessed during a given read or write command. Valid values are:
	Others: Reserved</description>
					<bitOffset>0</bitOffset>
					<bitWidth>3</bitWidth>
					<access>read-write</access>
					<enumeratedValues>
					  <enumeratedValue>
						<name>B_0x2</name>
						<description>4</description>
						<value>0x2</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x3</name>
						<description>8</description>
						<value>0x3</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x4</name>
						<description>16</description>
						<value>0x4</value>
					  </enumeratedValue>
					</enumeratedValues>
				  </field>
				  <field>
					<name>BT</name>
					<description>Burst Type: Indicates whether a burst is sequential (0) or interleaved (1). ,</description>
					<bitOffset>3</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				  </field>
				  <field>
					<name>WC</name>
					<description>Wrap control</description>
					<bitOffset>4</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
					<enumeratedValues>
					  <enumeratedValue>
						<name>B_0x0</name>
						<description>wrap</description>
						<value>0x0</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x1</name>
						<description>no wrap</description>
						<value>0x1</value>
					  </enumeratedValue>
					</enumeratedValues>
				  </field>
				  <field>
                <name>NWR</name>
                <description>Write recovery
Others: Reserved</description>
                <bitOffset>5</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>nWR=3</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>nWR=6</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x6</name>
                    <description>nWR=8</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7</name>
                    <description>nWR=9</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>            
             </fields>
        </register>		
		<register>
          <name>DDRPHYC_LPDDR3_MR1</name>
          <displayName>DDRPHYC_LPDDR3_MR1</displayName>
          <description>DDRPHYC_LPDDR3_MR1</description>
          <alternateRegister>DDRPHYC_DDR3_MR1</alternateRegister>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
		  <resetMask>0x0000FFFF</resetMask>
          <fields>
		    <field>
                <name>BL</name>
                <description>Burst length
Determines the maximum number of column locations that can be accessed during a given read or write command.
Others: Reserved</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>8</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>            
              <field>
                <name>NWR</name>
                <description>Write recovery
If nWRE (MR2 [4]) = 0:
-001: nWR=3
-100: nWR=6
-110: nWR=8
-111: nWR=9
If nWRE (MR2[4]) = 1:
-000: nWR=10
-001: nWR=11
-010: nWR=12
Others: Reserved</description>
                <bitOffset>5</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
		   </fields>
        </register>
        <register>
            <name>DDRPHYC_DDR3_MR2</name>
            <displayName>DDRPHYC_DDR3_MR2</displayName>
            <description>DDRPHYC MR2 register for DDR3 </description>
            <addressOffset>0x48</addressOffset>
            <size>16</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000FFFF</resetMask>
            <fields>
              <field>
                <name>PASR</name>
                <description>Partial array self-refresh
Specifies that data located in areas of the array beyond the specified location are lost if self refresh is entered.
Valid settings for 8 banks are:</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Full Array</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Half Array (BA[2:0] = 000, 001, 010 &amp; 011)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>Quarter Array (BA[2:0] = 000, 001)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>1/8 Array (BA[2:0] = 000)</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>3/4 Array (BA[2:0] = 010, 011, 100, 101, 110 &amp; 111)</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x5</name>
                    <description>Half Array (BA[2:0] = 100, 101, 110 &amp; 111)</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x6</name>
                    <description>Quarter Array (BA[2:0] = 110 &amp; 111)</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7</name>
                    <description>1/8 Array (BA[2:0] 111)</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CWL</name>
                <description>CAS write latency
The delay, in clock cycles, between when the SDRAM registers a write command to when write data is available.
Others: Reserved</description>
                <bitOffset>3</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>5 (tCK = 2.5ns)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>6 (2.5ns &gt; tCK = 1.875ns)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>7 (1.875ns &gt; tCK = 1.5ns)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>8 (1.5ns &gt; tCK = 1.25ns)</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ASR</name>
                <description>Auto self-refresh
When enabled ('1), SDRAM automatically provides self-refresh power management functions for all supported operating temperature values.
Otherwise the SRT bit must be programmed to indicate the temperature range.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SRT</name>
                <description>Self-refresh temperature range
Selects either normal ('0) or extended ('1) operating temperature range during self-refresh.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RTTWR</name>
                <description>Dynamic ODT
Selects RTT for dynamic ODT.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Dynamic ODT off</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>RZQ/4</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>RZQ/2</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>		  
		  <register>
          <name>DDRPHYC_LPDDR2_MR2</name>
          <displayName>DDRPHYC_LPDDR2_MR2</displayName>
          <description>DDRPHYC MR2 register for LPDDR2</description>
          <alternateRegister>DDRPHYC_DDR3_MR2</alternateRegister>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
		  <resetMask>0x0000FFFF</resetMask>
          <fields>
              <field>
                <name>RLWL</name>
                <description>Read and write latency
Others: Reserved</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>RL = 3 /WL = 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>RL = 4 / WL = 2</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>RL = 5 / WL = 2</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>RL = 6 / WL = 3</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x5</name>
                    <description>RL = 7 / WL = 4</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x6</name>
                    <description>RL = 8 / WL = 4</description>
                    <value>0x6</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
          </fields>
        </register>		
		<register>
          <name>DDRPHYC_LPDDR3_MR2</name>
          <displayName>DDRPHYC_LPDDR3_MR2</displayName>
          <description>DDRPHYC MR2 register for LPDDR3</description>
          <alternateRegister>DDRPHYC_DDR3_MR2</alternateRegister>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
		  <resetMask>0x0000FFFF</resetMask>
          <fields>
              <field>
                <name>RLWL</name>
                <description>Read and write latency
Others: Reserved</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>RL = 3 /WL = 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>RL = 4 / WL = 2</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>RL = 5 / WL = 2</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>RL = 6 / WL = 3</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x5</name>
                    <description>RL = 7 / WL = 4</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x6</name>
                    <description>RL = 8 / WL = 4</description>
                    <value>0x6</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NWRE</name>
                <description>New for LPDDR3 (not used by this PHY, leave at zero)</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>            
              <field>
                <name>WL</name>
                <description>New for LPDDR3 (not used by this PHY, leave at zero)</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>WR</name>
                <description>New for LPDDR3 (not used by this PHY, leave at zero)</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
          </fields>
        </register>
          <register>
            <name>DDRPHYC_DDR3_MR3</name>
            <displayName>DDRPHYC_DDR3_MR3</displayName>
            <description>DDRPHYC MR3 register for DDR3 </description>
            <addressOffset>0x4c</addressOffset>
            <size>8</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x000000FF</resetMask>
            <fields>
              <field>
                <name>MPRLOC</name>
                <description>Multi-purpose register (MPR) location
Selects MPR data location.
Others: Reserved</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Predefined pattern for system calibration</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MPR</name>
                <description>Multi-purpose register enable
Enables, if set, that read data should come from the Multi-Purpose Register. Otherwise read data come from the DRAM array.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
