STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>DDRPHYC_ODTCR</name>
            <displayName>DDRPHYC_ODTCR</displayName>
            <description>DDRPHYC ODTC register </description>
            <addressOffset>0x50</addressOffset>
            <size>0x20</size>
            <resetValue>0x00010000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RDODT</name>
                <description>Specifies whether ODT should be enabled ('1) or disabled ('0) on read</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>WRODT</name>
                <description>Specifies whether ODT should be enabled ('1) or disabled ('0) on write</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRPHYC_DTAR</name>
            <displayName>DDRPHYC_DTAR</displayName>
            <description>DDRPHYC DTA register </description>
            <addressOffset>0x54</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DTCOL</name>
                <description>Data training column address:
Selects the SDRAM column address to be used during data training.
The lower four bits of this address must always be 0000.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DTROW</name>
                <description>Data training row address:
Selects the SDRAM row address to be used during data training.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DTBANK</name>
                <description>Data training bank address:
Selects the SDRAM bank address to be used during data training.</description>
                <bitOffset>28</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DTMPR</name>
                <description>Data training using MPR (DDR3 Only):
Specifies, if set, that data-training should use the SDRAM Multi-Purpose Register (MPR) register. Otherwise data-training is performed by first writing to some locations in the SDRAM and then reading the back.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRPHYC_DTDR0</name>
            <displayName>DDRPHYC_DTDR0</displayName>
            <description>DDRPHYC DTD register 0 </description>
            <addressOffset>0x58</addressOffset>
            <size>0x20</size>
            <resetValue>0xDD22EE11</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DTBYTE0</name>
                <description>Data Training Data</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DTBYTE1</name>
                <description>Data Training Data</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DTBYTE2</name>
                <description>Data Training Data</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DTBYTE3</name>
                <description>Data training data
The first 4 bytes (e.g. shifted as Byte 0,1,2,3) of data used during data training. This same data byte is used for each Byte Lane.
Default sequence is a walking 1 while toggling data every data cycle.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRPHYC_DTDR1</name>
            <displayName>DDRPHYC_DTDR1</displayName>
            <description>DDRPHYC DTD register 1 </description>
            <addressOffset>0x5c</addressOffset>
            <size>0x20</size>
            <resetValue>0x7788BB44</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DTBYTE4</name>
                <description>Data Training Data</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DTBYTE5</name>
                <description>Data Training Data</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DTBYTE6</name>
                <description>Data Training Data</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DTBYTE7</name>
                <description>Data training data:
The second 4 bytes (e.g. shifted as Byte 4,5,6,7) of data used during data training. This same data byte is used for each Byte Lane.
Default sequence is a walking 1 while toggling data every data cycle.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRPHYC_GPR0</name>
            <displayName>DDRPHYC_GPR0</displayName>
            <description>DDRPHYC general purpose register 0 </description>
            <addressOffset>0x178</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>GPR0</name>
                <description>General purpose register 0 bits</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRPHYC_GPR1</name>
            <displayName>DDRPHYC_GPR1</displayName>
            <description>DDRPHYC general purpose register 1 </description>
            <addressOffset>0x17c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>GPR1</name>
                <description>General purpose register 1 bits</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRPHYC_ZQ0CR0</name>
            <displayName>DDRPHYC_ZQ0CR0</displayName>
            <description>DDRPHYC ZQ0C register 0 </description>
            <addressOffset>0x180</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000014A</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ZDATA</name>
                <description>Impedance override
Impedance Over-Ride Data: Data used to directly drive the impedance control.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ZDEN</name>
                <description>Impedance override enable
Impedance Over-ride Enable: When this bit is set, it allows users to directly drive the impedance control using the data programmed in the ZQDATA field. Otherwise, the control is generated automatically by the impedance control logic.
Note: If ZDEN is set, then the ZCAL bit should be set to 0.</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ZCALBYP</name>
                <description>Impedance calibration bypass
Impedance Calibration Bypass: Disables, if set, impedance calibration of this ZQ control block when impedance calibration is triggered globally using the ZCAL bit of DDRPHYC_PIR.
Impedance calibration of this ZQ block may be triggered manually using ZCAL.</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ZCAL</name>
                <description>ZCAL trigger
Impedance Calibration Trigger: A write of '1' to this bit triggers impedance calibration to be performed by the impedance control logic.
The impedance calibration trigger bit is self-clearing and returns back to '0' when the calibration is complete.
Note: If ZDEN is set, then the ZCAL bit should be set to 0.</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ZQPD</name>
                <description>ZCAL power down
Powers down, if set, the PZQ cell.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRPHYC_ZQ0CR1</name>
            <displayName>DDRPHYC_ZQ0CR1</displayName>
            <description>DDRPHYC ZQ0CR1 register </description>
            <addressOffset>0x184</addressOffset>
            <size>8</size>
            <resetValue>0x0000007B</resetValue>
            <resetMask>0x000000FF</resetMask>
            <fields>
              <field>
                <name>ZPROG</name>
                <description>Impedance divide ratio to ext R
Impedance divide ratio: selects the external resistor divide ratio to be used to set the output impedance and the on-die termination as follows:
null  +/-1%)
- 0x0: Reserved
- 0x1: 120 
- 0x2: 96 
- 0x3: 80 
- 0x4: 69 
- 0x5: 60 
- 0x6: 52
- 0x7: 46 
- 0x8: 40 
- 0x9: 37 
- 0xA: 34 
- 0xB: 32 
- 0xC: 30 
- 0xD: 28 
- 0xE: 26.5 
- 0xF: 25 
nullImpedance divide ratio to ext R
Impedance divide ratio: selects the external resistor divide ratio to be used to set the output impedance and the on-die termination as follows:
null  +/-1%)
- 0x0 to 0x4: Reserved
- 0x5: 80 
- 0x6: 69 
- 0x7: 60 
- 0x8: 53 
- 0x9: 48 
- 0xA: 44 
- 0xB: 40 
- 0xC: 37 
- 0xD: 34 
- 0xE: 32 
- 0xF: 30 </description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRPHYC_ZQ0SR0</name>
            <displayName>DDRPHYC_ZQ0SR0</displayName>
            <description>DDRPHYC ZQ0S register 0 </description>
            <addressOffset>0x188</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000014A</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ZCTRL</name>
                <description>Impedance control
Impedance Control: Current value of impedance control.
ZZCTRL field mapping for D3R I/Os is as follows:
ZCTRL[27:20] is reserved and returns zeros on reads
ZCTRL[19:15] is used to select the pull-up on-die termination impedance
ZCTRL[14:10] is used to select the pull-down on-die termination impedance
ZCTRL[9:5] is used to select the pull-up output impedance
ZCTRL[4:0] is used to select the pull-down output impedance</description>
                <bitOffset>0</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ZERR</name>
                <description>Impedance calibration error
If set, indicates that there was an error during impedance calibration.</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ZDONE</name>
                <description>Impedance calibration done
Indicates that impedance calibration has completed.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DDRPHYC_ZQ0SR1</name>
            <displayName>DDRPHYC_ZQ0SR1</displayName>
            <description>DDRPHYC ZQ0S register 1 </description>
            <addressOffset>0x18c</addressOffset>
            <size>8</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x000000FF</resetMask>
            <fields>
              <field>
                <name>ZPD</name>
                <description>zpd calibration status
Output impedance pull-down calibration status. Valid status encodings are:</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Completed with no errors</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Overflow error</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>Underflow error</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>Calibration in progress</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ZPU</name>
                <description>zpu calibration status
Output impedance pull-up calibration status. Valid status encodings are:</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Completed with no errors</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Overflow error</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>Underflow error</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>Calibration in progress</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OPD</name>
                <description>opd calibration status
On-Die termination (ODT) pull-down calibration status.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Completed with no errors</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Overflow error</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>Underflow error</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>Calibration in progress</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OPU</name>
                <description>opu calibration status
On-Die termination (ODT) pull-up calibration status.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Completed with no errors</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Overflow error</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>Underflow error</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>Calibration in progress</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
