STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>DFSDM_FLT1AWCFR</name>
            <displayName>DFSDM_FLT1AWCFR</displayName>
            <addressOffset>0x1ac</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CLRAWLTF</name>
                <description>Clear the analog watchdog low threshold flag
CLRAWLTF[y]=0: Writing '0 has no effect
CLRAWLTF[y]=1: Writing '1 to position y clears the corresponding AWLTF[y] bit in the DFSDM_FLTxAWSR register</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CLRAWHTF</name>
                <description>Clear the analog watchdog high threshold flag
CLRAWHTF[y]=0: Writing '0 has no effect
CLRAWHTF[y]=1: Writing '1 to position y clears the corresponding AWHTF[y] bit in the DFSDM_FLTxAWSR register</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DFSDM_FLT1EXMAX</name>
            <displayName>DFSDM_FLT1EXMAX</displayName>
            <addressOffset>0x1b0</addressOffset>
            <size>0x20</size>
            <resetValue>0x80000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EXMAXCH</name>
                <description>Extremes detector maximum data channel.
These bits contains information about the channel on which the data is stored into EXMAX[23:0]. Bits are cleared by reading of this register.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>EXMAX</name>
                <description>Extremes detector maximum value
These bits are set by hardware and indicate the highest value converted by DFSDM_FLTx. EXMAX[23:0] bits are reset to value (0x800000) by reading of this register.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>24</bitWidth>
                <access>read-only</access>
                <readAction>set</readAction>
              </field>
            </fields>
          </register>
          <register>
            <name>DFSDM_FLT1EXMIN</name>
            <displayName>DFSDM_FLT1EXMIN</displayName>
            <addressOffset>0x1b4</addressOffset>
            <size>0x20</size>
            <resetValue>0x7FFFFF00</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EXMINCH</name>
                <description>Extremes detector minimum data channel
These bits contain information about the channel on which the data is stored into EXMIN[23:0]. Bits are cleared by reading of this register.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>EXMIN</name>
                <description>Extremes detector minimum value
These bits are set by hardware and indicate the lowest value converted by DFSDM_FLTx. EXMIN[23:0] bits are reset to value (0x7FFFFF) by reading of this register.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>24</bitWidth>
                <access>read-write</access>
                <readAction>clear</readAction>
              </field>
            </fields>
          </register>
          <register>
            <name>DFSDM_FLT1CNVTIMR</name>
            <displayName>DFSDM_FLT1CNVTIMR</displayName>
            <addressOffset>0x1b8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CNVCNT</name>
                <description>28-bit timer counting conversion time t = CNVCNT[27:0] / fDFSDMCLK
The timer has an input clock from DFSDM clock (system clock fDFSDMCLK). Conversion time measurement is started on each conversion start and stopped when conversion finishes (interval between first and last serial sample). Only in case of filter bypass (FOSR[9:0] = 0) is the conversion time measurement stopped and CNVCNT[27:0] = 0. The counted time is:
if FAST=0 (or first conversion in continuous mode if FAST=1):
t = [FOSR * (IOSR-1 + FORD) + FORD] / fCKIN	..... for Sincx filters
t = [FOSR * (IOSR-1 + 4) + 2] / fCKIN	..... for FastSinc filter
if FAST=1 in continuous mode (except first conversion):
t = [FOSR * IOSR] / fCKIN
in case if FOSR = FOSR[9:0]+1 = 1 (filter bypassed, active only integrator):
CNVCNT = 0 (counting is stopped, conversion time: t = IOSR / fCKIN)
where: fCKIN is the channel input clock frequency (on given channel CKINy pin) or input data rate in case of parallel data input (from internal ADC or from CPU/DMA write)
Note: When conversion is interrupted (e.g. by disable/enable selected channel) the timer counts also this interruption time.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>28</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DFSDM_HWCFGR</name>
            <displayName>DFSDM_HWCFGR</displayName>
            <description>DFSDM hardware configuration register </description>
            <addressOffset>0x7f0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000204</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>NBT</name>
                <description>Number of implemented transceivers
Defines how many transceivers (input channels) are implemented in DFSDM peripheral.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>NBF</name>
                <description>Number of implemented filters
Defines how many filters are implemented in DFSDM peripheral.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DFSDM_VERR</name>
            <displayName>DFSDM_VERR</displayName>
            <description>DFSDM version register </description>
            <addressOffset>0x7f4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000021</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MINREV</name>
                <description>Minor revision of the DFSDM peripheral
These bits return the DFSDM minor revision (in range 0..15).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>MAJREV</name>
                <description>Major revision of the DFSDM peripheral
These bits return the DFSDM major revision (in range 0..15).</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DFSDM_IPIDR</name>
            <displayName>DFSDM_IPIDR</displayName>
            <description>DFSDM identification register </description>
            <addressOffset>0x7f8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00110031</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ID</name>
                <description>Peripheral identifier
Bits [31:0]: these bits returns the DFSDM identifier ID[31:0] = 0x0011 0031</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DFSDM_SIDR</name>
            <displayName>DFSDM_SIDR</displayName>
            <description>DFSDM size identification register </description>
            <addressOffset>0x7fc</addressOffset>
            <size>0x20</size>
            <resetValue>0xA3C5DD02</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SID</name>
                <description>Size identification of DFSDM peripheral
Bits [31:8]: fixed code = 0xA3C5DD
Bits [7:0]: these bits returns the size of the memory region allocated to DFSDM registers.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>2KB allocated by DFSDM peripheral (fixed value).</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
