STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>ETH_MACHWF1R</name>
            <displayName>ETH_MACHWF1R</displayName>
            <description>HW feature 1 register </description>
            <addressOffset>0x120</addressOffset>
            <size>0x20</size>
            <resetValue>0x11041904</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RXFIFOSIZE</name>
                <description>MTL Receive FIFO Size
This field contains the configured value of MTL Rx FIFO in bytes expressed as Log to base 2 minus 7, that is, Log2(RXFIFO_SIZE) -7:</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>128 bytes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>256 bytes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>512 bytes</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>1,024 bytes</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>2,048 bytes</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x5</name>
                    <description>4,096 bytes</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x6</name>
                    <description>8,192 bytes</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7</name>
                    <description>16,384 bytes</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x8</name>
                    <description>32 Kbytes</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x9</name>
                    <description>64 Kbytes</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xA</name>
                    <description>128 Kbytes</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xB</name>
                    <description>256 Kbytes</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xc</name>
                    <description>Reserved, must not be used</description>
                    <value>0xc</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xd</name>
                    <description>Reserved, must not be used</description>
                    <value>0xd</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xe</name>
                    <description>Reserved, must not be used</description>
                    <value>0xe</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xf</name>
                    <description>Reserved, must not be used</description>
                    <value>0xf</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x10</name>
                    <description>Reserved, must not be used</description>
                    <value>0x10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x11</name>
                    <description>Reserved, must not be used</description>
                    <value>0x11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x12</name>
                    <description>Reserved, must not be used</description>
                    <value>0x12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x13</name>
                    <description>Reserved, must not be used</description>
                    <value>0x13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x14</name>
                    <description>Reserved, must not be used</description>
                    <value>0x14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x15</name>
                    <description>Reserved, must not be used</description>
                    <value>0x15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x16</name>
                    <description>Reserved, must not be used</description>
                    <value>0x16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x17</name>
                    <description>Reserved, must not be used</description>
                    <value>0x17</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x18</name>
                    <description>Reserved, must not be used</description>
                    <value>0x18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x19</name>
                    <description>Reserved, must not be used</description>
                    <value>0x19</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1a</name>
                    <description>Reserved, must not be used</description>
                    <value>0x1a</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1b</name>
                    <description>Reserved, must not be used</description>
                    <value>0x1b</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1c</name>
                    <description>Reserved, must not be used</description>
                    <value>0x1c</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1d</name>
                    <description>Reserved, must not be used</description>
                    <value>0x1d</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1e</name>
                    <description>Reserved, must not be used</description>
                    <value>0x1e</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1f</name>
                    <description>Reserved, must not be used</description>
                    <value>0x1f</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TXFIFOSIZE</name>
                <description>MTL Transmit FIFO Size
This field contains the configured value of MTL Tx FIFO in bytes expressed as Log to base 2 minus 7, that is, Log2(TXFIFO_SIZE) -7:</description>
                <bitOffset>6</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>128 bytes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>256 bytes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>512 bytes</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>1,024 bytes</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>2,048 bytes</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x5</name>
                    <description>4,096 bytes</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x6</name>
                    <description>8,192 bytes</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7</name>
                    <description>16,384 bytes</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x8</name>
                    <description>32 Kbytes</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x9</name>
                    <description>64 Kbytes</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xA</name>
                    <description>128 Kbytes</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xb</name>
                    <description>Reserved, must not be used</description>
                    <value>0xb</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xc</name>
                    <description>Reserved, must not be used</description>
                    <value>0xc</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xd</name>
                    <description>Reserved, must not be used</description>
                    <value>0xd</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xe</name>
                    <description>Reserved, must not be used</description>
                    <value>0xe</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xf</name>
                    <description>Reserved, must not be used</description>
                    <value>0xf</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x10</name>
                    <description>Reserved, must not be used</description>
                    <value>0x10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x11</name>
                    <description>Reserved, must not be used</description>
                    <value>0x11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x12</name>
                    <description>Reserved, must not be used</description>
                    <value>0x12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x13</name>
                    <description>Reserved, must not be used</description>
                    <value>0x13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x14</name>
                    <description>Reserved, must not be used</description>
                    <value>0x14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x15</name>
                    <description>Reserved, must not be used</description>
                    <value>0x15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x16</name>
                    <description>Reserved, must not be used</description>
                    <value>0x16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x17</name>
                    <description>Reserved, must not be used</description>
                    <value>0x17</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x18</name>
                    <description>Reserved, must not be used</description>
                    <value>0x18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x19</name>
                    <description>Reserved, must not be used</description>
                    <value>0x19</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1a</name>
                    <description>Reserved, must not be used</description>
                    <value>0x1a</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1b</name>
                    <description>Reserved, must not be used</description>
                    <value>0x1b</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1c</name>
                    <description>Reserved, must not be used</description>
                    <value>0x1c</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1d</name>
                    <description>Reserved, must not be used</description>
                    <value>0x1d</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1e</name>
                    <description>Reserved, must not be used</description>
                    <value>0x1e</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1f</name>
                    <description>Reserved, must not be used</description>
                    <value>0x1f</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OSTEN</name>
                <description>One-Step Timestamping Enable
This bit is set to 1 when the Enable One-Step Timestamp Feature is selected.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PTOEN</name>
                <description>PTP Offload Enable
This bit is set to 1 when the Enable PTP Timestamp Offload Feature is selected.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ADVTHWORD</name>
                <description>IEEE 1588 High Word Register Enable
This bit is set to 1 when the Add IEEE 1588 Higher Word Register option is selected</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ADDR64</name>
                <description>Address width
This field indicates the configured address width.
Others: Reserved, must not be used</description>
                <bitOffset>14</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>32 bits</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DCBEN</name>
                <description>DCB Feature Enable
This bit is set to 1 when the Enable Data Center Bridging option is selected</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>SPHEN</name>
                <description>Split Header Feature Enable
This bit is set to 1 when the Enable Split Header Structure option is selected</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>TSOEN</name>
                <description>TCP Segmentation Offload Enable
This bit is set to 1 when the Enable TCP Segmentation Offloading for TCP/IP Packets option is selected</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DBGMEMA</name>
                <description>DMA Debug Registers Enable
This bit is set to 1 when the Debug Mode Enable option is selected</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AVSEL</name>
                <description>AV Feature Enable
This bit is set to 1 when the Enable Audio Video Bridging option is selected.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>HASHTBLSZ</name>
                <description>Hash Table Size
This field indicates the size of the Hash table:</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No Hash table</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>64</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>128</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>256</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>L3L4FNUM</name>
                <description>Total number of L3 or L4 Filters
This field indicates the total number of L3 or L4 filters:
..</description>
                <bitOffset>27</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No L3 or L4 Filter</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>1 L3 or L4 Filter</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>2 L3 or L4 Filters</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x8</name>
                    <description>8 L3 or L4</description>
                    <value>0x8</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
