STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
        <register>
          <name>FMC_HWCFGR2</name>
          <displayName>FMC_HWCFGR2</displayName>
          <description>FMC Hardware configuration register 2</description>
          <addressOffset>0x3EC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00DC8762</resetValue>
          <fields>
            <field>
              <name>RD_LN2DPTH</name>
              <description>RD_LN2DPTH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>NOR_BASE</name>
              <description>NOR_BASE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SDRAM_RBASE</name>
              <description>SDRAM_RBASE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>NAND_BASE</name>
              <description>NAND_BASE</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SDRAM1_BASE</name>
              <description>SDRAM1_BASE</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SDRAM2_BASE</name>
              <description>SDRAM2_BASE</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC_HWCFGR1</name>
          <displayName>FMC_HWCFGR1</displayName>
          <description>FMC Hardware configuration register 1</description>
          <addressOffset>0x3F0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x2232B011</resetValue>
          <fields>
            <field>
              <name>NAND_SEL</name>
              <description>NAND_SEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NAND_ECC</name>
              <description>NAND_ECC</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDRAM_SEL</name>
              <description>SDRAM_SEL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID_SIZE</name>
              <description>ID_SIZE</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>WA_LN2DPTH</name>
              <description>WA_LN2DPTH</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>WD_LN2DPTH</name>
              <description>WD_LN2DPTH</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>WR_LN2DPTH</name>
              <description>WR_LN2DPTH</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RA_LN2DPTH</name>
              <description>RA_LN2DPTH</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC_VERR</name>
          <displayName>FMC_VERR</displayName>
          <description>FMC Version register</description>
          <addressOffset>0x3F4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000011</resetValue>
          <fields>
            <field>
              <name>MINREV</name>
              <description>MINREV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MAJREV</name>
              <description>MAJREV</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC_IPIDR</name>
          <displayName>FMC_IPIDR</displayName>
          <description>FMC Identification register</description>
          <addressOffset>0x3F8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00140001</resetValue>
          <fields>
            <field>
              <name>ID</name>
              <description>ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC_SIDR</name>
          <displayName>FMC_SIDR</displayName>
          <description>FMC Size Identification register</description>
          <addressOffset>0x3FC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0xA3C5DD01</resetValue>
          <fields>
            <field>
              <name>SID</name>
              <description>SID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
	<peripheral>
        <name>GICD</name>
        <description>GICD address block description</description>
        <groupName>GIC</groupName>
		<baseAddress>0xA0021000</baseAddress>
		<addressBlock>
          <offset>0x0</offset>
          <size>0x1000</size>
          <usage>registers</usage>
        </addressBlock>
        <registers>
          <register>
            <name>GICD_CTLR</name>
            <displayName>GICD_CTLR</displayName>
			<description>GICD_CTLR</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ENABLEGRP0</name>
                <description>enable group 1 interrupts
Global enable for forwarding pending group 1 interrupts from the GICD to the CPU interfaces</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLEGRP1</name>
                <description>enable group 1 interrupts
Global enable for forwarding pending group 1 interrupts from the GICD to the CPU interfaces</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
		  <register>
            <name>GICD_CTLRNS</name>
            <displayName>GICD_CTLRNS</displayName>
			<description>GICD_CTLRNS</description>
			<alternateRegister>GICD_CTLR</alternateRegister>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ENABLE</name>
                <description>Global enable for forwarding pending group 1 interrupts from the GICD to the CPU interfaces</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLEGRP1</name>
                <description>enable group 1 interrupts
Global enable for forwarding pending group 1 interrupts from the GICD to the CPU interfaces</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_TYPER</name>
            <displayName>GICD_TYPER</displayName>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000FC05</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ITLINESNUMBER</name>
                <description>number of interrupt lines
Indicates the number of interrupts that the GIC supports (0b00101 = Up to 192 interrupts, 160 external interrupts)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPUNUMBER</name>
                <description>number of processors interfaces
Indicates the number of implemented processors interfaces in the GIC (0b000 = 1 processor)</description>
                <bitOffset>5</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>SECURITYEXTN</name>
                <description>security extension
Indicates whether the GIC implements the security extensions. This bit always returns a value of 1, indicating that the security extensions are implemented.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>LSPI</name>
                <description>lockable shared peripheral interrupt
Returns the number of LSPIs that the interrupt controller contains (0b1111 = 31 LSPIs, these are the interrupts of IDs 32-62).</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IIDR</name>
            <displayName>GICD_IIDR</displayName>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <resetValue>0x0100143B</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>IMPLEMENTER</name>
                <description>GIC implementer (0x43B Arm implementation)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>REVISION</name>
                <description>Indicates the minor revision number of the GIC</description>
                <bitOffset>12</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>VARIANT</name>
                <description>Indicates the major revision number of the GIC</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PRODUCTID</name>
                <description>product ID of the GIC</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IGROUPR0</name>
            <displayName>GICD_IGROUPR0</displayName>
            <description>GICD interrupt group register 0</description>
            <addressOffset>0x80</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>IGROUPRx</name>
                <description>group of interrupts</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IGROUPR1</name>
            <displayName>GICD_IGROUPR1</displayName>
            <description>GICD interrupt group register 1</description>
            <addressOffset>0x84</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>IGROUPRx</name>
                <description>group of interrupts</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IGROUPR2</name>
            <displayName>GICD_IGROUPR2</displayName>
            <description>GICD interrupt group register 2</description>
            <addressOffset>0x88</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>IGROUPRx</name>
                <description>group of interrupts</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IGROUPR3</name>
            <displayName>GICD_IGROUPR3</displayName>
            <description>GICD interrupt group register 3</description>
            <addressOffset>0x8c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>IGROUPRx</name>
                <description>group of interrupts</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IGROUPR4</name>
            <displayName>GICD_IGROUPR4</displayName>
            <description>GICD interrupt group register 4</description>
            <addressOffset>0x90</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>IGROUPRx</name>
                <description>group of interrupts</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IGROUPR5</name>
            <displayName>GICD_IGROUPR5</displayName>
            <description>GICD interrupt group register 5</description>
            <addressOffset>0x94</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>IGROUPRx</name>
                <description>group of interrupts</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ISENABLER0</name>
            <displayName>GICD_ISENABLER0</displayName>
            <description>GICD interrupt set-enable register </description>
            <addressOffset>0x100</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ISENABLER0</name>
                <description>interrupt set-enable 0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ISENABLER1</name>
            <displayName>GICD_ISENABLER1</displayName>
            <description>GICD interrupt set-enable register 1</description>
            <addressOffset>0x104</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ISENABLERx</name>
                <description>interrupt set-enable x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ISENABLER2</name>
            <displayName>GICD_ISENABLER2</displayName>
            <description>GICD interrupt set-enable register 2</description>
            <addressOffset>0x108</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ISENABLERx</name>
                <description>interrupt set-enable x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ISENABLER3</name>
            <displayName>GICD_ISENABLER3</displayName>
            <description>GICD interrupt set-enable register 3</description>
            <addressOffset>0x10c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ISENABLERx</name>
                <description>interrupt set-enable x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ISENABLER4</name>
            <displayName>GICD_ISENABLER4</displayName>
            <description>GICD interrupt set-enable register 4</description>
            <addressOffset>0x110</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ISENABLERx</name>
                <description>interrupt set-enable x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ISENABLER5</name>
            <displayName>GICD_ISENABLER5</displayName>
            <description>GICD interrupt set-enable register 5</description>
            <addressOffset>0x114</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ISENABLERx</name>
                <description>interrupt set-enable x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ICENABLER0</name>
            <displayName>GICD_ICENABLER0</displayName>
            <description>GICD interrupt clear-enable register </description>
            <addressOffset>0x180</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ICENABLER0</name>
                <description>interrupt clear-enable 0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ICENABLER1</name>
            <displayName>GICD_ICENABLER1</displayName>
            <description>GICD interrupt clear-enable register 1</description>
            <addressOffset>0x184</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ICENABLERx</name>
                <description>interrupt clear-enable x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ICENABLER2</name>
            <displayName>GICD_ICENABLER2</displayName>
            <description>GICD interrupt clear-enable register 2</description>
            <addressOffset>0x188</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ICENABLERx</name>
                <description>interrupt clear-enable x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ICENABLER3</name>
            <displayName>GICD_ICENABLER3</displayName>
            <description>GICD interrupt clear-enable register 3</description>
            <addressOffset>0x18c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ICENABLERx</name>
                <description>interrupt clear-enable x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ICENABLER4</name>
            <displayName>GICD_ICENABLER4</displayName>
            <description>GICD interrupt clear-enable register 4</description>
            <addressOffset>0x190</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ICENABLERx</name>
                <description>interrupt clear-enable x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
