STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>GICD_ICENABLER5</name>
            <displayName>GICD_ICENABLER5</displayName>
            <description>GICD interrupt clear-enable register 5</description>
            <addressOffset>0x194</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ICENABLERx</name>
                <description>interrupt clear-enable x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ISPENDR0</name>
            <displayName>GICD_ISPENDR0</displayName>
            <description>GICD interrupt set-pending register 0</description>
            <addressOffset>0x200</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ISPENDRx</name>
                <description>interrupt set-pending x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ISPENDR1</name>
            <displayName>GICD_ISPENDR1</displayName>
            <description>GICD interrupt set-pending register 1</description>
            <addressOffset>0x204</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ISPENDRx</name>
                <description>interrupt set-pending x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ISPENDR2</name>
            <displayName>GICD_ISPENDR2</displayName>
            <description>GICD interrupt set-pending register 2</description>
            <addressOffset>0x208</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ISPENDRx</name>
                <description>interrupt set-pending x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ISPENDR3</name>
            <displayName>GICD_ISPENDR3</displayName>
            <description>GICD interrupt set-pending register 3</description>
            <addressOffset>0x20c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ISPENDRx</name>
                <description>interrupt set-pending x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ISPENDR4</name>
            <displayName>GICD_ISPENDR4</displayName>
            <description>GICD interrupt set-pending register 4</description>
            <addressOffset>0x210</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ISPENDRx</name>
                <description>interrupt set-pending x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ISPENDR5</name>
            <displayName>GICD_ISPENDR5</displayName>
            <description>GICD interrupt set-pending register 5</description>
            <addressOffset>0x214</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ISPENDRx</name>
                <description>interrupt set-pending x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ICPENDR0</name>
            <displayName>GICD_ICPENDR0</displayName>
            <description>GICD interrupt clear-pending register 0</description>
            <addressOffset>0x280</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ICPENDRx</name>
                <description>interrupt clear-pending x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ICPENDR1</name>
            <displayName>GICD_ICPENDR1</displayName>
            <description>GICD interrupt clear-pending register 1</description>
            <addressOffset>0x284</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ICPENDRx</name>
                <description>interrupt clear-pending x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ICPENDR2</name>
            <displayName>GICD_ICPENDR2</displayName>
            <description>GICD interrupt clear-pending register 2</description>
            <addressOffset>0x288</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ICPENDRx</name>
                <description>interrupt clear-pending x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ICPENDR3</name>
            <displayName>GICD_ICPENDR3</displayName>
            <description>GICD interrupt clear-pending register 3</description>
            <addressOffset>0x28c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ICPENDRx</name>
                <description>interrupt clear-pending x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ICPENDR4</name>
            <displayName>GICD_ICPENDR4</displayName>
            <description>GICD interrupt clear-pending register 4</description>
            <addressOffset>0x290</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ICPENDRx</name>
                <description>interrupt clear-pending x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ICPENDR5</name>
            <displayName>GICD_ICPENDR5</displayName>
            <description>GICD interrupt clear-pending register 5</description>
            <addressOffset>0x294</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ICPENDRx</name>
                <description>interrupt clear-pending x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ISACTIVER0</name>
            <displayName>GICD_ISACTIVER0</displayName>
            <description>GICD interrupt set-active register 0</description>
            <addressOffset>0x300</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ISACTIVERx</name>
                <description>interrupt set-active x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ISACTIVER1</name>
            <displayName>GICD_ISACTIVER1</displayName>
            <description>GICD interrupt set-active register 1</description>
            <addressOffset>0x304</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ISACTIVERx</name>
                <description>interrupt set-active x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ISACTIVER2</name>
            <displayName>GICD_ISACTIVER2</displayName>
            <description>GICD interrupt set-active register 2</description>
            <addressOffset>0x308</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ISACTIVERx</name>
                <description>interrupt set-active x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ISACTIVER3</name>
            <displayName>GICD_ISACTIVER3</displayName>
            <description>GICD interrupt set-active register 3</description>
            <addressOffset>0x30c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ISACTIVERx</name>
                <description>interrupt set-active x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ISACTIVER4</name>
            <displayName>GICD_ISACTIVER4</displayName>
            <description>GICD interrupt set-active register 4</description>
            <addressOffset>0x310</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ISACTIVERx</name>
                <description>interrupt set-active x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ISACTIVER5</name>
            <displayName>GICD_ISACTIVER5</displayName>
            <description>GICD interrupt set-active register 5</description>
            <addressOffset>0x314</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ISACTIVERx</name>
                <description>interrupt set-active x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ICACTIVER0</name>
            <displayName>GICD_ICACTIVER0</displayName>
            <description>GICD interrupt clear-active register 0</description>
            <addressOffset>0x380</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ICACTIVERx</name>
                <description>interrupt clear-active x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ICACTIVER1</name>
            <displayName>GICD_ICACTIVER1</displayName>
            <description>GICD interrupt clear-active register 1</description>
            <addressOffset>0x384</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ICACTIVERx</name>
                <description>interrupt clear-active x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ICACTIVER2</name>
            <displayName>GICD_ICACTIVER2</displayName>
            <description>GICD interrupt clear-active register 2</description>
            <addressOffset>0x388</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ICACTIVERx</name>
                <description>interrupt clear-active x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ICACTIVER3</name>
            <displayName>GICD_ICACTIVER3</displayName>
            <description>GICD interrupt clear-active register 3</description>
            <addressOffset>0x38c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ICACTIVERx</name>
                <description>interrupt clear-active x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ICACTIVER4</name>
            <displayName>GICD_ICACTIVER4</displayName>
            <description>GICD interrupt clear-active register 4</description>
            <addressOffset>0x390</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ICACTIVERx</name>
                <description>interrupt clear-active x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ICACTIVER5</name>
            <displayName>GICD_ICACTIVER5</displayName>
            <description>GICD interrupt clear-active register 5</description>
            <addressOffset>0x394</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ICACTIVERx</name>
                <description>interrupt clear-active x</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR0</name>
            <displayName>GICD_IPRIORITYR0</displayName>
            <addressOffset>0x400</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR1</name>
            <displayName>GICD_IPRIORITYR1</displayName>
            <addressOffset>0x404</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR2</name>
            <displayName>GICD_IPRIORITYR2</displayName>
            <addressOffset>0x408</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR3</name>
            <displayName>GICD_IPRIORITYR3</displayName>
            <addressOffset>0x40c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
