STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>GICD_IPRIORITYR4</name>
            <displayName>GICD_IPRIORITYR4</displayName>
            <addressOffset>0x410</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR5</name>
            <displayName>GICD_IPRIORITYR5</displayName>
            <addressOffset>0x414</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR6</name>
            <displayName>GICD_IPRIORITYR6</displayName>
            <addressOffset>0x418</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR7</name>
            <displayName>GICD_IPRIORITYR7</displayName>
            <addressOffset>0x41c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR8</name>
            <displayName>GICD_IPRIORITYR8</displayName>
            <addressOffset>0x420</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR9</name>
            <displayName>GICD_IPRIORITYR9</displayName>
            <addressOffset>0x424</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR10</name>
            <displayName>GICD_IPRIORITYR10</displayName>
            <addressOffset>0x428</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR11</name>
            <displayName>GICD_IPRIORITYR11</displayName>
            <addressOffset>0x42c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR12</name>
            <displayName>GICD_IPRIORITYR12</displayName>
            <addressOffset>0x430</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR13</name>
            <displayName>GICD_IPRIORITYR13</displayName>
            <addressOffset>0x434</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR14</name>
            <displayName>GICD_IPRIORITYR14</displayName>
            <addressOffset>0x438</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR15</name>
            <displayName>GICD_IPRIORITYR15</displayName>
            <addressOffset>0x43c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR16</name>
            <displayName>GICD_IPRIORITYR16</displayName>
            <addressOffset>0x440</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR17</name>
            <displayName>GICD_IPRIORITYR17</displayName>
            <addressOffset>0x444</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR18</name>
            <displayName>GICD_IPRIORITYR18</displayName>
            <addressOffset>0x448</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
