STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>GICD_IPRIORITYR19</name>
            <displayName>GICD_IPRIORITYR19</displayName>
            <addressOffset>0x44c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR20</name>
            <displayName>GICD_IPRIORITYR20</displayName>
            <addressOffset>0x450</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR21</name>
            <displayName>GICD_IPRIORITYR21</displayName>
            <addressOffset>0x454</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR22</name>
            <displayName>GICD_IPRIORITYR22</displayName>
            <addressOffset>0x458</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR23</name>
            <displayName>GICD_IPRIORITYR23</displayName>
            <addressOffset>0x45c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR24</name>
            <displayName>GICD_IPRIORITYR24</displayName>
            <addressOffset>0x460</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR25</name>
            <displayName>GICD_IPRIORITYR25</displayName>
            <addressOffset>0x464</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR26</name>
            <displayName>GICD_IPRIORITYR26</displayName>
            <addressOffset>0x468</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR27</name>
            <displayName>GICD_IPRIORITYR27</displayName>
            <addressOffset>0x46c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR28</name>
            <displayName>GICD_IPRIORITYR28</displayName>
            <addressOffset>0x470</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR29</name>
            <displayName>GICD_IPRIORITYR29</displayName>
            <addressOffset>0x474</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR30</name>
            <displayName>GICD_IPRIORITYR30</displayName>
            <addressOffset>0x478</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR31</name>
            <displayName>GICD_IPRIORITYR31</displayName>
            <addressOffset>0x47c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR32</name>
            <displayName>GICD_IPRIORITYR32</displayName>
            <addressOffset>0x480</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR33</name>
            <displayName>GICD_IPRIORITYR33</displayName>
            <addressOffset>0x484</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
