STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>GICD_IPRIORITYR34</name>
            <displayName>GICD_IPRIORITYR34</displayName>
            <addressOffset>0x488</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR35</name>
            <displayName>GICD_IPRIORITYR35</displayName>
            <addressOffset>0x48c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR36</name>
            <displayName>GICD_IPRIORITYR36</displayName>
            <addressOffset>0x490</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR37</name>
            <displayName>GICD_IPRIORITYR37</displayName>
            <addressOffset>0x494</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR38</name>
            <displayName>GICD_IPRIORITYR38</displayName>
            <addressOffset>0x498</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR39</name>
            <displayName>GICD_IPRIORITYR39</displayName>
            <addressOffset>0x49c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR40</name>
            <displayName>GICD_IPRIORITYR40</displayName>
            <addressOffset>0x4a0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR41</name>
            <displayName>GICD_IPRIORITYR41</displayName>
            <addressOffset>0x4a4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR42</name>
            <displayName>GICD_IPRIORITYR42</displayName>
            <addressOffset>0x4a8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR43</name>
            <displayName>GICD_IPRIORITYR43</displayName>
            <addressOffset>0x4ac</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR44</name>
            <displayName>GICD_IPRIORITYR44</displayName>
            <addressOffset>0x4b0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR45</name>
            <displayName>GICD_IPRIORITYR45</displayName>
            <addressOffset>0x4b4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR46</name>
            <displayName>GICD_IPRIORITYR46</displayName>
            <addressOffset>0x4b8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_IPRIORITYR47</name>
            <displayName>GICD_IPRIORITYR47</displayName>
            <addressOffset>0x4bc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY0</name>
                <description>priority for interrupt ID = x * 4</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY1</name>
                <description>priority for interrupt ID = x * 4 + 1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY2</name>
                <description>priority for interrupt ID = x * 4 + 2</description>
                <bitOffset>19</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIORITY3</name>
                <description>priority for interrupt ID = x * 4 + 3</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR0</name>
            <displayName>GICD_ITARGETSR0</displayName>
            <description>GICD interrupt processor target register 0</description>
            <addressOffset>0x800</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
