STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>GICD_ITARGETSR1</name>
            <displayName>GICD_ITARGETSR1</displayName>
            <description>GICD interrupt processor target register 1</description>
            <addressOffset>0x804</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR2</name>
            <displayName>GICD_ITARGETSR2</displayName>
            <description>GICD interrupt processor target register 2</description>
            <addressOffset>0x808</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR3</name>
            <displayName>GICD_ITARGETSR3</displayName>
            <description>GICD interrupt processor target register 3</description>
            <addressOffset>0x80c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR4</name>
            <displayName>GICD_ITARGETSR4</displayName>
            <description>GICD interrupt processor target register 4</description>
            <addressOffset>0x810</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR5</name>
            <displayName>GICD_ITARGETSR5</displayName>
            <description>GICD interrupt processor target register 5</description>
            <addressOffset>0x814</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR6</name>
            <displayName>GICD_ITARGETSR6</displayName>
            <description>GICD interrupt processor target register 6</description>
            <addressOffset>0x818</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR7</name>
            <displayName>GICD_ITARGETSR7</displayName>
            <description>GICD interrupt processor target register 7</description>
            <addressOffset>0x81c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR8</name>
            <displayName>GICD_ITARGETSR8</displayName>
            <addressOffset>0x820</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR9</name>
            <displayName>GICD_ITARGETSR9</displayName>
            <addressOffset>0x824</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR10</name>
            <displayName>GICD_ITARGETSR10</displayName>
            <addressOffset>0x828</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR11</name>
            <displayName>GICD_ITARGETSR11</displayName>
            <addressOffset>0x82c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR12</name>
            <displayName>GICD_ITARGETSR12</displayName>
            <addressOffset>0x830</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR13</name>
            <displayName>GICD_ITARGETSR13</displayName>
            <addressOffset>0x834</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR14</name>
            <displayName>GICD_ITARGETSR14</displayName>
            <addressOffset>0x838</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR15</name>
            <displayName>GICD_ITARGETSR15</displayName>
            <addressOffset>0x83c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
