STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>GICD_ITARGETSR16</name>
            <displayName>GICD_ITARGETSR16</displayName>
            <addressOffset>0x840</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR17</name>
            <displayName>GICD_ITARGETSR17</displayName>
            <addressOffset>0x844</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR18</name>
            <displayName>GICD_ITARGETSR18</displayName>
            <addressOffset>0x848</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR19</name>
            <displayName>GICD_ITARGETSR19</displayName>
            <addressOffset>0x84c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR20</name>
            <displayName>GICD_ITARGETSR20</displayName>
            <addressOffset>0x850</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR21</name>
            <displayName>GICD_ITARGETSR21</displayName>
            <addressOffset>0x854</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR22</name>
            <displayName>GICD_ITARGETSR22</displayName>
            <addressOffset>0x858</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR23</name>
            <displayName>GICD_ITARGETSR23</displayName>
            <addressOffset>0x85c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR24</name>
            <displayName>GICD_ITARGETSR24</displayName>
            <addressOffset>0x860</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR25</name>
            <displayName>GICD_ITARGETSR25</displayName>
            <addressOffset>0x864</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR26</name>
            <displayName>GICD_ITARGETSR26</displayName>
            <addressOffset>0x868</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR27</name>
            <displayName>GICD_ITARGETSR27</displayName>
            <addressOffset>0x86c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR28</name>
            <displayName>GICD_ITARGETSR28</displayName>
            <addressOffset>0x870</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR29</name>
            <displayName>GICD_ITARGETSR29</displayName>
            <addressOffset>0x874</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR30</name>
            <displayName>GICD_ITARGETSR30</displayName>
            <addressOffset>0x878</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
