STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>GICD_ITARGETSR31</name>
            <displayName>GICD_ITARGETSR31</displayName>
            <addressOffset>0x87c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR32</name>
            <displayName>GICD_ITARGETSR32</displayName>
            <addressOffset>0x880</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR33</name>
            <displayName>GICD_ITARGETSR33</displayName>
            <addressOffset>0x884</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR34</name>
            <displayName>GICD_ITARGETSR34</displayName>
            <addressOffset>0x888</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR35</name>
            <displayName>GICD_ITARGETSR35</displayName>
            <addressOffset>0x88c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR36</name>
            <displayName>GICD_ITARGETSR36</displayName>
            <addressOffset>0x890</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR37</name>
            <displayName>GICD_ITARGETSR37</displayName>
            <addressOffset>0x894</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR38</name>
            <displayName>GICD_ITARGETSR38</displayName>
            <addressOffset>0x898</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR39</name>
            <displayName>GICD_ITARGETSR39</displayName>
            <addressOffset>0x89c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR40</name>
            <displayName>GICD_ITARGETSR40</displayName>
            <addressOffset>0x8a0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR41</name>
            <displayName>GICD_ITARGETSR41</displayName>
            <addressOffset>0x8a4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR42</name>
            <displayName>GICD_ITARGETSR42</displayName>
            <addressOffset>0x8a8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR43</name>
            <displayName>GICD_ITARGETSR43</displayName>
            <addressOffset>0x8ac</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR44</name>
            <displayName>GICD_ITARGETSR44</displayName>
            <addressOffset>0x8b0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR45</name>
            <displayName>GICD_ITARGETSR45</displayName>
            <addressOffset>0x8b4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
