STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>GICD_ITARGETSR46</name>
            <displayName>GICD_ITARGETSR46</displayName>
            <addressOffset>0x8b8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ITARGETSR47</name>
            <displayName>GICD_ITARGETSR47</displayName>
            <addressOffset>0x8bc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CPU_TARGETS0</name>
                <description>CPU(s) target for interrupt ID = x * 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS1</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS2</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CPU_TARGETS3</name>
                <description>CPU(s) target for interrupt ID = x * 4 + 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ICFGR0</name>
            <displayName>GICD_ICFGR0</displayName>
            <addressOffset>0xc00</addressOffset>
            <size>0x20</size>
            <resetValue>0xAAAAAAAA</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>INT_CONFIG0</name>
                <description>interrupt config for interrupt ID = 0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG1</name>
                <description>interrupt config for interrupt ID = 1</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG2</name>
                <description>interrupt config for interrupt ID = 2</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG3</name>
                <description>interrupt config for interrupt ID = 3</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG4</name>
                <description>interrupt config for interrupt ID = 4</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG5</name>
                <description>interrupt config for interrupt ID = 5</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG6</name>
                <description>interrupt config for interrupt ID = 6</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG7</name>
                <description>interrupt config for interrupt ID = 7</description>
                <bitOffset>14</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG8</name>
                <description>interrupt config for interrupt ID = 8</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG9</name>
                <description>interrupt config for interrupt ID = 9</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG10</name>
                <description>interrupt config for interrupt ID = 10</description>
                <bitOffset>20</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG11</name>
                <description>interrupt config for interrupt ID = 11</description>
                <bitOffset>22</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG12</name>
                <description>interrupt config for interrupt ID = 12</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG13</name>
                <description>interrupt config for interrupt ID = 13</description>
                <bitOffset>26</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG14</name>
                <description>interrupt config for interrupt ID = 14</description>
                <bitOffset>28</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG15</name>
                <description>interrupt config for interrupt ID = 15</description>
                <bitOffset>30</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ICFGR1</name>
            <displayName>GICD_ICFGR1</displayName>
            <description>GICD interrupt configuration register </description>
            <addressOffset>0xc04</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>INT_CONFIG0</name>
                <description>interrupt config for interrupt ID = 16</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG1</name>
                <description>interrupt config for interrupt ID = 17</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG2</name>
                <description>interrupt config for interrupt ID = 18</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG3</name>
                <description>interrupt config for interrupt ID = 19</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG4</name>
                <description>interrupt config for interrupt ID = 20</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG5</name>
                <description>interrupt config for interrupt ID = 21</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG6</name>
                <description>interrupt config for interrupt ID = 22</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG7</name>
                <description>interrupt config for interrupt ID = 23</description>
                <bitOffset>14</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG8</name>
                <description>interrupt config for interrupt ID = 24</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG9</name>
                <description>interrupt config for interrupt ID = 25</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG10</name>
                <description>interrupt config for interrupt ID = 26</description>
                <bitOffset>20</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG11</name>
                <description>interrupt config for interrupt ID = 27</description>
                <bitOffset>22</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG12</name>
                <description>interrupt config for interrupt ID = 28</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG13</name>
                <description>interrupt config for interrupt ID = 29</description>
                <bitOffset>26</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG14</name>
                <description>interrupt config for interrupt ID = 30</description>
                <bitOffset>28</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG15</name>
                <description>interrupt config for interrupt ID = 31</description>
                <bitOffset>30</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ICFGR2</name>
            <displayName>GICD_ICFGR2</displayName>
            <addressOffset>0xc08</addressOffset>
            <size>0x20</size>
            <resetValue>0x55555555</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>INT_CONFIG0</name>
                <description>interrupt config for interrupt ID = x * 16</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG1</name>
                <description>interrupt config for interrupt ID = x * 16 + 1</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG2</name>
                <description>interrupt config for interrupt ID = x * 16 + 2</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG3</name>
                <description>interrupt config for interrupt ID = x * 16 + 3</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG4</name>
                <description>interrupt config for interrupt ID = x * 16 + 4</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG5</name>
                <description>interrupt config for interrupt ID = x * 16 + 5</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG6</name>
                <description>interrupt config for interrupt ID = x * 16 + 6</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG7</name>
                <description>interrupt config for interrupt ID = x * 16 + 7</description>
                <bitOffset>14</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG8</name>
                <description>interrupt config for interrupt ID = x * 16 + 8</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG9</name>
                <description>interrupt config for interrupt ID = x * 16 + 9</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG10</name>
                <description>interrupt config for interrupt ID = x * 16 + 10</description>
                <bitOffset>20</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG11</name>
                <description>interrupt config for interrupt ID = x * 16 + 11</description>
                <bitOffset>22</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG12</name>
                <description>interrupt config for interrupt ID = x * 16 + 12</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG13</name>
                <description>interrupt config for interrupt ID = x * 16 + 13</description>
                <bitOffset>26</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG14</name>
                <description>interrupt config for interrupt ID = x * 16 + 14</description>
                <bitOffset>28</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG15</name>
                <description>interrupt config for interrupt ID = x * 16 + 15</description>
                <bitOffset>30</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ICFGR3</name>
            <displayName>GICD_ICFGR3</displayName>
            <addressOffset>0xc0c</addressOffset>
            <size>0x20</size>
            <resetValue>0x55555555</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>INT_CONFIG0</name>
                <description>interrupt config for interrupt ID = x * 16</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG1</name>
                <description>interrupt config for interrupt ID = x * 16 + 1</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG2</name>
                <description>interrupt config for interrupt ID = x * 16 + 2</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG3</name>
                <description>interrupt config for interrupt ID = x * 16 + 3</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG4</name>
                <description>interrupt config for interrupt ID = x * 16 + 4</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG5</name>
                <description>interrupt config for interrupt ID = x * 16 + 5</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG6</name>
                <description>interrupt config for interrupt ID = x * 16 + 6</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG7</name>
                <description>interrupt config for interrupt ID = x * 16 + 7</description>
                <bitOffset>14</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG8</name>
                <description>interrupt config for interrupt ID = x * 16 + 8</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG9</name>
                <description>interrupt config for interrupt ID = x * 16 + 9</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG10</name>
                <description>interrupt config for interrupt ID = x * 16 + 10</description>
                <bitOffset>20</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG11</name>
                <description>interrupt config for interrupt ID = x * 16 + 11</description>
                <bitOffset>22</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG12</name>
                <description>interrupt config for interrupt ID = x * 16 + 12</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG13</name>
                <description>interrupt config for interrupt ID = x * 16 + 13</description>
                <bitOffset>26</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG14</name>
                <description>interrupt config for interrupt ID = x * 16 + 14</description>
                <bitOffset>28</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG15</name>
                <description>interrupt config for interrupt ID = x * 16 + 15</description>
                <bitOffset>30</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
