STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>GICD_ICFGR4</name>
            <displayName>GICD_ICFGR4</displayName>
            <addressOffset>0xc10</addressOffset>
            <size>0x20</size>
            <resetValue>0x55555555</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>INT_CONFIG0</name>
                <description>interrupt config for interrupt ID = x * 16</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG1</name>
                <description>interrupt config for interrupt ID = x * 16 + 1</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG2</name>
                <description>interrupt config for interrupt ID = x * 16 + 2</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG3</name>
                <description>interrupt config for interrupt ID = x * 16 + 3</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG4</name>
                <description>interrupt config for interrupt ID = x * 16 + 4</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG5</name>
                <description>interrupt config for interrupt ID = x * 16 + 5</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG6</name>
                <description>interrupt config for interrupt ID = x * 16 + 6</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG7</name>
                <description>interrupt config for interrupt ID = x * 16 + 7</description>
                <bitOffset>14</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG8</name>
                <description>interrupt config for interrupt ID = x * 16 + 8</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG9</name>
                <description>interrupt config for interrupt ID = x * 16 + 9</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG10</name>
                <description>interrupt config for interrupt ID = x * 16 + 10</description>
                <bitOffset>20</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG11</name>
                <description>interrupt config for interrupt ID = x * 16 + 11</description>
                <bitOffset>22</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG12</name>
                <description>interrupt config for interrupt ID = x * 16 + 12</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG13</name>
                <description>interrupt config for interrupt ID = x * 16 + 13</description>
                <bitOffset>26</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG14</name>
                <description>interrupt config for interrupt ID = x * 16 + 14</description>
                <bitOffset>28</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG15</name>
                <description>interrupt config for interrupt ID = x * 16 + 15</description>
                <bitOffset>30</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ICFGR5</name>
            <displayName>GICD_ICFGR5</displayName>
            <addressOffset>0xc14</addressOffset>
            <size>0x20</size>
            <resetValue>0x55555555</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>INT_CONFIG0</name>
                <description>interrupt config for interrupt ID = x * 16</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG1</name>
                <description>interrupt config for interrupt ID = x * 16 + 1</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG2</name>
                <description>interrupt config for interrupt ID = x * 16 + 2</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG3</name>
                <description>interrupt config for interrupt ID = x * 16 + 3</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG4</name>
                <description>interrupt config for interrupt ID = x * 16 + 4</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG5</name>
                <description>interrupt config for interrupt ID = x * 16 + 5</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG6</name>
                <description>interrupt config for interrupt ID = x * 16 + 6</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG7</name>
                <description>interrupt config for interrupt ID = x * 16 + 7</description>
                <bitOffset>14</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG8</name>
                <description>interrupt config for interrupt ID = x * 16 + 8</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG9</name>
                <description>interrupt config for interrupt ID = x * 16 + 9</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG10</name>
                <description>interrupt config for interrupt ID = x * 16 + 10</description>
                <bitOffset>20</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG11</name>
                <description>interrupt config for interrupt ID = x * 16 + 11</description>
                <bitOffset>22</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG12</name>
                <description>interrupt config for interrupt ID = x * 16 + 12</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG13</name>
                <description>interrupt config for interrupt ID = x * 16 + 13</description>
                <bitOffset>26</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG14</name>
                <description>interrupt config for interrupt ID = x * 16 + 14</description>
                <bitOffset>28</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG15</name>
                <description>interrupt config for interrupt ID = x * 16 + 15</description>
                <bitOffset>30</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ICFGR6</name>
            <displayName>GICD_ICFGR6</displayName>
            <addressOffset>0xc18</addressOffset>
            <size>0x20</size>
            <resetValue>0x55555555</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>INT_CONFIG0</name>
                <description>interrupt config for interrupt ID = x * 16</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG1</name>
                <description>interrupt config for interrupt ID = x * 16 + 1</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG2</name>
                <description>interrupt config for interrupt ID = x * 16 + 2</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG3</name>
                <description>interrupt config for interrupt ID = x * 16 + 3</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG4</name>
                <description>interrupt config for interrupt ID = x * 16 + 4</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG5</name>
                <description>interrupt config for interrupt ID = x * 16 + 5</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG6</name>
                <description>interrupt config for interrupt ID = x * 16 + 6</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG7</name>
                <description>interrupt config for interrupt ID = x * 16 + 7</description>
                <bitOffset>14</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG8</name>
                <description>interrupt config for interrupt ID = x * 16 + 8</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG9</name>
                <description>interrupt config for interrupt ID = x * 16 + 9</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG10</name>
                <description>interrupt config for interrupt ID = x * 16 + 10</description>
                <bitOffset>20</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG11</name>
                <description>interrupt config for interrupt ID = x * 16 + 11</description>
                <bitOffset>22</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG12</name>
                <description>interrupt config for interrupt ID = x * 16 + 12</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG13</name>
                <description>interrupt config for interrupt ID = x * 16 + 13</description>
                <bitOffset>26</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG14</name>
                <description>interrupt config for interrupt ID = x * 16 + 14</description>
                <bitOffset>28</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG15</name>
                <description>interrupt config for interrupt ID = x * 16 + 15</description>
                <bitOffset>30</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_ICFGR7</name>
            <displayName>GICD_ICFGR7</displayName>
            <addressOffset>0xc1c</addressOffset>
            <size>0x20</size>
            <resetValue>0x55555555</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>INT_CONFIG0</name>
                <description>interrupt config for interrupt ID = x * 16</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG1</name>
                <description>interrupt config for interrupt ID = x * 16 + 1</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG2</name>
                <description>interrupt config for interrupt ID = x * 16 + 2</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG3</name>
                <description>interrupt config for interrupt ID = x * 16 + 3</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG4</name>
                <description>interrupt config for interrupt ID = x * 16 + 4</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG5</name>
                <description>interrupt config for interrupt ID = x * 16 + 5</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG6</name>
                <description>interrupt config for interrupt ID = x * 16 + 6</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG7</name>
                <description>interrupt config for interrupt ID = x * 16 + 7</description>
                <bitOffset>14</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG8</name>
                <description>interrupt config for interrupt ID = x * 16 + 8</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG9</name>
                <description>interrupt config for interrupt ID = x * 16 + 9</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG10</name>
                <description>interrupt config for interrupt ID = x * 16 + 10</description>
                <bitOffset>20</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG11</name>
                <description>interrupt config for interrupt ID = x * 16 + 11</description>
                <bitOffset>22</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG12</name>
                <description>interrupt config for interrupt ID = x * 16 + 12</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG13</name>
                <description>interrupt config for interrupt ID = x * 16 + 13</description>
                <bitOffset>26</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG14</name>
                <description>interrupt config for interrupt ID = x * 16 + 14</description>
                <bitOffset>28</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_CONFIG15</name>
                <description>interrupt config for interrupt ID = x * 16 + 15</description>
                <bitOffset>30</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
