STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>GICD_SPISR1</name>
            <displayName>GICD_SPISR1</displayName>
            <description>GICD shared peripheral interrupt register 1</description>
            <addressOffset>0xd08</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SPISRx</name>
                <description>shared peripheral interrupt</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_SPISR2</name>
            <displayName>GICD_SPISR2</displayName>
            <description>GICD shared peripheral interrupt register 2</description>
            <addressOffset>0xd0c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SPISRx</name>
                <description>shared peripheral interrupt</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_SPISR3</name>
            <displayName>GICD_SPISR3</displayName>
            <description>GICD shared peripheral interrupt register 3</description>
            <addressOffset>0xd10</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SPISRx</name>
                <description>shared peripheral interrupt</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_SPISR4</name>
            <displayName>GICD_SPISR4</displayName>
            <description>GICD shared peripheral interrupt register 4</description>
            <addressOffset>0xd14</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SPISRx</name>
                <description>shared peripheral interrupt</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_SGIR</name>
            <displayName>GICD_SGIR</displayName>
            <addressOffset>0xf00</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>SGIINTID</name>
                <description>SGI interrupt ID
The value of this field is the interrupt ID of the SGI to forward to the specified CPU interfaces, in the range 0-15 (for example: a value of 0b0011 specifies interrupt ID 3).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>NSATT</name>
                <description>non-secure attribute
It specifies the required security value of the SGI:
0 - Forward the SGI specified in the SGIINTID field to a specified CPU interface only if the SGI is configured as group 0 on that interface.
1 - Forward the SGI specified in the SGIINTID field to a specified CPU interfaces only if the SGI is configured as group 1 on that interface.
This field is writable only by a secure access. Any non-secure write to the GICD_SGIR generates an SGI only if the specified SGI is programmed as group 1.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CPUTARGETLIST</name>
                <description>CPU target list
When TARGETLISTFILTER = 0b00, defines the CPU interfaces to which the GICD must forward the interrupt. Each bit of CPUTARGETLIST[1:0] refers to the corresponding CPU interface. If this field is 0 when TARGETLISTFILTER is 0b00, the GICD does not forward the interrupt to any CPU interface.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>TARGETLISTFILTER</name>
                <description>target list filter
Determines how the distributor must process the requested SGI
2: Forward the interrupt only to the CPU interface of the processor which requested the interrupt
3: Reserved, must be kept at reset value.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Forward the interrupt to the CPU interfaces specified in the CPUTARGETLIST field</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Forward the interrupt to all CPU interfaces except the processor which requested the interrupt</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_CPENDSGIR0</name>
            <displayName>GICD_CPENDSGIR0</displayName>
            <description>GICD SGI clear-pending register 0</description>
            <addressOffset>0xf10</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SGI_CLEAR_PENDING0</name>
                <description>clear-pending state for SGI [x * 4]
Writing a 1 clears the pending state of the SGI [x * 4] for the corresponding source processor, and no longer targets the processor performing the write.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SGI_CLEAR_PENDING1</name>
                <description>clear-pending state for SGI [x * 4 + 1]
Writing a 1 clears the pending state of the SGI [x * 4 + 1] for the corresponding source processor, and no longer targets the processor performing the write.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4 + 1] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SGI_CLEAR_PENDING2</name>
                <description>clear-pending state for SGI [x * 4 + 2]
Writing a 1 clears the pending state of the SGI [x * 4 + 2] for the corresponding source processor, and no longer targets the processor performing the write.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4 + 2] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SGI_CLEAR_PENDING3</name>
                <description>clear-pending state for SGI [x * 4 + 3]
Writing a 1 clears the pending state of the SGI [x * 4 + 3] for the corresponding source processor, and no longer targets the processor performing the write.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4 + 3] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_CPENDSGIR1</name>
            <displayName>GICD_CPENDSGIR1</displayName>
            <description>GICD SGI clear-pending register 1</description>
            <addressOffset>0xf14</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SGI_CLEAR_PENDING0</name>
                <description>clear-pending state for SGI [x * 4]
Writing a 1 clears the pending state of the SGI [x * 4] for the corresponding source processor, and no longer targets the processor performing the write.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SGI_CLEAR_PENDING1</name>
                <description>clear-pending state for SGI [x * 4 + 1]
Writing a 1 clears the pending state of the SGI [x * 4 + 1] for the corresponding source processor, and no longer targets the processor performing the write.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4 + 1] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SGI_CLEAR_PENDING2</name>
                <description>clear-pending state for SGI [x * 4 + 2]
Writing a 1 clears the pending state of the SGI [x * 4 + 2] for the corresponding source processor, and no longer targets the processor performing the write.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4 + 2] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SGI_CLEAR_PENDING3</name>
                <description>clear-pending state for SGI [x * 4 + 3]
Writing a 1 clears the pending state of the SGI [x * 4 + 3] for the corresponding source processor, and no longer targets the processor performing the write.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4 + 3] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_CPENDSGIR2</name>
            <displayName>GICD_CPENDSGIR2</displayName>
            <description>GICD SGI clear-pending register 2</description>
            <addressOffset>0xf18</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SGI_CLEAR_PENDING0</name>
                <description>clear-pending state for SGI [x * 4]
Writing a 1 clears the pending state of the SGI [x * 4] for the corresponding source processor, and no longer targets the processor performing the write.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SGI_CLEAR_PENDING1</name>
                <description>clear-pending state for SGI [x * 4 + 1]
Writing a 1 clears the pending state of the SGI [x * 4 + 1] for the corresponding source processor, and no longer targets the processor performing the write.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4 + 1] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SGI_CLEAR_PENDING2</name>
                <description>clear-pending state for SGI [x * 4 + 2]
Writing a 1 clears the pending state of the SGI [x * 4 + 2] for the corresponding source processor, and no longer targets the processor performing the write.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4 + 2] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SGI_CLEAR_PENDING3</name>
                <description>clear-pending state for SGI [x * 4 + 3]
Writing a 1 clears the pending state of the SGI [x * 4 + 3] for the corresponding source processor, and no longer targets the processor performing the write.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4 + 3] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_CPENDSGIR3</name>
            <displayName>GICD_CPENDSGIR3</displayName>
            <description>GICD SGI clear-pending register 3</description>
            <addressOffset>0xf1c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SGI_CLEAR_PENDING0</name>
                <description>clear-pending state for SGI [x * 4]
Writing a 1 clears the pending state of the SGI [x * 4] for the corresponding source processor, and no longer targets the processor performing the write.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SGI_CLEAR_PENDING1</name>
                <description>clear-pending state for SGI [x * 4 + 1]
Writing a 1 clears the pending state of the SGI [x * 4 + 1] for the corresponding source processor, and no longer targets the processor performing the write.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4 + 1] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SGI_CLEAR_PENDING2</name>
                <description>clear-pending state for SGI [x * 4 + 2]
Writing a 1 clears the pending state of the SGI [x * 4 + 2] for the corresponding source processor, and no longer targets the processor performing the write.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4 + 2] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SGI_CLEAR_PENDING3</name>
                <description>clear-pending state for SGI [x * 4 + 3]
Writing a 1 clears the pending state of the SGI [x * 4 + 3] for the corresponding source processor, and no longer targets the processor performing the write.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4 + 3] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_SPENDSGIR0</name>
            <displayName>GICD_SPENDSGIR0</displayName>
            <description>GICD SGI set-pending register 0</description>
            <addressOffset>0xf20</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SGI_SET_PENDING0</name>
                <description>set-pending state for SGI [x * 4]
Writing a 1 sets the pending state of the SGI [x * 4] for the corresponding source processor.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SGI_SET_PENDING1</name>
                <description>set-pending state for SGI [x * 4 + 1]
Writing a 1 sets the pending state of the SGI [x * 4 + 1] for the corresponding source processor.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4 + 1] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SGI_SET_PENDING2</name>
                <description>set-pending state for SGI [x * 4 + 2]
Writing a 1 sets the pending state of the SGI [x * 4 + 2] for the corresponding source processor.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4 + 2] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SGI_SET_PENDING3</name>
                <description>set-pending state for SGI [x * 4 + 3]
Writing a 1 sets the pending state of the SGI [x * 4 + 3] for the corresponding source processor.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4 + 3] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_SPENDSGIR1</name>
            <displayName>GICD_SPENDSGIR1</displayName>
            <description>GICD SGI set-pending register 1</description>
            <addressOffset>0xf24</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SGI_SET_PENDING0</name>
                <description>set-pending state for SGI [x * 4]
Writing a 1 sets the pending state of the SGI [x * 4] for the corresponding source processor.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SGI_SET_PENDING1</name>
                <description>set-pending state for SGI [x * 4 + 1]
Writing a 1 sets the pending state of the SGI [x * 4 + 1] for the corresponding source processor.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4 + 1] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SGI_SET_PENDING2</name>
                <description>set-pending state for SGI [x * 4 + 2]
Writing a 1 sets the pending state of the SGI [x * 4 + 2] for the corresponding source processor.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4 + 2] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SGI_SET_PENDING3</name>
                <description>set-pending state for SGI [x * 4 + 3]
Writing a 1 sets the pending state of the SGI [x * 4 + 3] for the corresponding source processor.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4 + 3] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
