STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>GICD_SPENDSGIR2</name>
            <displayName>GICD_SPENDSGIR2</displayName>
            <description>GICD SGI set-pending register 2</description>
            <addressOffset>0xf28</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SGI_SET_PENDING0</name>
                <description>set-pending state for SGI [x * 4]
Writing a 1 sets the pending state of the SGI [x * 4] for the corresponding source processor.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SGI_SET_PENDING1</name>
                <description>set-pending state for SGI [x * 4 + 1]
Writing a 1 sets the pending state of the SGI [x * 4 + 1] for the corresponding source processor.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4 + 1] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SGI_SET_PENDING2</name>
                <description>set-pending state for SGI [x * 4 + 2]
Writing a 1 sets the pending state of the SGI [x * 4 + 2] for the corresponding source processor.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4 + 2] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SGI_SET_PENDING3</name>
                <description>set-pending state for SGI [x * 4 + 3]
Writing a 1 sets the pending state of the SGI [x * 4 + 3] for the corresponding source processor.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4 + 3] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_SPENDSGIR3</name>
            <displayName>GICD_SPENDSGIR3</displayName>
            <description>GICD SGI set-pending register 3</description>
            <addressOffset>0xf2c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SGI_SET_PENDING0</name>
                <description>set-pending state for SGI [x * 4]
Writing a 1 sets the pending state of the SGI [x * 4] for the corresponding source processor.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SGI_SET_PENDING1</name>
                <description>set-pending state for SGI [x * 4 + 1]
Writing a 1 sets the pending state of the SGI [x * 4 + 1] for the corresponding source processor.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4 + 1] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SGI_SET_PENDING2</name>
                <description>set-pending state for SGI [x * 4 + 2]
Writing a 1 sets the pending state of the SGI [x * 4 + 2] for the corresponding source processor.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4 + 2] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SGI_SET_PENDING3</name>
                <description>set-pending state for SGI [x * 4 + 3]
Writing a 1 sets the pending state of the SGI [x * 4 + 3] for the corresponding source processor.
Writing a 0 has no effect.
Reading a bit identifies whether the SGI [x * 4 + 3] is pending, from the corresponding source processor, on the reading processor.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_PIDR4</name>
            <displayName>GICD_PIDR4</displayName>
            <addressOffset>0xfd0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000004</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PIDR4</name>
                <description>peripheral ID4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_PIDR5</name>
            <displayName>GICD_PIDR5</displayName>
            <addressOffset>0xfd4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PIDRx</name>
                <description>peripheral ID5 to ID7</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_PIDR6</name>
            <displayName>GICD_PIDR6</displayName>
            <addressOffset>0xfd8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PIDRx</name>
                <description>peripheral ID5 to ID7</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_PIDR7</name>
            <displayName>GICD_PIDR7</displayName>
            <addressOffset>0xfdc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PIDRx</name>
                <description>peripheral ID5 to ID7</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_PIDR0</name>
            <displayName>GICD_PIDR0</displayName>
            <addressOffset>0xfe0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000090</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PIDR0</name>
                <description>peripheral ID0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_PIDR1</name>
            <displayName>GICD_PIDR1</displayName>
            <addressOffset>0xfe4</addressOffset>
            <size>0x20</size>
            <resetValue>0x000000B4</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PIDR1</name>
                <description>peripheral ID1</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_PIDR2</name>
            <displayName>GICD_PIDR2</displayName>
            <addressOffset>0xfe8</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000002B</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PIDR2</name>
                <description>peripheral ID2</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_PIDR3</name>
            <displayName>GICD_PIDR3</displayName>
            <addressOffset>0xfec</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PIDR3</name>
                <description>peripheral ID3</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_CIDR0</name>
            <displayName>GICD_CIDR0</displayName>
            <addressOffset>0xff0</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000000D</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CIDR0</name>
                <description>component ID0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_CIDR1</name>
            <displayName>GICD_CIDR1</displayName>
            <addressOffset>0xff4</addressOffset>
            <size>0x20</size>
            <resetValue>0x000000F0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CIDR1</name>
                <description>component ID1</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_CIDR2</name>
            <displayName>GICD_CIDR2</displayName>
            <addressOffset>0xff8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000005</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CIDR2</name>
                <description>component ID2</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICD_CIDR3</name>
            <displayName>GICD_CIDR3</displayName>
            <addressOffset>0xffc</addressOffset>
            <size>0x20</size>
            <resetValue>0x000000B1</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CIDR3</name>
                <description>component ID3</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
