STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>GICC</name>
        <description>GICC address block description</description>
        <groupName>GIC</groupName>
		<baseAddress>0xA0022000</baseAddress>
		<addressBlock>
          <offset>0x0</offset>
          <size>0x2000</size>
          <usage>registers</usage>
        </addressBlock>
        <registers>
          <register>
            <name>GICC_CTLR</name>
            <displayName>GICC_CTLR</displayName>
            <description>GICC control register </description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ENABLEGRP0</name>
                <description>Enable group 0 interrupts
It enables for the signaling of group 0interrupts by the CPU interface to the connected processor.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLEGRP1</name>
                <description>Enable group 1 interrupts
It enables for the signaling of group 1 interrupts by the CPU interface to the connected processor.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ACKCTL</name>
                <description>Acknowledge control
When the highest priority pending interrupt is a group 1 interrupt, this bit determines both:
- whether a read of GICC_IAR acknowledges the interrupt, or returns a spurious interrupt ID
- whether a read of GICC_HPPIR returns the ID of the highest priority pending interrupt, or returns a spurious interrupt ID.
Arm deprecates use of this bit and strongly recommends using a software model where this bit is set to 0.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FIQEN</name>
                <description>FIQ enable for group 0 interrupts
Controls whether the CPU interface signals group 0 interrupts to a target processor using the FIQ or the IRQ signal.
The GIC always signals group 1 interrupts using the IRQ signal.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CBPR</name>
                <description>BPR control
Controls whether the GICC_BPR provides common control to group 0 and group 1 interrupts.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FIQBYPDISGRP0</name>
                <description>FIQ bypass disable for group 0 interrupts
When the signaling of FIQs by the CPU interface is disabled, this bit partly controls whether the bypass FIQ signal is signaled to the processor.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IRQBYPDISGRP0</name>
                <description>IRQ bypass disable for group 0 interrupts
When the signaling of IRQs by the CPU interface is disabled, this bit partly controls whether the bypass IRQ signal is signaled to the processor.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FIQBYPDISGRP1</name>
                <description>Alias of FIQBYPDISGRP1 from the non-secure copy of this register.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IRQBYPDISGRP1</name>
                <description>Alias of IRQBYPDISGRP1 from the non-secure copy of this register.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EOIMODES</name>
                <description>EOI mode for secure accesses
Controls the behavior of accesses to GICC_EOIR and GICC_DIR registers. This control applies only to secure accesses.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EOIMODENS</name>
                <description>Alias of EOIMODENS from the non-secure copy of this register.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
		  <register>
            <name>GICC_CTLRNS</name>
            <displayName>GICC_CTLRNS</displayName>
            <description>GICC control register </description>
			<alternateRegister>GICC_CTLR</alternateRegister>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ENABLEGRP1</name>
                <description>ENABLEGRP1</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FIQBYPDISGRP1</name>
                <description>FIQBYPDISGRP1</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IRQBYPDISGRP1</name>
                <description>IRQBYPDISGRP1</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EOIMODENS</name>
                <description>EOI mode for non- secure accesses</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICC_PMR</name>
            <displayName>GICC_PMR</displayName>
            <description>GICC input priority mask register </description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY</name>
                <description>priority mask level for the CPU interface
If the priority of an interrupt is higher than the value indicated by this field, the interface signals the interrupt to the processor.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICC_BPR</name>
            <displayName>GICC_BPR</displayName>
            <description>GICC binary point register </description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BINARY_POINT</name>
                <description>The value of this field controls how the 8-bit interrupt priority field is split into a group priority field. It is used to determine interrupt preemption and a sub-priority field. Minimum value is 2.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
		  <register>
            <name>GICC_BPRNS</name>
            <displayName>GICC_BPRNS</displayName>
            <description>GICC_BPRNS</description>
			<alternateRegister>GICC_BPR</alternateRegister>
			<addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BINARY_POINT</name>
                <description>The value of this field controls how the 8-bit interrupt priority field is split into a group priority field. It is used to determine interrupt preemption and a sub-priority field. Minimum value is 2.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICC_IAR</name>
            <displayName>GICC_IAR</displayName>
            <description>GICC interrupt acknowledge register </description>
            <addressOffset>0xc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>INTERRUPT_ID</name>
                <description>The interrupt ID</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPUID</name>
                <description>For SGIs in a multiprocessor implementation, this field identifies the processor that requested the interrupt. It returns the number of the CPU interface that made the request.
For example, a value of 1 means the request was generated by a write to the GICD_SGIR on CPU interface 1.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICC_EOIR</name>
            <displayName>GICC_EOIR</displayName>
            <addressOffset>0x10</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>EOIINTID</name>
                <description>It contains the interrupt ID value from the corresponding GICC_IAR access.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CPUID</name>
                <description>On a multiprocessor implementation, if the write refers to an SGI, this field contains the CPUID value from the corresponding GICC_IAR access.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICC_RPR</name>
            <displayName>GICC_RPR</displayName>
            <description>GICC running priority register </description>
            <addressOffset>0x14</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY</name>
                <description>current running priority on the CPU interface</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICC_HPPIR</name>
            <displayName>GICC_HPPIR</displayName>
            <description>GICC highest priority pending interrupt register </description>
            <addressOffset>0x18</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PENDINTID</name>
                <description>interrupt ID of the highest-priority pending interrupt</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPUID</name>
                <description>On a multiprocessor implementation, if the PENDINTID field returns the ID of an SGI, this field contains the CPUID value for that interrupt. This identifies the processor that generated the interrupt.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICC_ABPR</name>
            <displayName>GICC_ABPR</displayName>
            <description>GICC aliased binary point register </description>
            <addressOffset>0x1c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BINARY_POINT</name>
                <description>The value of this field controls how the 8-bit interrupt priority field is split into a group priority field. It is used to determine interrupt preemption, and a subpriority field. Minimun value is 3.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICC_AIAR</name>
            <displayName>GICC_AIAR</displayName>
            <description>GICC aliased interrupt acknowledge register </description>
            <addressOffset>0x20</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>INTERRUPT_ID</name>
                <description>interrupt ID</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPUID</name>
                <description>For SGIs in a multiprocessor implementation, this field identifies the processor that requested the interrupt. It returns the number of the CPU interface that made the request.
For example, a value of 1 means the request was generated by a write to the GICD_SGIR on CPU interface 1.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICC_AEOIR</name>
            <displayName>GICC_AEOIR</displayName>
            <description>GICC aliased end of interrupt register </description>
            <addressOffset>0x24</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>EOIINTID</name>
                <description>It contains the interrupt ID value from the corresponding GICC_AIAR, or non-secure GICC_IAR, access.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CPUID</name>
                <description>On a multiprocessor implementation, when processing an SGI, this field must contain the CPUID value from the corresponding GICC_AIAR, or non-secure GICC_IAR, access.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICC_AHPPIR</name>
            <displayName>GICC_AHPPIR</displayName>
            <description>GICC aliased highest priority pending interrupt register	</description>
            <addressOffset>0x28</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PENDINTID</name>
                <description>interrupt ID of the highest-priority pending interrupt
It contains the interrupt ID of the highest-priority pending interrupt If that interrupt is a group 1 interrupt. Otherwise, its value is the spurious interrupt ID, 1023.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPUID</name>
                <description>On a multiprocessor implementation, if the PENDINTID field returns the ID of an SGI, this field contains the CPUID value for that interrupt. This identifies the processor that generated the interrupt.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICC_APR0</name>
            <displayName>GICC_APR0</displayName>
            <addressOffset>0xd0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>APR0</name>
                <description>active priority</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICC_NSAPR0</name>
            <displayName>GICC_NSAPR0</displayName>
            <addressOffset>0xe0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>NSAPR0</name>
                <description>non-secure active priority</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICC_IIDR</name>
            <displayName>GICC_IIDR</displayName>
            <addressOffset>0xfc</addressOffset>
            <size>0x20</size>
            <resetValue>0x0102143B</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>IMPLEMENTER</name>
                <description>GIC implementer (0x43B Arm implementation)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>REVISION</name>
                <description>revision number for the CPU interface</description>
                <bitOffset>12</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ARCH</name>
                <description>architecture version of the GIC</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PRODUCTID</name>
                <description>product ID</description>
                <bitOffset>20</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICC_DIR</name>
            <displayName>GICC_DIR</displayName>
            <addressOffset>0x1000</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>INTERRUPT_ID</name>
                <description>interrupt ID</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CPUID</name>
                <description>CPU ID
For an SGI in a multiprocessor implementation, this field identifies the processor that requested the interrupt</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
