STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>GICV</name>
        <description>GICV address block description</description>
        <groupName>GIC</groupName>
		<baseAddress>0xA0026000</baseAddress>		
		<addressBlock>
          <offset>0x0</offset>
          <size>0x2000</size>
          <usage>registers</usage>
        </addressBlock>
        <registers>
          <register>
            <name>GICV_CTLR</name>
            <displayName>GICV_CTLR</displayName>
            <description>GICV virtual machine control register </description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ENABLEGRP0</name>
                <description>Enables the signaling of group 0 virtual interrupts by the virtual CPU interface to the virtual machine.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLEGRP1</name>
                <description>Enables the signaling of group 1 virtual interrupts by the virtual CPU interface to the virtual machine.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ACKCTL</name>
                <description>acknowledge control
Controls whether a read of the GICV_IAR, when the highest priority pending interrupt is a group 1 interrupt, causes the CPU interface to acknowledge the interrupt.
Arm deprecates use of this bit. Arm strongly recommends that software is written to operate with this bit always set to 0.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FIQEN</name>
                <description>FIQ enable for group 0 interrupts
Controls whether interrupts marked as group 0 are presented as virtual FIQs.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CBPR</name>
                <description>BPR control
Controls whether the GICV_BPR controls both group 0 and group 1 virtual interrupts.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EOIMODE</name>
                <description>end of interrupt mode
Controls the behavior associated with the GICV_EOIR, GICV_AEOIR, and GICV_DIR registers.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICV_PMR</name>
            <displayName>GICV_PMR</displayName>
            <description>GICV VM priority mask register </description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY</name>
                <description>priority mask level for the virtual CPU interface
Only virtual interrupts with higher priority than the value in this register can be signaled to the processor</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICV_BPR</name>
            <displayName>GICV_BPR</displayName>
            <description>GICV VM binary point register </description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BINARY_POINT</name>
                <description>The value of this field controls how the 8-bit virtual interrupt priority field is split into a group priority field, used to determine virtual interrupt preemption, and a subpriority field. Minimun value is 2.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICV_IAR</name>
            <displayName>GICV_IAR</displayName>
            <description>GICV VM interrupt acknowledge register </description>
            <addressOffset>0xc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>INTERRUPT_ID</name>
                <description>The interrupt ID</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPUID</name>
                <description>If the GICH_LRx.HW bit is set to 0, indicating that the interrupt is triggered in software, then CPUID of the GICH_LRx, that indicate the CPU ID, are returned in the GICV_IAR.CPUID field. Otherwise GICV_IAR.CPUID field reads as zero.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICV_EOIR</name>
            <displayName>GICV_EOIR</displayName>
            <addressOffset>0x10</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>EOIINTID</name>
                <description>If the GICH_LRx.HW bit in the matching list register is set to 1, indicating a hardware interrupt, then a deactivate request is sent to the physical Distributor, identifying the Physical ID from the corresponding field in the list register.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CPUID</name>
                <description>On a multiprocessor implementation, if the write refers to an SGI, this field contains the CPUID value from the corresponding GICV_IAR access.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICV_RPR</name>
            <displayName>GICV_RPR</displayName>
            <description>GICV VM running priority register </description>
            <addressOffset>0x14</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIORITY</name>
                <description>current running priority on the virtual CPU interface</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICV_HPPIR</name>
            <displayName>GICV_HPPIR</displayName>
            <description>GICV VM highest priority pending interrupt register </description>
            <addressOffset>0x18</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PENDINTID</name>
                <description>The virtual interrupt ID of the highest priority pending virtual interrupt</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPUID</name>
                <description>On a multiprocessor implementation, if GICH_LRx.HW bit=0, this field contains the CPUID value for that virtual interrupt. This identifies the virtual processor that generated the virtual interrupt.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICV_ABPR</name>
            <displayName>GICV_ABPR</displayName>
            <description>GICV VM aliased binary point register </description>
            <addressOffset>0x1c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BINARY_POINT</name>
                <description>The value of this field controls how the 8-bit virtual interrupt priority field is split into a group priority field, used to determine virtual interrupt preemption, and a subpriority field. Minimun value is 3.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICV_AIAR</name>
            <displayName>GICV_AIAR</displayName>
            <description>GICV VM aliased interrupt register </description>
            <addressOffset>0x20</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>INTERRUPT_ID</name>
                <description>The interrupt ID. If the GICH_LRx.Grp1 bit is 0, the interrupt is Group 0. The spurious interrupt ID 1023 is returned and the interrupt is not acknowledged.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPUID</name>
                <description>If the GICH_LRx.HW bit is set to 0, indicating that the interrupt is triggered in software, then CPUID of the GICH_LRx, that indicate the CPU ID, are returned in the GICV_AIAR.CPUID field. Otherwise GICV_AIAR.CPUID field reads as zero..</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICV_AEOIR</name>
            <displayName>GICV_AEOIR</displayName>
            <addressOffset>0x24</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>EOIINTID</name>
                <description>If the GICH_LRx.HW bit in the matching list register is set to 1, indicating a hardware interrupt, then a deactivate request is sent to the physical Distributor, identifying the Physical ID from the corresponding field in the list register.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CPUID</name>
                <description>On a multiprocessor implementation, if the write refers to an SGI, this field contains the CPUID value from the corresponding GICV_IAR access.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICV_AHPPIR</name>
            <displayName>GICV_AHPPIR</displayName>
            <description>GICV VM aliased highest priority pending interrupt register	</description>
            <addressOffset>0x28</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PENDINTID</name>
                <description>The virtual interrupt ID of the highest-priority pending virtual interrupt, if that virtual interrupt is a group 1 virtual interrupt. Otherwise, the spurious virtual interrupt ID, 1023.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CPUID</name>
                <description>If the GICH_LRx.HW bit in the matching List register is set to 1, indicating a hardware interrupt, then a deactivate request is sent to the physical Distributor, identifying the physical ID from the corresponding field in the List register.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICV_APR0</name>
            <displayName>GICV_APR0</displayName>
            <description>GICV VM active priority register </description>
            <addressOffset>0xd0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>APR0</name>
                <description>active priority</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICV_IIDR</name>
            <displayName>GICV_IIDR</displayName>
            <description>GICV VM CPU interface identification register </description>
            <addressOffset>0xfc</addressOffset>
            <size>0x20</size>
            <resetValue>0x0102143B</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>IIDR</name>
                <description>see description of GICC_IIDR register</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GICV_DIR</name>
            <displayName>GICV_DIR</displayName>
            <addressOffset>0x1000</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>INTERRUPT_ID</name>
                <description>The interrupt ID</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CPUID</name>
                <description>This field identifies the processor that requested the interrupt.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
