STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
        <register>
          <name>GPIOI_HWCFGR9</name>
          <displayName>GPIOI_HWCFGR9</displayName>
          <description>For GPIOA, B, C, D, E, F, G, H, I, and GPIOJ: For GPIOK and GPIOZ:</description>
          <addressOffset>0x3CC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000000FF</resetValue>
          <fields>
            <field>
              <name>EN_IO</name>
              <description>EN_IO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOI_HWCFGR8</name>
          <displayName>GPIOI_HWCFGR8</displayName>
          <description>For GPIOA, B, C, D, E, F, G, H, I, and GPIOJ: For GPIOK and GPIOZ:</description>
          <addressOffset>0x3D0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AF_PRIO8</name>
              <description>AF_PRIO8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AF_PRIO9</name>
              <description>AF_PRIO9</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AF_PRIO10</name>
              <description>AF_PRIO10</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AF_PRIO11</name>
              <description>AF_PRIO11</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AF_PRIO12</name>
              <description>AF_PRIO12</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AF_PRIO13</name>
              <description>AF_PRIO13</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AF_PRIO14</name>
              <description>AF_PRIO14</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AF_PRIO15</name>
              <description>AF_PRIO15</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOI_HWCFGR7</name>
          <displayName>GPIOI_HWCFGR7</displayName>
          <description>GPIO hardware configuration register 7 </description>
          <addressOffset>0x3D4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>AF_PRIO0</name>
              <description>AF_PRIO0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AF_PRIO1</name>
              <description>AF_PRIO1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AF_PRIO2</name>
              <description>AF_PRIO2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AF_PRIO3</name>
              <description>AF_PRIO3</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AF_PRIO4</name>
              <description>AF_PRIO4</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AF_PRIO5</name>
              <description>AF_PRIO5</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AF_PRIO6</name>
              <description>AF_PRIO6</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AF_PRIO7</name>
              <description>AF_PRIO7</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOI_HWCFGR6</name>
          <displayName>GPIOI_HWCFGR6</displayName>
          <description>GPIO hardware configuration register 6 </description>
          <addressOffset>0x3D8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>MODER_RES</name>
              <description>MODER_RES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOI_HWCFGR5</name>
          <displayName>GPIOI_HWCFGR5</displayName>
          <description>GPIO hardware configuration register 5 </description>
          <addressOffset>0x3DC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PUPDR_RES</name>
              <description>PUPDR_RES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOI_HWCFGR4</name>
          <displayName>GPIOI_HWCFGR4</displayName>
          <description>GPIO hardware configuration register 4 </description>
          <addressOffset>0x3E0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OSPEED_RES</name>
              <description>OSPEED_RES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOI_HWCFGR3</name>
          <displayName>GPIOI_HWCFGR3</displayName>
          <description>GPIO hardware configuration register 3 </description>
          <addressOffset>0x3E4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ODR_RES</name>
              <description>ODR_RES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>OTYPER_RES</name>
              <description>OTYPER_RES</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOI_HWCFGR2</name>
          <displayName>GPIOI_HWCFGR2</displayName>
          <description>GPIO hardware configuration register 2 </description>
          <addressOffset>0x3E8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AFRL_RES</name>
              <description>AFRL_RES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOI_HWCFGR1</name>
          <displayName>GPIOI_HWCFGR1</displayName>
          <description>GPIO hardware configuration register 1 </description>
          <addressOffset>0x3EC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AFRH_RES</name>
              <description>AFRH_RES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOI_HWCFGR0</name>
          <displayName>GPIOI_HWCFGR0</displayName>
          <description>GPIO hardware configuration register 0 </description>
          <addressOffset>0x3F0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OR_RES</name>
              <description>OR_RES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOI_VERR</name>
          <displayName>GPIOI_VERR</displayName>
          <description>GPIO version register </description>
          <addressOffset>0x3F4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>MINREV</name>
              <description>MINREV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MAJREV</name>
              <description>MAJREV</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOI_IPIDR</name>
          <displayName>GPIOI_IPIDR</displayName>
          <description>GPIO identification register </description>
          <addressOffset>0x3F8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000F0002</resetValue>
          <fields>
            <field>
              <name>IPIDR</name>
              <description>IPIDR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOI_SIDR</name>
          <displayName>GPIOI_SIDR</displayName>
          <description>GPIO size identification register </description>
          <addressOffset>0x3FC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0xA3C5DD01</resetValue>
          <fields>
            <field>
              <name>SIDR</name>
              <description>SIDR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
