STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>HASH_CSR24</name>
            <displayName>HASH_CSR24</displayName>
            <description>HASH context swap register 24</description>
            <addressOffset>0x158</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS24</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR25</name>
            <displayName>HASH_CSR25</displayName>
            <description>HASH context swap register 25</description>
            <addressOffset>0x15c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS25</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR26</name>
            <displayName>HASH_CSR26</displayName>
            <description>HASH context swap register 26</description>
            <addressOffset>0x160</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS26</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR27</name>
            <displayName>HASH_CSR27</displayName>
            <description>HASH context swap register 27</description>
            <addressOffset>0x164</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS27</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR28</name>
            <displayName>HASH_CSR28</displayName>
            <description>HASH context swap register 28</description>
            <addressOffset>0x168</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS28</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR29</name>
            <displayName>HASH_CSR29</displayName>
            <description>HASH context swap register 29</description>
            <addressOffset>0x16c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS29</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR30</name>
            <displayName>HASH_CSR30</displayName>
            <description>HASH context swap register 30</description>
            <addressOffset>0x170</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS30</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR31</name>
            <displayName>HASH_CSR31</displayName>
            <description>HASH context swap register 31</description>
            <addressOffset>0x174</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS31</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR32</name>
            <displayName>HASH_CSR32</displayName>
            <description>HASH context swap register 32</description>
            <addressOffset>0x178</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS32</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR33</name>
            <displayName>HASH_CSR33</displayName>
            <description>HASH context swap register 33</description>
            <addressOffset>0x17c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS33</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR34</name>
            <displayName>HASH_CSR34</displayName>
            <description>HASH context swap register 34</description>
            <addressOffset>0x180</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS34</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR35</name>
            <displayName>HASH_CSR35</displayName>
            <description>HASH context swap register 35</description>
            <addressOffset>0x184</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS35</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR36</name>
            <displayName>HASH_CSR36</displayName>
            <description>HASH context swap register 36</description>
            <addressOffset>0x188</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS36</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR37</name>
            <displayName>HASH_CSR37</displayName>
            <description>HASH context swap register 37</description>
            <addressOffset>0x18c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS37</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR38</name>
            <displayName>HASH_CSR38</displayName>
            <description>HASH context swap register 38</description>
            <addressOffset>0x190</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS38</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR39</name>
            <displayName>HASH_CSR39</displayName>
            <description>HASH context swap register 39</description>
            <addressOffset>0x194</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS39</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR40</name>
            <displayName>HASH_CSR40</displayName>
            <description>HASH context swap register 40</description>
            <addressOffset>0x198</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS40</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR41</name>
            <displayName>HASH_CSR41</displayName>
            <description>HASH context swap register 41</description>
            <addressOffset>0x19c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS41</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR42</name>
            <displayName>HASH_CSR42</displayName>
            <description>HASH context swap register 42</description>
            <addressOffset>0x1a0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS42</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR43</name>
            <displayName>HASH_CSR43</displayName>
            <description>HASH context swap register 43</description>
            <addressOffset>0x1a4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS43</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR44</name>
            <displayName>HASH_CSR44</displayName>
            <description>HASH context swap register 44</description>
            <addressOffset>0x1a8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS44</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR45</name>
            <displayName>HASH_CSR45</displayName>
            <description>HASH context swap register 45</description>
            <addressOffset>0x1ac</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS45</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR46</name>
            <displayName>HASH_CSR46</displayName>
            <description>HASH context swap register 46</description>
            <addressOffset>0x1b0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS46</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR47</name>
            <displayName>HASH_CSR47</displayName>
            <description>HASH context swap register 47</description>
            <addressOffset>0x1b4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS47</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR48</name>
            <displayName>HASH_CSR48</displayName>
            <description>HASH context swap register 48</description>
            <addressOffset>0x1b8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS48</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR49</name>
            <displayName>HASH_CSR49</displayName>
            <description>HASH context swap register 49</description>
            <addressOffset>0x1bc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS49</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR50</name>
            <displayName>HASH_CSR50</displayName>
            <description>HASH context swap register 50</description>
            <addressOffset>0x1c0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS50</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR51</name>
            <displayName>HASH_CSR51</displayName>
            <description>HASH context swap register 51</description>
            <addressOffset>0x1c4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS51</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR52</name>
            <displayName>HASH_CSR52</displayName>
            <description>HASH context swap register 52</description>
            <addressOffset>0x1c8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS52</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR53</name>
            <displayName>HASH_CSR53</displayName>
            <description>HASH context swap register 53</description>
            <addressOffset>0x1cc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS53</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR54</name>
            <displayName>HASH_CSR54</displayName>
            <description>HASH context swap register 54</description>
            <addressOffset>0x1d0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS54</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR55</name>
            <displayName>HASH_CSR55</displayName>
            <description>HASH context swap register 55</description>
            <addressOffset>0x1d4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS55</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR56</name>
            <displayName>HASH_CSR56</displayName>
            <description>HASH context swap register 56</description>
            <addressOffset>0x1d8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS56</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
