STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>HASH_CSR57</name>
            <displayName>HASH_CSR57</displayName>
            <description>HASH context swap register 57</description>
            <addressOffset>0x1dc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS57</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR58</name>
            <displayName>HASH_CSR58</displayName>
            <description>HASH context swap register 58</description>
            <addressOffset>0x1e0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS58</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR59</name>
            <displayName>HASH_CSR59</displayName>
            <description>HASH context swap register 59</description>
            <addressOffset>0x1e4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS59</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR60</name>
            <displayName>HASH_CSR60</displayName>
            <description>HASH context swap register 60</description>
            <addressOffset>0x1e8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS60</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR61</name>
            <displayName>HASH_CSR61</displayName>
            <description>HASH context swap register 61</description>
            <addressOffset>0x1ec</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS61</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR62</name>
            <displayName>HASH_CSR62</displayName>
            <description>HASH context swap register 62</description>
            <addressOffset>0x1f0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS62</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR63</name>
            <displayName>HASH_CSR63</displayName>
            <description>HASH context swap register 63</description>
            <addressOffset>0x1f4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS63</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR64</name>
            <displayName>HASH_CSR64</displayName>
            <description>HASH context swap register 64</description>
            <addressOffset>0x1f8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS64</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR65</name>
            <displayName>HASH_CSR65</displayName>
            <description>HASH context swap register 65</description>
            <addressOffset>0x1fc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS65</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR66</name>
            <displayName>HASH_CSR66</displayName>
            <description>HASH context swap register 66</description>
            <addressOffset>0x200</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS66</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR67</name>
            <displayName>HASH_CSR67</displayName>
            <description>HASH context swap register 67</description>
            <addressOffset>0x204</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS67</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR68</name>
            <displayName>HASH_CSR68</displayName>
            <description>HASH context swap register 68</description>
            <addressOffset>0x208</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS68</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR69</name>
            <displayName>HASH_CSR69</displayName>
            <description>HASH context swap register 69</description>
            <addressOffset>0x20c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS69</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR70</name>
            <displayName>HASH_CSR70</displayName>
            <description>HASH context swap register 70</description>
            <addressOffset>0x210</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS70</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR71</name>
            <displayName>HASH_CSR71</displayName>
            <description>HASH context swap register 71</description>
            <addressOffset>0x214</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS71</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR72</name>
            <displayName>HASH_CSR72</displayName>
            <description>HASH context swap register 72</description>
            <addressOffset>0x218</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS72</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR73</name>
            <displayName>HASH_CSR73</displayName>
            <description>HASH context swap register 73</description>
            <addressOffset>0x21c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS73</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR74</name>
            <displayName>HASH_CSR74</displayName>
            <description>HASH context swap register 74</description>
            <addressOffset>0x220</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS74</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR75</name>
            <displayName>HASH_CSR75</displayName>
            <description>HASH context swap register 75</description>
            <addressOffset>0x224</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS75</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR76</name>
            <displayName>HASH_CSR76</displayName>
            <description>HASH context swap register 76</description>
            <addressOffset>0x228</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS76</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR77</name>
            <displayName>HASH_CSR77</displayName>
            <description>HASH context swap register 77</description>
            <addressOffset>0x22c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS77</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR78</name>
            <displayName>HASH_CSR78</displayName>
            <description>HASH context swap register 78</description>
            <addressOffset>0x230</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS78</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR79</name>
            <displayName>HASH_CSR79</displayName>
            <description>HASH context swap register 79</description>
            <addressOffset>0x234</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS79</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR80</name>
            <displayName>HASH_CSR80</displayName>
            <description>HASH context swap register 80</description>
            <addressOffset>0x238</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS80</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR81</name>
            <displayName>HASH_CSR81</displayName>
            <description>HASH context swap register 81</description>
            <addressOffset>0x23c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR82</name>
            <displayName>HASH_CSR82</displayName>
            <description>HASH context swap register 82</description>
            <addressOffset>0x240</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR83</name>
            <displayName>HASH_CSR83</displayName>
            <description>HASH context swap register 83</description>
            <addressOffset>0x244</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR84</name>
            <displayName>HASH_CSR84</displayName>
            <description>HASH context swap register 84</description>
            <addressOffset>0x248</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR85</name>
            <displayName>HASH_CSR85</displayName>
            <description>HASH context swap register 85</description>
            <addressOffset>0x24c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR86</name>
            <displayName>HASH_CSR86</displayName>
            <description>HASH context swap register 86</description>
            <addressOffset>0x250</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR87</name>
            <displayName>HASH_CSR87</displayName>
            <description>HASH context swap register 87</description>
            <addressOffset>0x254</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR88</name>
            <displayName>HASH_CSR88</displayName>
            <description>HASH context swap register 88</description>
            <addressOffset>0x258</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR89</name>
            <displayName>HASH_CSR89</displayName>
            <description>HASH context swap register 89</description>
            <addressOffset>0x25c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
