STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>HASH_CSR90</name>
            <displayName>HASH_CSR90</displayName>
            <description>HASH context swap register 90</description>
            <addressOffset>0x260</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR91</name>
            <displayName>HASH_CSR91</displayName>
            <description>HASH context swap register 91</description>
            <addressOffset>0x264</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR92</name>
            <displayName>HASH_CSR92</displayName>
            <description>HASH context swap register 92</description>
            <addressOffset>0x268</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR93</name>
            <displayName>HASH_CSR93</displayName>
            <description>HASH context swap register 93</description>
            <addressOffset>0x26c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR94</name>
            <displayName>HASH_CSR94</displayName>
            <description>HASH context swap register 94</description>
            <addressOffset>0x270</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR95</name>
            <displayName>HASH_CSR95</displayName>
            <description>HASH context swap register 95</description>
            <addressOffset>0x274</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR96</name>
            <displayName>HASH_CSR96</displayName>
            <description>HASH context swap register 96</description>
            <addressOffset>0x278</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR97</name>
            <displayName>HASH_CSR97</displayName>
            <description>HASH context swap register 97</description>
            <addressOffset>0x27c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR98</name>
            <displayName>HASH_CSR98</displayName>
            <description>HASH context swap register 98</description>
            <addressOffset>0x280</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR99</name>
            <displayName>HASH_CSR99</displayName>
            <description>HASH context swap register 99</description>
            <addressOffset>0x284</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR100</name>
            <displayName>HASH_CSR100</displayName>
            <description>HASH context swap register 100</description>
            <addressOffset>0x288</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR101</name>
            <displayName>HASH_CSR101</displayName>
            <description>HASH context swap register 101</description>
            <addressOffset>0x28c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR102</name>
            <displayName>HASH_CSR102</displayName>
            <description>HASH context swap register 102</description>
            <addressOffset>0x290</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap x (x = 0 to 102)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR0</name>
            <displayName>HASH_HR0</displayName>
            <addressOffset>0x310</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 0 to 4)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR1</name>
            <displayName>HASH_HR1</displayName>
            <addressOffset>0x314</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 0 to 4)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR2</name>
            <displayName>HASH_HR2</displayName>
            <addressOffset>0x318</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 0 to 4)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR3</name>
            <displayName>HASH_HR3</displayName>
            <addressOffset>0x31c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 0 to 4)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR4</name>
            <displayName>HASH_HR4</displayName>
            <addressOffset>0x320</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 0 to 4)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR5</name>
            <displayName>HASH_HR5</displayName>
            <addressOffset>0x324</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR6</name>
            <displayName>HASH_HR6</displayName>
            <addressOffset>0x328</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR7</name>
            <displayName>HASH_HR7</displayName>
            <addressOffset>0x32c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR8</name>
            <displayName>HASH_HR8</displayName>
            <addressOffset>0x330</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR9</name>
            <displayName>HASH_HR9</displayName>
            <addressOffset>0x334</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR10</name>
            <displayName>HASH_HR10</displayName>
            <addressOffset>0x338</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR11</name>
            <displayName>HASH_HR11</displayName>
            <addressOffset>0x33c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR12</name>
            <displayName>HASH_HR12</displayName>
            <addressOffset>0x340</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR13</name>
            <displayName>HASH_HR13</displayName>
            <addressOffset>0x344</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR14</name>
            <displayName>HASH_HR14</displayName>
            <addressOffset>0x348</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR15</name>
            <displayName>HASH_HR15</displayName>
            <addressOffset>0x34c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR16</name>
            <displayName>HASH_HR16</displayName>
            <addressOffset>0x350</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR17</name>
            <displayName>HASH_HR17</displayName>
            <addressOffset>0x354</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR18</name>
            <displayName>HASH_HR18</displayName>
            <addressOffset>0x358</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR19</name>
            <displayName>HASH_HR19</displayName>
            <addressOffset>0x35c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR20</name>
            <displayName>HASH_HR20</displayName>
            <addressOffset>0x360</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR21</name>
            <displayName>HASH_HR21</displayName>
            <addressOffset>0x364</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR22</name>
            <displayName>HASH_HR22</displayName>
            <addressOffset>0x368</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
