STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>HASH_HR23</name>
            <displayName>HASH_HR23</displayName>
            <addressOffset>0x36c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR24</name>
            <displayName>HASH_HR24</displayName>
            <addressOffset>0x370</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR25</name>
            <displayName>HASH_HR25</displayName>
            <addressOffset>0x374</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR26</name>
            <displayName>HASH_HR26</displayName>
            <addressOffset>0x378</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR27</name>
            <displayName>HASH_HR27</displayName>
            <addressOffset>0x37c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR28</name>
            <displayName>HASH_HR28</displayName>
            <addressOffset>0x380</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR29</name>
            <displayName>HASH_HR29</displayName>
            <addressOffset>0x384</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR30</name>
            <displayName>HASH_HR30</displayName>
            <addressOffset>0x388</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR31</name>
            <displayName>HASH_HR31</displayName>
            <addressOffset>0x38c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR32</name>
            <displayName>HASH_HR32</displayName>
            <addressOffset>0x390</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR33</name>
            <displayName>HASH_HR33</displayName>
            <addressOffset>0x394</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR34</name>
            <displayName>HASH_HR34</displayName>
            <addressOffset>0x398</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR35</name>
            <displayName>HASH_HR35</displayName>
            <addressOffset>0x39c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR36</name>
            <displayName>HASH_HR36</displayName>
            <addressOffset>0x3a0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR37</name>
            <displayName>HASH_HR37</displayName>
            <addressOffset>0x3a4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR38</name>
            <displayName>HASH_HR38</displayName>
            <addressOffset>0x3a8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR39</name>
            <displayName>HASH_HR39</displayName>
            <addressOffset>0x3ac</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR40</name>
            <displayName>HASH_HR40</displayName>
            <addressOffset>0x3b0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR41</name>
            <displayName>HASH_HR41</displayName>
            <addressOffset>0x3b4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR42</name>
            <displayName>HASH_HR42</displayName>
            <addressOffset>0x3b8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR43</name>
            <displayName>HASH_HR43</displayName>
            <addressOffset>0x3bc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR44</name>
            <displayName>HASH_HR44</displayName>
            <addressOffset>0x3c0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR45</name>
            <displayName>HASH_HR45</displayName>
            <addressOffset>0x3c4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR46</name>
            <displayName>HASH_HR46</displayName>
            <addressOffset>0x3c8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR47</name>
            <displayName>HASH_HR47</displayName>
            <addressOffset>0x3cc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR48</name>
            <displayName>HASH_HR48</displayName>
            <addressOffset>0x3d0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR49</name>
            <displayName>HASH_HR49</displayName>
            <addressOffset>0x3d4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Hx</name>
                <description>Hash data x (x = 5 to 49)
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HWCFGR</name>
            <displayName>HASH_HWCFGR</displayName>
            <addressOffset>0x3f0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00010111</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CFG1</name>
                <description>HW generic 1
this bitfield reflects the DMA type connected to this HASH peripheral.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFG2</name>
                <description>HW generic 2
This bitfield reflects that the HMAC is supported.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFG3</name>
                <description>HW generic 3
This bitfield reflects that the SHA3 algorithm is supported.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFG4</name>
                <description>HW generic 4
This bitfield is read as zero.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFG5</name>
                <description>HW generic 5
This bitfield reflects that the SHA384 and SHA512 algorithms are supported.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_VERR</name>
            <displayName>HASH_VERR</displayName>
            <addressOffset>0x3f4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000040</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MINREV</name>
                <description>Minor revision
These bits return the HASH minor revision</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>MAJREV</name>
                <description>Major revision
These bits return the HASH major revision</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_IPIDR</name>
            <displayName>HASH_IPIDR</displayName>
            <addressOffset>0x3f8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00170031</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ID</name>
                <description>[31: 0]: Identifier
These bits return the unique identifier of the HASH peripheral.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_SIDR</name>
            <displayName>HASH_SIDR</displayName>
            <addressOffset>0x3fc</addressOffset>
            <size>0x20</size>
            <resetValue>0xA3C5DD01</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SID</name>
                <description>Size identification code
This bitfield returns the size identification code of the HASH peripheral as defined below:
Bits[31:8] = 0xA3C5DD (fixed code)
Bits[7:0] = 0x01 (1-Kbyte address decoding)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
