STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
        </registers>
    </peripheral>
	<peripheral>
        <name>HDP</name>
        <description>HDP register block</description>
		<groupName>HDP</groupName>
        <baseAddress>0x5002A000</baseAddress>
        <addressBlock>
          <offset>0x0</offset>
          <size>0x400</size>
          <usage>registers</usage>
        </addressBlock>
        <registers>
          <register>
            <name>HDP_CTRL</name>
            <displayName>HDP_CTRL</displayName>
            <description>HDP control register </description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable HDP
Valid if enabled in BSEC.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HDP_MUX</name>
            <displayName>HDP_MUX</displayName>
            <description>HDP multiplexers control register </description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MUX0</name>
                <description>Select the HDP0 output among the 16 available signals</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MUX1</name>
                <description>Select the HDP1 output among the 16 available signals</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MUX2</name>
                <description>Select the HDP2 output among the 16 available signals</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MUX3</name>
                <description>Select the HDP3 output among the 16 available signals</description>
                <bitOffset>12</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MUX4</name>
                <description>Select the HDP4 output among the 16 available signals</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MUX5</name>
                <description>Select the HDP5 output among the 16 available signals</description>
                <bitOffset>20</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MUX6</name>
                <description>Select the HDP6 output among the 16 available signals</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MUX7</name>
                <description>Select the HDP7 output among the 16 available signals</description>
                <bitOffset>28</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HDP_VAL</name>
            <displayName>HDP_VAL</displayName>
            <description>HDP read back value register </description>
            <addressOffset>0x10</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HDPVAL</name>
                <description>HDP read back value
Provides the value of the HDP signals.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HDP_GPOSET</name>
            <displayName>HDP_GPOSET</displayName>
            <description>HDP general purpose output set register </description>
            <addressOffset>0x14</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HDPGPOSET</name>
                <description>HDP general purpose output set
When a bit is written to 1, the corresponding HDP GPO is set. Writing a bit to 0 has no effect.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HDP_GPOCLR</name>
            <displayName>HDP_GPOCLR</displayName>
            <description>HDP general purpose output clear register </description>
            <addressOffset>0x18</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HDPGPOCLR</name>
                <description>HDP general purpose output clear
When a bit is written to 1, the corresponding HDP GPO is cleared. Writing a bit to 0 has no effect.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HDP_GPOVAL</name>
            <displayName>HDP_GPOVAL</displayName>
            <description>HDP general purpose output value register </description>
            <addressOffset>0x1c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HDPGPOVAL</name>
                <description>HDP general purpose output value
When written, defines the value of the HDP GPO. When read, provides the current GPO value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HDP_VERR</name>
            <displayName>HDP_VERR</displayName>
            <description>HDP version register </description>
            <addressOffset>0x3f4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000010</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MINREV</name>
                <description>Minor revision of the IP</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>MAJREV</name>
                <description>Major revision of the IP</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HDP_IPIDR</name>
            <displayName>HDP_IPIDR</displayName>
            <description>HDP IP identification register </description>
            <addressOffset>0x3f8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00030002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ID</name>
                <description>IP Identifier</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HDP_SIDR</name>
            <displayName>HDP_SIDR</displayName>
            <description>HDP size identification register </description>
            <addressOffset>0x3fc</addressOffset>
            <size>0x20</size>
            <resetValue>0xA3C5DD01</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SID</name>
                <description>Size identifier</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
