STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>LTDC_L1AFBLNR</name>
            <displayName>LTDC_L1AFBLNR</displayName>
            <description>LTDC Layer1 auxiliary frame buffer line number register	</description>
            <addressOffset>0x14c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AFBLNBR</name>
                <description>auxiliary frame buffer line number
This field defines the number of lines in the auxiliary frame buffer that corresponds to the active high width.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LTDC_L1CLUTWR</name>
            <displayName>LTDC_L1CLUTWR</displayName>
            <description>LTDC Layerx CLUT write register</description>
            <addressOffset>0x150</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BLUE</name>
                <description>blue value
This field configures the blue value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>green value
This field configures the green value.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>red value
This field configures the red value.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CLUTADD</name>
                <description>CLUT address
This field configures the CLUT address (color position within the CLUT) of each RGB value.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LTDC_L1CYR0R</name>
            <displayName>LTDC_L1CYR0R</displayName>
            <description>LTDC Layerx conversion YCbCr RGB 0 register</description>
            <addressOffset>0x16c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CR2R</name>
                <description>Cr-to-Red coefficient, with bits 9:8 as positive integer and 7:0 as decimals.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CB2B</name>
                <description>Cb-to-Blue coefficient, with bits 9:8 as positive integer and 7:0 as decimals.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LTDC_L1CYR1R</name>
            <displayName>LTDC_L1CYR1R</displayName>
            <description>LTDC Layerx conversion YCbCr RGB 1 register</description>
            <addressOffset>0x170</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CR2G</name>
                <description>Cr-to-Green coefficient, with bits 9:8 as positive integer and 7:0 as decimals.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CB2G</name>
                <description>Cb-to-Green coefficient, with bits 9:8 as positive integer and 7:0 as decimals.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LTDC_L1FPF0R</name>
            <displayName>LTDC_L1FPF0R</displayName>
            <description>LTDC Layerx flexible pixel format 0 register</description>
            <addressOffset>0x174</addressOffset>
            <size>0x20</size>
            <resetValue>0x00011100</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>APOS</name>
                <description>Location of the Alpha component inside the pixel memory word (in bits)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ALEN</name>
                <description>Width of the Alpha component (in bits)</description>
                <bitOffset>5</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RPOS</name>
                <description>Location of the Red component inside the pixel memory word (in bits)</description>
                <bitOffset>9</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RLEN</name>
                <description>Width of the Red component (in bits)</description>
                <bitOffset>14</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LTDC_L1FPF1R</name>
            <displayName>LTDC_L1FPF1R</displayName>
            <description>LTDC Layerx flexible pixel format 1 register</description>
            <addressOffset>0x178</addressOffset>
            <size>0x20</size>
            <resetValue>0x00093110</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>GPOS</name>
                <description>Location of the Green Component inside the Pixel Memory Word (in bits).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>GLEN</name>
                <description>Width of the Green Component (in bits).</description>
                <bitOffset>5</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>BPOS</name>
                <description>Location of the Blue Component inside the Pixel Memory Word (in bits).</description>
                <bitOffset>9</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>BLEN</name>
                <description>Width of the Blue Component (in bits).</description>
                <bitOffset>14</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PSIZE</name>
                <description>Pixel Size (in Bytes).</description>
                <bitOffset>18</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LTDC_L2C0R</name>
            <displayName>LTDC_L2C0R</displayName>
            <description>LTDC Layerx configuration 0 register</description>
            <addressOffset>0x200</addressOffset>
            <size>0x20</size>
            <resetValue>0xFF50A076</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CKTA</name>
                <description>color key transparency ability</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFBDA</name>
                <description>color frame buffer duplication ability</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFBPA</name>
                <description>color frame buffer pitch ability</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>APA</name>
                <description>alpha plane ability</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DCP</name>
                <description>default color programmability</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>WINA</name>
                <description>windowing ability</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CLUTA</name>
                <description>CLUT ability</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CKRA</name>
                <description>color key replace ability</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>F21</name>
                <description>blending factor 2, ability for: 1.0</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>F20</name>
                <description>blending factor 2, ability for: 0.0</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>F2P</name>
                <description>blending factor 2, ability for: pixel_alpha</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>F21P</name>
                <description>blending factor 2, ability for: 1.0 - pixel_alpha</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>F2C</name>
                <description>blending factor 2, ability for: constant_alpha</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>F21C</name>
                <description>blending factor 2, ability for: 1.0 - constant_alpha</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>F2PC</name>
                <description>blending factor 2, ability for: pixel_alpha * constant_alpha</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>F21PC</name>
                <description>blending factor 2, ability for: 1.0 - (pixel_alpha * constant_alpha)</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>F11</name>
                <description>blending factor 1, ability for: 1.0</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>F10</name>
                <description>blending factor 1,ability for: 0.0</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>F1P</name>
                <description>blending factor 1, ability for: pixel_alpha</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>F11P</name>
                <description>blending factor 1, ability for: 1.0 - pixel_alpha</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>F1C</name>
                <description>blending factor 1, ability for: constant_alpha</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>F11C</name>
                <description>blending factor 1, ability for: 1.0 - constant_alpha</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>F1PC</name>
                <description>blending factor 1, ability for: pixel_alpha * constant_alpha</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>F11PC</name>
                <description>blending factor 1, ability for: 1.0 - (pixel_alpha * constant_alpha)</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>FF</name>
                <description>flexible pixel format, ability</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>RGB888</name>
                <description>pixel format, ability for rgb888</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>BGR565</name>
                <description>pixel format, ability for bgr565</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>RGB565</name>
                <description>pixel format, ability for rgb565</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>BGRA888</name>
                <description>pixel format, ability for bgra8888</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>RGBA8888</name>
                <description>pixel format, ability for rgba8888</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ABGR8888</name>
                <description>pixel format, ability for abgr8888</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ARGB8888</name>
                <description>pixel format, ability for argb8888</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LTDC_L2C1R</name>
            <displayName>LTDC_L2C1R</displayName>
            <description>LTDC Layerx configuration 1 register</description>
            <addressOffset>0x204</addressOffset>
            <size>0x20</size>
            <resetValue>0x80000007</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>YIA</name>
                <description>YCbCr 422 interleaved ability for that layer</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>interleaved not available</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>interleaved available</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>YSPA</name>
                <description>YCbCr 420 semi-planar ability for that layer</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>semi-planar not available</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>semi-planar available</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>YFPA</name>
                <description>YCbCr 420 full-planar ability for that layer</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>full planar not available</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>full planar available</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SCA</name>
                <description>scaling ability for that layer</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>scaling not available</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>scaling available</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
