STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>LTDC_L2RCR</name>
            <displayName>LTDC_L2RCR</displayName>
            <description>LTDC Layerx reload control register</description>
            <addressOffset>0x208</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>IMR</name>
                <description>immediate reload trigger
This bit is set by software and cleared only by hardware after reload.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>no effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The shadow registers are reloaded immediately.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VBR</name>
                <description>vertical blanking reload request
This bit is set by software and cleared only by hardware after reload (it cannot be cleared through register write once it is set).</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>no effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The shadow registers are reloaded during the vertical blanking period (at the beginning of the first line after the active display area).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GRMSK</name>
                <description>shadow reload control, global (centralized) reload masked
This bit is set and cleared by software.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>global reload active for this layer (control from LTDC_SRCR enabled)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>global reload masked for this layer (control from LTDC_SRCR disabled)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LTDC_L2CR</name>
            <displayName>LTDC_L2CR</displayName>
            <description>LTDC Layerx control register</description>
            <addressOffset>0x20c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LEN</name>
                <description>layer enable: the bit is used to enable/disable the presence of this whole layer.
This bit is set and cleared by software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>layer disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>layer enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CKEN</name>
                <description>color keying enable
This bit is set and cleared by software.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>color keying disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>color keying enabled: if RGB matches, then the ARGB are set to 0.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLUTEN</name>
                <description>color look-up table enable
This bit is set and cleared by software.
The CLUT is only meaningful for L8, AL44 and AL88 pixel format.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>color look-up table disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>color look-up table enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HMEN</name>
                <description>horizontal mirroring enable
This bit is set and cleared by software.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>mirror disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>mirror enabled (if so, the color frame buffer start address has to be set to the last byte of the first line, so for instance: if line is 100 pixels, 24 bpp, then address is set to 299)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DCBEN</name>
                <description>default color blending enable
This bit is set and cleared by software.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>blending disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>blending enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LTDC_L2WHPCR</name>
            <displayName>LTDC_L2WHPCR</displayName>
            <description>LTDC Layerx window horizontal position configuration register</description>
            <addressOffset>0x210</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>WHSTPOS</name>
                <description>window horizontal start position
This field configures the first visible pixel of a line of the layer window.
WHSTPOS[15:0] must be less than or equal to AAW[15:0] bits (programmed in LTDC_AWCR).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>WHSPPOS</name>
                <description>window horizontal stop position
This field configures the last visible pixel of a line of the layer window.
WHSPPOS[15:0] must be great than or equal to  AHBP[15:0] bits + 1 (programmed in LTDC_BPCR).</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LTDC_L2WVPCR</name>
            <displayName>LTDC_L2WVPCR</displayName>
            <description>LTDC Layerx window vertical position configuration register</description>
            <addressOffset>0x214</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>WVSTPOS</name>
                <description>window vertical start position
This field configures the first visible line of the layer window.
WVSTPOS[15:0] must be less than or equal to AAH[15:0] bits (programmed in LTDC_AWCR).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>WVSPPOS</name>
                <description>window vertical stop position
This field configures the last visible line of the layer window.
WVSPPOS[11:0] must be great than or equal to  AVBP[15:0] bits + 1 (programmed in LTDC_BPCR).</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LTDC_L2CKCR</name>
            <displayName>LTDC_L2CKCR</displayName>
            <description>LTDC Layerx color keying configuration register</description>
            <addressOffset>0x218</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CKBLUE</name>
                <description>color key blue value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CKGREEN</name>
                <description>color key green value</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CKRED</name>
                <description>color key red value</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LTDC_L2PFCR</name>
            <displayName>LTDC_L2PFCR</displayName>
            <description>LTDC Layerx pixel format configuration register</description>
            <addressOffset>0x21c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PF</name>
                <description>pixel format
This field configures the pixel format.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>ARGB8888 (32 bpp)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>ABGR888 (32 bpp)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>RGBA888 (32 bpp)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>BGRA8888 (32 bpp)</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>RGB565 (16 bpp, A = 255)</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x5</name>
                    <description>BGR565 (16 bpp, A = 255)</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x6</name>
                    <description>RGB888 (24 bpp packed, A = 255)</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7</name>
                    <description>Flexible pixel format selected (see Section 54.7.50 and Section 54.7.51)</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LTDC_L2CACR</name>
            <displayName>LTDC_L2CACR</displayName>
            <description>LTDC Layerx constant alpha configuration register</description>
            <addressOffset>0x220</addressOffset>
            <size>0x20</size>
            <resetValue>0x000000FF</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CONSTA</name>
                <description>constant alpha
This field configures the constant alpha used for blending. The constant alpha is divided by 255 by hardware.
Example: if the programmed constant alpha is 0xFF, the floating alpha value is 255 / 255 = 1.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LTDC_L2DCCR</name>
            <displayName>LTDC_L2DCCR</displayName>
            <description>LTDC Layerx default color configuration register</description>
            <addressOffset>0x224</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DCBLUE</name>
                <description>default color blue
This field configures the default blue value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DCGREEN</name>
                <description>default color green
This field configures the default green value.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DCRED</name>
                <description>default color red
This field configures the default red value.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DCALPHA</name>
                <description>default color alpha
This field configures the default alpha value.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LTDC_L2BFCR</name>
            <displayName>LTDC_L2BFCR</displayName>
            <description>LTDC Layerx blending factors configuration register</description>
            <addressOffset>0x228</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000607</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BF2</name>
                <description>blending factor 2
This field selects the blending factor F2
others: reserved</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x5</name>
                    <description>1 - constant alpha</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7</name>
                    <description>1 - (pixel alpha x constant alpha)</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BF1</name>
                <description>blending factor 1
This field selects the blending factor F1.
others: reserved</description>
                <bitOffset>8</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>constant alpha</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x6</name>
                    <description>pixel alpha x constant alpha</description>
                    <value>0x6</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BOR</name>
                <description>blending order
This bit defines the blending order of the layer. If two layers have the same BOR value, the layer with the highest index is on the foreground.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>layer set in background</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>layer set in foreground</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LTDC_L2BLCR</name>
            <displayName>LTDC_L2BLCR</displayName>
            <description>LTDC Layerx burst length configuration register</description>
            <addressOffset>0x22c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BL</name>
                <description>burst length
others: reserved</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>maximum burst length (16 words 64 bits, thus 128 Bytes)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>1 word (of 64 bits) per burst</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x10</name>
                    <description>16 words (of 64 bits) per burst</description>
                    <value>0x10</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
