STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>LTDC_L2PCR</name>
            <displayName>LTDC_L2PCR</displayName>
            <description>LTDC Layerx planar configuration register</description>
            <addressOffset>0x230</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>YCEN</name>
                <description>YCbCr-to-RGB conversion enable</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>conversion disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>YCbCr conversion enabled, using the YCM setting above</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>YCM</name>
                <description>YCbCr conversion mode
Defines the type of input that is considered and converted to a YCbCr 444.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>interleaved 422 (Cb and Cr component are replicated horizontally for pixels P and P+1)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>semi-Planar 420: (Cb and Cr component are replicated horizontally and vertically.The layer main configuration defines the access to the Y buffer, and auxiliary registers define the access to the Cb and Cr buffers).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>full-Planar 420: (Cb and Cr component are replicated horizontally and vertically. The layer main configuration defines the access to the Y buffer, and auxiliary registers define the access to the Cb and Cr buffers).</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>YF</name>
                <description>Y component first
Defines if the byte 0 of a word (in LSB) contains the Y component.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Y component disabled (thus Cr or Cb component is on byte 0)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Y component enabled (thus Y component is on byte 0)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CBF</name>
                <description>Cb component first
Defines if the byte 0 and 1 of a word (in LSB) contains the Cb component. The setting impacts only for interleaved and semi-planar modes, as it has no meaning in full-planar mode.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Cb disabled (thus Cr component is on byte 0 and 1)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Cb enabled (thus Cb component is on byte 0 and 1)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OF</name>
                <description>Odd pixel first
Defines if the byte 0 of a word (in LSB) contains the odd pixel.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>odd pixel disabled (thus even pixel on byte 0)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>odd pixel enabled (thus odd pixel on byte 0)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>YREN</name>
                <description>Y rescale enable for the color dynamic range
When enabled, incoming Y values in range 16 to 235, are re-scaled to range 0 to 255.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>rescaling disabled (input component thus assumed provided in 0 to 255)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>rescaling enabled (input component thus assumed provided in 16 to 235).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LTDC_L2CFBAR</name>
            <displayName>LTDC_L2CFBAR</displayName>
            <description>LTDC Layerx color frame buffer address register</description>
            <addressOffset>0x234</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CFBADD</name>
                <description>color frame buffer start address
This field defines the color frame buffer start address.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LTDC_L2CFBLR</name>
            <displayName>LTDC_L2CFBLR</displayName>
            <description>LTDC Layerx color frame buffer length register</description>
            <addressOffset>0x238</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CFBLL</name>
                <description>color frame buffer line length
This field defines the length of one line of pixels in bytes + 7.
The line length is computed as follows: active high width *  number of bytes per pixel + 7.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CFBP</name>
                <description>color frame buffer pitch in bytes
This field defines the pitch that is the increment from the start of one line of pixels to the start of the next line in bytes.
Negative values (with MSB bit = 1) are allowed, to read the buffer from bottom to top, and thus to flip is vertically. When vertically flipped, as the address register must provide the address of the first line to be read, the address register must point to the start of the bottom line of the buffer.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LTDC_L2CFBLNR</name>
            <displayName>LTDC_L2CFBLNR</displayName>
            <description>LTDC Layerx color frame buffer line number register</description>
            <addressOffset>0x23c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CFBLNBR</name>
                <description>frame buffer line number
This field defines the number of lines in the frame buffer that corresponds to the active high width.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LTDC_L2CLUTWR</name>
            <displayName>LTDC_L2CLUTWR</displayName>
            <description>LTDC Layerx CLUT write register</description>            
            <addressOffset>0x250</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BLUE</name>
                <description>blue value
This field configures the blue value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>green value
This field configures the green value.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>red value
This field configures the red value.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CLUTADD</name>
                <description>CLUT address
This field configures the CLUT address (color position within the CLUT) of each RGB value.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>		  
          <register>
            <name>LTDC_L2CYR0R</name>
            <displayName>LTDC_L2CYR0R</displayName>
            <description>LTDC Layerx conversion YCbCr RGB 0 register</description>
            <addressOffset>0x26c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CR2R</name>
                <description>Cr-to-Red coefficient, with bits 9:8 as positive integer and 7:0 as decimals.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CB2B</name>
                <description>Cb-to-Blue coefficient, with bits 9:8 as positive integer and 7:0 as decimals.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LTDC_L2CYR1R</name>
            <displayName>LTDC_L2CYR1R</displayName>
            <description>LTDC Layerx conversion YCbCr RGB 1 register</description>
            <addressOffset>0x270</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CR2G</name>
                <description>Cr-to-Green coefficient, with bits 9:8 as positive integer and 7:0 as decimals.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CB2G</name>
                <description>Cb-to-Green coefficient, with bits 9:8 as positive integer and 7:0 as decimals.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LTDC_L2FPF0R</name>
            <displayName>LTDC_L2FPF0R</displayName>
            <description>LTDC Layerx flexible pixel format 0 register</description>
            <addressOffset>0x274</addressOffset>
            <size>0x20</size>
            <resetValue>0x00011100</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>APOS</name>
                <description>Location of the Alpha component inside the pixel memory word (in bits)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ALEN</name>
                <description>Width of the Alpha component (in bits)</description>
                <bitOffset>5</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RPOS</name>
                <description>Location of the Red component inside the pixel memory word (in bits)</description>
                <bitOffset>9</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RLEN</name>
                <description>Width of the Red component (in bits)</description>
                <bitOffset>14</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LTDC_L2FPF1R</name>
            <displayName>LTDC_L2FPF1R</displayName>
            <description>LTDC Layerx flexible pixel format 1 register</description>
            <addressOffset>0x278</addressOffset>
            <size>0x20</size>
            <resetValue>0x00093110</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>GPOS</name>
                <description>Location of the Green Component inside the Pixel Memory Word (in bits).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>GLEN</name>
                <description>Width of the Green Component (in bits).</description>
                <bitOffset>5</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>BPOS</name>
                <description>Location of the Blue Component inside the Pixel Memory Word (in bits).</description>
                <bitOffset>9</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>BLEN</name>
                <description>Width of the Blue Component (in bits).</description>
                <bitOffset>14</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PSIZE</name>
                <description>Pixel Size (in Bytes).</description>
                <bitOffset>18</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>		  
          <register>
            <name>LTDC_L3FPF1R</name>
            <displayName>LTDC_L3FPF1R</displayName>
            <description>LTDC Layerx flexible pixel format 1 register</description>
            <addressOffset>0x378</addressOffset>
            <size>0x20</size>
            <resetValue>0x00093110</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>GPOS</name>
                <description>Location of the Green Component inside the Pixel Memory Word (in bits).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>GLEN</name>
                <description>Width of the Green Component (in bits).</description>
                <bitOffset>5</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>BPOS</name>
                <description>Location of the Blue Component inside the Pixel Memory Word (in bits).</description>
                <bitOffset>9</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>BLEN</name>
                <description>Width of the Blue Component (in bits).</description>
                <bitOffset>14</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PSIZE</name>
                <description>Pixel Size (in Bytes).</description>
                <bitOffset>18</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
