STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
        </registers>
    </peripheral>
	<peripheral>
        <name>MCE</name>
        <description>MCE</description>
		<groupName>MCE</groupName>
        <baseAddress>0x58001000</baseAddress>
		<addressBlock>
          <offset>0x0</offset>
          <size>0x0400</size>
          <usage>registers</usage>
        </addressBlock>
		<interrupt>
          <name>MCE</name>
          <description>MCE interrupt</description>
          <value>139</value>
        </interrupt>
        <registers>
          <register>
            <name>MCE_CR</name>
            <displayName>MCE_CR</displayName>
            <description>MCE configuration register </description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>GLOCK</name>
                <description>Global lock
Lock the configuration of most MCE registers until next reset. This bit is cleared by default and once set it cannot be reset until MCE reset.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>MCE registers are writable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>All writes to MCE registers are ignored, with the exception of MCE_IACR and MCE_IAIER registers.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MKLOCK</name>
                <description>Master keys lock
Lock the master key configurations until next reset. This bit is cleared by default and once set it cannot be reset until MCE reset.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writes to MCE_MKEYRx register is allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writes to MCE_MKEYRx register is ignored until next MCE reset.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MCE_SR</name>
            <displayName>MCE_SR</displayName>
            <description>MCE status register </description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MKVALID</name>
                <description>Master key valid</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>A valid key has not been written in MCE_MKEYRx registers</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>A valid key has been written in MCE_MKEYRx registers (write R0 -&gt; R1 -&gt; R2 -&gt; R3 or the reverse)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENCDIS</name>
                <description>encryption disabled
This bit is set by hardware when the encryption feature is not functional.
When ENCDIS is set application must reset MCE peripheral to be able to use the encryption feature again.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>When ENC bit and BREN are set in MCE_REGCR all allowed write accesses are encrypted, and all allowed read requests are decrypted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>When ENC bit and BREN are set in MCE_REGCR all write accesses are ignored, and all read requests return zero. All previously written key material are also erased.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MCE_IASR</name>
            <displayName>MCE_IASR</displayName>
            <description>MCE illegal access status register </description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CAEF</name>
                <description>Configuration access error flag
This bit is set when an illegal access to any MCE configuration register is detected. Bit is cleared by setting corresponding bit in MCE_IACR register. No additional details on the error is available.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MCE_IACR</name>
            <displayName>MCE_IACR</displayName>
            <description>MCE illegal access clear register </description>
            <addressOffset>0xc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CAEF</name>
                <description>Configuration access error flag clear
Set this bit to clear CAEF bit in MCE_IASR register.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MCE_IAIER</name>
            <displayName>MCE_IAIER</displayName>
            <description>MCE illegal access interrupt enable register </description>
            <addressOffset>0x10</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CAEIE</name>
                <description>Configuration access error interrupt enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Interrupt generation on configuration access errors is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Interrupt generation when a configuration access error occurs (CAEF=1)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MCE_PRIVCFGR</name>
            <displayName>MCE_PRIVCFGR</displayName>
            <description>MCE privileged configuration register </description>
            <addressOffset>0x1c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIV</name>
                <description>Privileged configuration</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Privileged and unprivileged access are granted to MCE registers</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Only privileged access are granted to MCE registers, excluding ID registers (MCE_HWCFGR1/2, MCE_VERR, MCE_IPIDR, MCE_SIDR)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MCE_REGCR</name>
            <displayName>MCE_REGCR</displayName>
            <description>MCE region x configuration register </description>
            <addressOffset>0x40</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BREN</name>
                <description>Base region enable
BREN cannot be set if BADDRSTART &gt; BADDREND.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Region is disabled. Access control of primary region (any-privilege, no encryption) applies to any access between this region start and end addresses.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Region is enable. Access controls and encryption option defined in this region apply to any access between this region start and end addresses.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENC</name>
                <description>Encrypted region
This bit is taken into account only if BREN is set.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No effects</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>All allowed read (resp. write) requests are decrypted (resp. encrypted) using the block cipher. If MKVALID=0 bypass mode is selected instead.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MCE_SADDR</name>
            <displayName>MCE_SADDR</displayName>
            <description>MCE start address register </description>
            <addressOffset>0x44</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BADDSTART</name>
                <description>Region address start
This bitfield defines the absolute start address of the region on 64 kBytes boundary (inclusive).
BREN cannot be set if BADDRSTART &gt; BADDREND.
When MCE determines the region, the first 16 bits (LSB) and the last 2 bits (MSB) in this register are ignored, and when this register is accessed in read the 2 MSB bits and the 16 LSB bits return zeros (reference value in MCE).</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MCE_EADDR</name>
            <displayName>MCE_EADDR</displayName>
            <description>MCE end address register </description>
            <addressOffset>0x48</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000FFFF</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BADDEND</name>
                <description>Region address end
This bitfield defines the absolute end address of the region on 64 kBytes boundary (inclusive).
BREN cannot be set if BADDRSTART &gt; BADDREND.
When MCE determines the region, the first 16 bits (LSB) and the last 2 bits (MSB) in this register are ignored, and when this register is accessed in read the 2 MSB bits return zeros and the 16 LSB bits return ones (reference value in MCE).</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MCE_MKEYR0</name>
            <displayName>MCE_MKEYR0</displayName>
            <description>MCE master key 0 </description>
            <addressOffset>0x200</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MKEY</name>
                <description>Master key, bits [31:0]
This key is used by the MCE block cipher</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MCE_MKEYR1</name>
            <displayName>MCE_MKEYR1</displayName>
            <description>MCE master key 1 </description>
            <addressOffset>0x204</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MKEY</name>
                <description>Master key, bits [63:32]
This key is used by the MCE block cipher</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MCE_MKEYR2</name>
            <displayName>MCE_MKEYR2</displayName>
            <description>MCE master key 2 </description>
            <addressOffset>0x208</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MKEY</name>
                <description>Master key, bits [95:64]
This key is used by the MCE block cipher</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MCE_MKEYR3</name>
            <displayName>MCE_MKEYR3</displayName>
            <description>MCE master key 3 </description>
            <addressOffset>0x20c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MKEY</name>
                <description>Master key, bits [127:96]
This key is used by the MCE block cipher</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MCE_HWCFGR3</name>
            <displayName>MCE_HWCFGR3</displayName>
            <description>MCE version register </description>
            <addressOffset>0x3e8</addressOffset>
            <size>0x20</size>
            <resetValue>0x3B000102</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CFG1</name>
                <description>HW Generic 1
This field returns the generic value aes_core</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFG2</name>
                <description>HW Generic 2
This field returns the generic value nk_core</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFG3</name>
                <description>HW Generic 3
This field returns the generic value priv_enable</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFG4</name>
                <description>HW Generic 4
This field returns the generic value sec_enable</description>
                <bitOffset>12</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFG5</name>
                <description>HW Generic 5
This field returns the generic value rif_enable</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFG6</name>
                <description>HW Generic 6
This field returns the generic value priv_enable_axi</description>
                <bitOffset>20</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFG7</name>
                <description>HW Generic 7
This field returns the generic value id_size</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFG8</name>
                <description>HW Generic 8
This field returns the generic value ooo_enable | interconnect_enable</description>
                <bitOffset>28</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MCE_HWCFGR2</name>
            <displayName>MCE_HWCFGR2</displayName>
            <description>MCE version register </description>
            <addressOffset>0x3ec</addressOffset>
            <size>0x20</size>
            <resetValue>0x11071444</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CFG1</name>
                <description>HW Generic 1
This field returns the generic value burst_fifo_depth</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFG2</name>
                <description>HW Generic 2
This field returns the generic value info_fifo_depth</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFG3</name>
                <description>HW Generic 3
This field returns the generic value mask_fifo_depth</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFG4</name>
                <description>HW Generic 4
This field returns the generic value ilac_is_int</description>
                <bitOffset>12</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFG5</name>
                <description>HW Generic 5
This field returns the generic value nb_dpa_cycles</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFG6</name>
                <description>HW Generic 6
This field returns the generic value nb_cctx</description>
                <bitOffset>20</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFG7</name>
                <description>HW Generic 7
This field returns the generic value nb_mkey</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFG8</name>
                <description>HW Generic 8
This field returns the generic value nb_breg</description>
                <bitOffset>28</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
