STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>OTG_DIEPTXF5</name>
            <displayName>OTG_DIEPTXF5</displayName>
            <addressOffset>0x114</addressOffset>
            <size>0x20</size>
            <resetValue>0x02000400</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>INEPTXSA</name>
                <description>IN endpoint FIFOx transmit RAM start address
This field contains the memory start address for IN endpoint transmit FIFOx. The address must be aligned with a 32-bit memory location.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INEPTXFD</name>
                <description>IN endpoint Tx FIFO depth
This value is in terms of 32-bit words.
Minimum value is 16</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OTG_DIEPTXF6</name>
            <displayName>OTG_DIEPTXF6</displayName>
            <addressOffset>0x118</addressOffset>
            <size>0x20</size>
            <resetValue>0x02000400</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>INEPTXSA</name>
                <description>IN endpoint FIFOx transmit RAM start address
This field contains the memory start address for IN endpoint transmit FIFOx. The address must be aligned with a 32-bit memory location.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INEPTXFD</name>
                <description>IN endpoint Tx FIFO depth
This value is in terms of 32-bit words.
Minimum value is 16</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OTG_DIEPTXF7</name>
            <displayName>OTG_DIEPTXF7</displayName>
            <addressOffset>0x11c</addressOffset>
            <size>0x20</size>
            <resetValue>0x02000400</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>INEPTXSA</name>
                <description>IN endpoint FIFOx transmit RAM start address
This field contains the memory start address for IN endpoint transmit FIFOx. The address must be aligned with a 32-bit memory location.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INEPTXFD</name>
                <description>IN endpoint Tx FIFO depth
This value is in terms of 32-bit words.
Minimum value is 16</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OTG_DIEPTXF8</name>
            <displayName>OTG_DIEPTXF8</displayName>
            <addressOffset>0x120</addressOffset>
            <size>0x20</size>
            <resetValue>0x02000400</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>INEPTXSA</name>
                <description>IN endpoint FIFOx transmit RAM start address
This field contains the memory start address for IN endpoint transmit FIFOx. The address must be aligned with a 32-bit memory location.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INEPTXFD</name>
                <description>IN endpoint Tx FIFO depth
This value is in terms of 32-bit words.
Minimum value is 16</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OTG_HCFG</name>
            <displayName>OTG_HCFG</displayName>
            <description>OTG host configuration register </description>
            <addressOffset>0x400</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>FSLSPCS</name>
                <description>FS/LS PHY clock select
Others: Reserved
Note: The FSLSPCS must be set on a connection event according to the speed of the connected device (after changing this bit, a software reset must be performed).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1_CORE_IN_FS_HOST_MODE</name>
                    <description>PHY clock is running at 48 MHz</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2_CORE_IN_LS_HOST_MODE</name>
                    <description>Select 6 MHz PHY clock frequency </description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FSLSS</name>
                <description>FS- and LS-only support
The application uses this bit to control the core's enumeration speed. Using this bit, the application can make the core enumerate as an FS host, even if the connected device supports HS traffic. Do not make changes to this field after initial programming.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DESCDMA</name>
                <description>Enable scatter/gather DMA in host mode
The application can set this bit during initialization to enable the Scatter/Gather DMA operation. This bit must be modified only once after a reset. The following combinations are available for programming:
OTG_GAHBCFG.DMAEN=0,OTG_HCFG.DESCDMA=0 =&gt; Slave mode
OTG_GAHBCFG.DMAEN=0,OTG_HCFG.DESCDMA=1 =&gt; Invalid
OTG_GAHBCFG.DMAEN=1,OTG_HCFG.DESCDMA=0 =&gt; Buffered DMA mode
OTG_GAHBCFG.DMAEN=1,OTG_HCFG.DESCDMA=1 =&gt; Scatter/Gather DMA mode</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FRLSTEN</name>
                <description>Frame list entries
The value in the register specifies the number of entries in the Frame list. This field is valid only in Scatter/Gather DMA mode.
2'b00: Reserved
2'b01: 8 Entries
2'b10: 16 Entries
2'b11: 32 Entries In non-Scatter/Gather</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PERSSCHEDENA</name>
                <description>Enable periodic scheduling
Applicable in host scatter/gather DMA mode only. Enables periodic scheduling within the core. Initially, the bit is res and the core does not process any periodic channels. As soon as this bit is set, the core gets ready to start scheduling periodic channels and sets OTG_HCFG.PERSCHEDSTAT. The setting of PERSCHEDSTAT indicates the core has enabled periodic scheduling. Once PERSSCHEDENA is set, the application is not supposed to reset the bit unless PERSCHEDSTAT is set. As soon as this bit is reset, the core gets ready to stop scheduling periodic channels and resets HCFG. PerSchedStat. In non-Scatter/Gather DMA mode, this bit is reserved.</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OTG_HFIR</name>
            <displayName>OTG_HFIR</displayName>
            <description>OTG host frame interval register </description>
            <addressOffset>0x404</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000EA60</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>FRIVL</name>
                <description>Frame interval
The value that the application programs to this field, specifies the interval between two consecutive micro-SOFs (HS) or Keep-Alive tokens (LS). This field contains the number of PHY clocks that constitute the required frame interval. The application can write a value to this register only after the port enable bit of the host port control and status register (PENA bit in OTG_HPRT) has been set. If no value is programmed, the core calculates the value based on the PHY clock specified in the FS/LS PHY clock select field of the host configuration register (FSLSPCS in OTG_HCFG). Do not change the value of this field after the initial configuration, unless the RLDCTRL bit is set. In such case, the FRIVL is reloaded with each SOF event.
Frame interval = 125 1/4s  (FRIVL - 1)	in high speed operation
Frame interval = 1 ms  (FRIVL - 1)	in low/full speed operation</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RLDCTRL</name>
                <description>Reload control
This bit allows dynamic reloading of the HFIR register during run time.
This bit needs to be programmed during initial configuration and its value must not be changed during run time.
RLDCTRL = 0 is not recommended.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The HFIR cannot be reloaded dynamically</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The HFIR can be dynamically reloaded during run time.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>OTG_HFNUM</name>
            <displayName>OTG_HFNUM</displayName>
            <description>OTG host frame number/frame time remaining register	</description>
            <addressOffset>0x408</addressOffset>
            <size>0x20</size>
            <resetValue>0x00003FFF</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>FRNUM</name>
                <description>Frame number
This field increments when a new SOF is transmitted on the USB, and is cleared to 0 when it reaches 0x3FFF.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>FTREM</name>
                <description>Frame time remaining
Indicates the amount of time remaining in the current frame, in terms of PHY clocks. This field decrements on each PHY clock. When it reaches zero, this field is reloaded with the value in the Frame interval register and a new SOF is transmitted on the USB.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OTG_HPTXSTS</name>
            <displayName>OTG_HPTXSTS</displayName>
            <description>OTG_Host periodic transmit FIFO/queue status register	</description>
            <addressOffset>0x410</addressOffset>
            <size>0x20</size>
            <resetValue>0x00080100</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PTXFSAVL</name>
                <description>Periodic transmit data FIFO space available
Indicates the number of free locations available to be written to in the periodic Tx FIFO.
Values are in terms of 32-bit words
bxn: n words available (where 0  n  PTXFD)
Others: Reserved</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Periodic Tx FIFO is full</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>1 word available</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>2 words available</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PTXQSAV</name>
                <description>Periodic transmit request queue space available
Indicates the number of free locations available to be written in the periodic transmit request queue. This queue holds both IN and OUT requests.
Others: Reserved</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Periodic transmit request queue is full</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>1 location available</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>2 locations available</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>3 locations available</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x8</name>
                    <description>4 locations available</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x10</name>
                    <description>5 locations available</description>
                    <value>0x10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x20</name>
                    <description>6 locations available</description>
                    <value>0x20</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x40</name>
                    <description>7 locations available</description>
                    <value>0x40</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x80</name>
                    <description>8 locations available</description>
                    <value>0x80</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PTXQTOP</name>
                <description>Top of the periodic transmit request queue
This indicates the entry in the periodic Tx request queue that is currently being processed by the MAC.
This register is used for debugging.
Bit 31 = 0 send in even frame
Bit 31 = 1 send in odd frame
Bits 30:27: Channel/endpoint number
Bits 26:25 = 00: Type IN/OUT
Bits 26:25 = 01: Type Zero-length packet
Bits 26:25 = 11: disable channel command
Bit 24: Terminate (last entry for the selected channel/endpoint)</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OTG_HAINT</name>
            <displayName>OTG_HAINT</displayName>
            <description>OTG host all channels interrupt register </description>
            <addressOffset>0x414</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HAINT</name>
                <description>Channel interrupts
One bit per channel: Bit 0 for Channel 0, bit 15 for Channel 15</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OTG_HAINTMSK</name>
            <displayName>OTG_HAINTMSK</displayName>
            <description>OTG host all channels interrupt mask register	</description>
            <addressOffset>0x418</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HAINTM</name>
                <description>Channel interrupt mask
One bit per channel: Bit 0 for channel 0, bit 15 for channel 15</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Masked interrupt</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Unmasked interrupt</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>OTG_HFLBADDR</name>
            <displayName>OTG_HFLBADDR</displayName>
            <description>OTG host frame list base address register	</description>
            <addressOffset>0x41c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HFLBADDR</name>
                <description>The starting address of the frame list (scatter/gather mode).
This register is used only for isochronous and interrupt channels.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
