STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>PKA_VERR</name>
            <displayName>PKA_VERR</displayName>
            <description>PKA version register </description>
            <addressOffset>0x1ff4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000010</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MINREV</name>
                <description>Minor revision
This field returns the PKA minor version.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>MAJREV</name>
                <description>Major revision
This field returns the PKA major version.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PKA_IPIDR</name>
            <displayName>PKA_IPIDR</displayName>
            <description>PKA identification register </description>
            <addressOffset>0x1ff8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00170072</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ID</name>
                <description>Identification Code
This field returns the PKA identification code.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PKA_SIDR</name>
            <displayName>PKA_SIDR</displayName>
            <description>PKA size ID register </description>
            <addressOffset>0x1ffc</addressOffset>
            <size>0x20</size>
            <resetValue>0xA3C5DD08</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SID</name>
                <description>Size Identification Code
This field returns the size identification code of the PKA as defined below:
Bits[31:8] = 0xA3C5DD (fixed code)
Bits[7:0] = 0x08 (8 KB address decoding)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </registers>
    </peripheral>
	<peripheral>
        <name>PWR</name>
        <description>PWR</description>
		<groupName>PWR</groupName>
        <baseAddress>0x50001000</baseAddress>
        <addressBlock>
          <offset>0x0</offset>
          <size>0x400</size>
          <usage>registers</usage>
        </addressBlock>
        <registers>
          <register>
            <name>PWR_CR1</name>
            <displayName>PWR_CR1</displayName>
            <description>PWR control register 1 </description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000200</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LPDS</name>
                <description>Low Power Deepsleep Stop mode selection.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Stop mode selected, External regulator kept in Main power mode (pwr_lp = 1).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>low-power stop mode selected External regulator may enter Low-power mode (pwr_lp = 0). Further low power mode selection is provided by LVDS.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LPCFG</name>
                <description>PWR_ON pin configuration.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>PWR_ON pin signals Standby mode (PWR_ON =1 in Run, Stop, LP-Stop, LPLV-Stop, LPLV-Stop2 and 0 in Standby). </description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>PWR_ON pin signals Standby, LP-Stop, LPLV-Stop and LPLV-Stop2 modes (PWR_ON = 1 in Run, Stop, and 0 in LP-Stop, LPLV-Stop, LPLV-Stop2 and Standby).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LVDS</name>
                <description>Low Voltage Deepsleep LPLV-Stop mode selection.
This bit has only effect when the low power stop mode is selected in LPDS and changes the VDDCORE and VDDCPU domains supply reset level.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>LP-Stop mode VDDCORE and VDDCPU domains supply reset level at same level as Run mode. The VDDCORE and VDDCPU domains supply level in LP-Stop mode must be kept at same level as Run mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>LPLV-Stop mode VDDCORE and VDDCPU domains supply reset level at lower level than Run mode. Allows to lower VDDCORE and VDDCPU domains supply level in LPLV-Stop mode (see the datasheet for voltage levels).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>STOP2</name>
                <description>System LPLV-Stop2 mode selection</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Keeps System Stop mode when PDDS=0 and MPU enters CStop</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Allows System LPLV-Stop2 mode when PDDS = 0 </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PVDEN</name>
                <description>Programmable Voltage detector enable.
This bit is read only when the SYSCFG register bit PVDL is set (when PVDL is set, there is no bus errors generated when writing this register).</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Programmable Voltage detector disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Programmable Voltage detector enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PLS</name>
                <description>Programmable Voltage Detector level selection.
These bits are read only when the SYSCFG register bit PVDL is set (when PVDL is set, there is no bus errors generated when writing this register).
These bits select the voltage threshold detected by the PVD.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>1.95 V </description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>2.1 V </description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>2.25 V </description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>2.4 V </description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>2.55 V </description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x5</name>
                    <description>2.7 V </description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x6</name>
                    <description>2.85 V </description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7</name>
                    <description>External voltage level on PVD_IN (compared to internal VREFINT)</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DBP</name>
                <description>Disable backup domain write protection.
In reset state, the RCC_BDCR, PWR_CR2, RTC, and backup registers are protected against parasitic write access. This bit must be set to enable write access to these.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Write access to RTC and backup domain registers disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Write access to RTC and backup domain registers enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MPU_RAM_LOWSPEED</name>
                <description>Low speed selection for MPU memories
This bit must be reset by software when MPU needs to operate in Overdrive (High speed) mode
It must be set after decreasing the MPU frequency to operate in standard frequency range.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>MPU can operate in High speed mode (VDDCPU &gt; 1.2V)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>MPU can only operate in Low speed mode (VDDCPU  1.2 V) </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AVDEN</name>
                <description>Peripheral Voltage Monitor on VDDA enable.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Peripheral Voltage Monitor on VDDA disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Peripheral Voltage Monitor on VDDA enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ALS</name>
                <description>Analog Voltage Detector level selection.
These bits select the voltage threshold detected by the AVD.</description>
                <bitOffset>17</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>1.7V</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>2.1V</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>2.5V</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>2.8V</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PWR_CSR1</name>
            <displayName>PWR_CSR1</displayName>
            <description>PWR control status register 1 </description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PVDO</name>
                <description>Programmable Voltage Detect Output
This bit is set and cleared by hardware. It is valid only if PVD is enabled by the PVDEN bit.
Note: The PVD is disabled in Standby mode and after a system reset. For this reason, this bit is equal to 0 after Standby and system reset.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>VDD or voltage level on PVD_IN is equal or higher than the PVD threshold selected with the PLS[2:0] bits. </description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>VDD or voltage level on PVD_IN is lower than the PVD threshold selected with the PLS[2:0] bits.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AVDO</name>
                <description>Analog Voltage detector Output on VDDA.
This bit is set and cleared by hardware. It is valid only if AVD on VDDA is enabled by the AVDEN bit.
Note: The AVD is disabled in Standby mode and after system reset. For this reason, this bit is equal to 0 after Standby and reset.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>VDDA is equal or higher than the AVD threshold selected with the ALS[2:0] bits. </description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>VDDA is lower than the AVD threshold selected with the ALS[2:0] bits</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
