STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>PWR_CR3</name>
            <displayName>PWR_CR3</displayName>
            <description>PWR control register 3 </description>
            <addressOffset>0xc</addressOffset>
            <size>0x20</size>
            <resetValue>0x5000A000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VBE</name>
                <description>VBAT charging enable</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>VBAT battery charging disabled. </description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>VBAT battery charging enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VBRS</name>
                <description>VBAT charging resistor selection</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Charges VBAT through a 5 kOhm resistor. </description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Charges VBAT through a 1.5 kOhm resistor.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DDRSREN</name>
                <description>DDR self-refresh in standby mode enable
When set, the DDR PHY puts its pads in retention when entering Standby mode.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>DDR self-refresh retention when entering standby mode disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>DDR self-refresh retention when entering standby mode enabled (DDR self-refresh retention after Standby must be disabled by DDRSRDIS).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DDRSRDIS</name>
                <description>DDR self-refresh retention after standby disable
When written 'b1, the DDR PHY pads retention, enabled due to DDRSREN, is disabled.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No action</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>When DDRSREN is 'b1: Disable DDR self-refresh retention after standby mode. This bit is reset by hardware once DDR self-refresh retention has been disabled. When DRRSREN is 'b0 no action.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DDRRETEN</name>
                <description>DDR retention enable
Set by Hardware on NRST pad reset, when the reset delay control is enabled in the RCC_MP_APRSTCR.RDCTLEN register bit, or when written 'b1 by software, the DDR PHY puts its pads in retention.
To disable retention software must write this bit to 'b0.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>DDR self-refresh retention disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>DDR self-refresh retention enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VDDSD1DEN</name>
                <description>VDDSD1 voltage level detector enable
The voltage level detector is active by default. It enables the I/Os in the VDDSD1 domain if and when the VDDSD1 supply voltage is higher than VDDSDx_TH. Once the supply is stable above this threshold (VDDSD1RDY = 1), the level detectors can be switched off to save power, without disabling the I/Os, by setting VDDSD1VALID = 1 followed by VDDSD1EN = 0 (refer to datasheet for VDDSDx_TH value).</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>VDDSD1 level detector switched off. I/Os in VDDSD1 domain are also disabled if VDDSD1VALID = 0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>VDDSD1 level detector is active. I/Os in VDDSD1 domain are active if VDDSD1RDY = 1  </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VDDSD1RDY</name>
                <description>VDDSD1 supply ready
When the level detector is active (VDDSD1DEN = 1), this bit indicates if a voltage higher than VDDSDx_TH is present on the VDDSD1 supply (refer to datasheet for VDDSDx_TH value).</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>VDDSD1 supply not present, or voltage detector switched off (VDDSD1EN = 0)  </description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>VDDSD1 supply present</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VDDSD2DEN</name>
                <description>VDDSD2 voltage level detector enable
The voltage level detector is active by default. It enables the I/Os in the VDDSD2 domain if and when the VDDSD2 supply voltage is higher than VDDSDx_TH. Once the supply is stable above this threshold (VDDSD2RDY = 1), the level detectors can be switched off to save power, without disabling the I/Os, by setting VDDSD2VALID = 1 followed by VDDSD2EN = 0 (refer to datasheet for VDDSDx_TH value).</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>VDDSD2 level detector switched off. I/Os in VDDSD2 domain are also disabled if VDDSD2VALID = 0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>VDDSD2 level detector is active. I/Os in VDDSD2 domain are active if VDDSD2RDY = 1  </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VDDSD2RDY</name>
                <description>VDDSD2 supply ready
When the level detector is active (VDDSD2DEN = 1), this bit indicates if a voltage higher than VDDSDx_TH is present on the VDDSD2 supply (refer to datasheet for VDDSDx_TH value).</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>VDDSD2 supply not present, or voltage detector switched off (VDDSD2EN = 0)  </description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>VDDSD2 supply present</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>POPL</name>
                <description>PWR_ON, PWR_CPU_ON Standby pulse low configuration
These bits are set and cleared by software. They define the minimum guaranteed duration of the PWR_ON and PWR_CPU_ON low pulse in Standby mode (there is no impact on the LP-Stop and LPLV-Stop modes).
The LSI oscillator is automatically enabled when needed by the POPL pulse low configuration.
...</description>
                <bitOffset>17</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>~ 62.5 us guaranteed minimum low time (2 LSI cycles)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>~ 1 ms guaranteed minimum low time (1 x 32 LSI cycles)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>~ 2 ms guaranteed minimum low time (2 x 32 LSI cycles)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1F</name>
                    <description>~ 31 ms guaranteed minimum low time (31 x 32 LSI cycles)</description>
                    <value>0x1F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VDDSD1VALID</name>
                <description>Override VDDSD1 voltage detector
This bit enables the I/Os in the VDDSD1 domain whatever the state of VDDSD1RDY. This bit can be set by software once VDDSD1 is higher than VDDSDx_TH and stable (bit VDDSD1RDY = 1). Subsequently VDDSD1EN can be reset to 0 to disable the voltage detector and save power (refer to datasheet for VDDSDx_TH value).</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>I/O enable/disable is controlled by the VDDSD1 voltage detector</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>I/O enable is forced active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VDDSD2VALID</name>
                <description>Override VDDSD2 voltage detector
This bit enables the I/Os in the VDDSD2 domain whatever the state of VDDSD2RDY. This bit can be set by software once VDDSD2 is higher than VDDSDx_TH and stable (bit VDDSD2RDY = 1). Subsequently VDDSD2EN can be reset to 0 to disable the voltage detector and save power (refer to datasheet for VDDSDx_TH value).</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>I/O enable/disable is controlled by the VDDSD2 voltage detector</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>I/O enable is forced active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>USB33DEN</name>
                <description>USB 3.3V voltage level detector enable</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>USB 3.3V voltage level detector</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>USB 3.3V voltage level detector</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>USB33RDY</name>
                <description>USB 3.3V supply ready</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>USB 3.3V supply not ready</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>USB 3.3V supply ready</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REG18EN</name>
                <description>1V8 regulator enable</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>1V8 regulator disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>1V8 regulator enabled, when also pin BYPASS_REG1V8 is low (when in Standby mode the 1V8 regulator is disabled).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REG18RDY</name>
                <description>1V8 regulator supply ready</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>1V8 supply not ready</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>1V8 supply ready</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REG11EN</name>
                <description>1V1 regulator enable</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>1V1 regulator disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>1V1 regulator enabled (when in Standby mode the 1V1 regulator is disabled)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REG11RDY</name>
                <description>1V1 regulator supply ready</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>1V1 supply not ready</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>1V1 supply ready</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
