STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>PWR_WKUPCR</name>
            <displayName>PWR_WKUPCR</displayName>
            <description>PWR wakeup control register </description>
            <addressOffset>0x20</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>WKUPC1</name>
                <description>Clear Wakeup Flag for WKUPn pin, n range [6:1]
When TZEN is enabled in the RCC and WKUPENn in (PWR_MPUWKUPENR) is set, bit n can only be written by a secure access, a non-secure write on this bit is discarded.
When TZEN is disabled in the RCC or WKUPENn in (PWR_MPUWKUPENR) is clear, bit n can be written by a secure and non-secure access.
These bits are always read as 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing 1 clears the WKUPFn wakeup flag (the bit is cleared to 0 by hardware).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPC2</name>
                <description>Clear Wakeup Flag for WKUPn pin, n range [6:1]
When TZEN is enabled in the RCC and WKUPENn in (PWR_MPUWKUPENR) is set, bit n can only be written by a secure access, a non-secure write on this bit is discarded.
When TZEN is disabled in the RCC or WKUPENn in (PWR_MPUWKUPENR) is clear, bit n can be written by a secure and non-secure access.
These bits are always read as 0.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing 1 clears the WKUPFn wakeup flag (the bit is cleared to 0 by hardware).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPC3</name>
                <description>Clear Wakeup Flag for WKUPn pin, n range [6:1]
When TZEN is enabled in the RCC and WKUPENn in (PWR_MPUWKUPENR) is set, bit n can only be written by a secure access, a non-secure write on this bit is discarded.
When TZEN is disabled in the RCC or WKUPENn in (PWR_MPUWKUPENR) is clear, bit n can be written by a secure and non-secure access.
These bits are always read as 0.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing 1 clears the WKUPFn wakeup flag (the bit is cleared to 0 by hardware).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPC4</name>
                <description>Clear Wakeup Flag for WKUPn pin, n range [6:1]
When TZEN is enabled in the RCC and WKUPENn in (PWR_MPUWKUPENR) is set, bit n can only be written by a secure access, a non-secure write on this bit is discarded.
When TZEN is disabled in the RCC or WKUPENn in (PWR_MPUWKUPENR) is clear, bit n can be written by a secure and non-secure access.
These bits are always read as 0.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing 1 clears the WKUPFn wakeup flag (the bit is cleared to 0 by hardware).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPC5</name>
                <description>Clear Wakeup Flag for WKUPn pin, n range [6:1]
When TZEN is enabled in the RCC and WKUPENn in (PWR_MPUWKUPENR) is set, bit n can only be written by a secure access, a non-secure write on this bit is discarded.
When TZEN is disabled in the RCC or WKUPENn in (PWR_MPUWKUPENR) is clear, bit n can be written by a secure and non-secure access.
These bits are always read as 0.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing 1 clears the WKUPFn wakeup flag (the bit is cleared to 0 by hardware).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPC6</name>
                <description>Clear Wakeup Flag for WKUPn pin, n range [6:1]
When TZEN is enabled in the RCC and WKUPENn in (PWR_MPUWKUPENR) is set, bit n can only be written by a secure access, a non-secure write on this bit is discarded.
When TZEN is disabled in the RCC or WKUPENn in (PWR_MPUWKUPENR) is clear, bit n can be written by a secure and non-secure access.
These bits are always read as 0.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing 1 clears the WKUPFn wakeup flag (the bit is cleared to 0 by hardware).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPP1</name>
                <description>Wakeup Polarity bit for WKUPn pin, n range [6:1]
These bits define the polarity used for event detection on external wake-up WKUPn pin.
When TZEN is enabled in the RCC and WKUPENn in (PWR_MPUWKUPENR) is set, bit n can only be written by a secure access, a non-secure write on this bit is discarded.
When TZEN is disabled in the RCC or WKUPENn in (PWR_MPUWKUPENR) is clear, bit n can be written by a secure and non-secure access.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Detection on high level (rising edge) </description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Detection on low level (falling edge) </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPP2</name>
                <description>Wakeup Polarity bit for WKUPn pin, n range [6:1]
These bits define the polarity used for event detection on external wake-up WKUPn pin.
When TZEN is enabled in the RCC and WKUPENn in (PWR_MPUWKUPENR) is set, bit n can only be written by a secure access, a non-secure write on this bit is discarded.
When TZEN is disabled in the RCC or WKUPENn in (PWR_MPUWKUPENR) is clear, bit n can be written by a secure and non-secure access.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Detection on high level (rising edge) </description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Detection on low level (falling edge) </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPP3</name>
                <description>Wakeup Polarity bit for WKUPn pin, n range [6:1]
These bits define the polarity used for event detection on external wake-up WKUPn pin.
When TZEN is enabled in the RCC and WKUPENn in (PWR_MPUWKUPENR) is set, bit n can only be written by a secure access, a non-secure write on this bit is discarded.
When TZEN is disabled in the RCC or WKUPENn in (PWR_MPUWKUPENR) is clear, bit n can be written by a secure and non-secure access.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Detection on high level (rising edge) </description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Detection on low level (falling edge) </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPP4</name>
                <description>Wakeup Polarity bit for WKUPn pin, n range [6:1]
These bits define the polarity used for event detection on external wake-up WKUPn pin.
When TZEN is enabled in the RCC and WKUPENn in (PWR_MPUWKUPENR) is set, bit n can only be written by a secure access, a non-secure write on this bit is discarded.
When TZEN is disabled in the RCC or WKUPENn in (PWR_MPUWKUPENR) is clear, bit n can be written by a secure and non-secure access.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Detection on high level (rising edge) </description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Detection on low level (falling edge) </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPP5</name>
                <description>Wakeup Polarity bit for WKUPn pin, n range [6:1]
These bits define the polarity used for event detection on external wake-up WKUPn pin.
When TZEN is enabled in the RCC and WKUPENn in (PWR_MPUWKUPENR) is set, bit n can only be written by a secure access, a non-secure write on this bit is discarded.
When TZEN is disabled in the RCC or WKUPENn in (PWR_MPUWKUPENR) is clear, bit n can be written by a secure and non-secure access.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Detection on high level (rising edge) </description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Detection on low level (falling edge) </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPP6</name>
                <description>Wakeup Polarity bit for WKUPn pin, n range [6:1]
These bits define the polarity used for event detection on external wake-up WKUPn pin.
When TZEN is enabled in the RCC and WKUPENn in (PWR_MPUWKUPENR) is set, bit n can only be written by a secure access, a non-secure write on this bit is discarded.
When TZEN is disabled in the RCC or WKUPENn in (PWR_MPUWKUPENR) is clear, bit n can be written by a secure and non-secure access.</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Detection on high level (rising edge) </description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Detection on low level (falling edge) </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPPUPD1</name>
                <description>Wakeup pull configuration for WKUPn pin (n = 6 to 1)
These bits define the IO pad pull configuration used when WKUPENn = 1 (note that the associated GPIO port pull configuration must be set to the same value or 00). The wakeup pin pull configuration is maintained in Standby mode.
When TZEN is enabled in the RCC and WKUPENn in (PWR_MPUWKUPENR) is set, bit pair n can only be written by a secure access, a non-secure write on this bit pair is discarded.
When TZEN is disabled in the RCC or WKUPENn in (PWR_MPUWKUPENR) is clear, bit pair n can be written by a secure and non-secure access.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No pulls</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Pull-up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>Pull-down</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPPUPD2</name>
                <description>Wakeup pull configuration for WKUPn pin (n = 6 to 1)
These bits define the IO pad pull configuration used when WKUPENn = 1 (note that the associated GPIO port pull configuration must be set to the same value or 00). The wakeup pin pull configuration is maintained in Standby mode.
When TZEN is enabled in the RCC and WKUPENn in (PWR_MPUWKUPENR) is set, bit pair n can only be written by a secure access, a non-secure write on this bit pair is discarded.
When TZEN is disabled in the RCC or WKUPENn in (PWR_MPUWKUPENR) is clear, bit pair n can be written by a secure and non-secure access.</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No pulls</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Pull-up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>Pull-down</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPPUPD3</name>
                <description>Wakeup pull configuration for WKUPn pin (n = 6 to 1)
These bits define the IO pad pull configuration used when WKUPENn = 1 (note that the associated GPIO port pull configuration must be set to the same value or 00). The wakeup pin pull configuration is maintained in Standby mode.
When TZEN is enabled in the RCC and WKUPENn in (PWR_MPUWKUPENR) is set, bit pair n can only be written by a secure access, a non-secure write on this bit pair is discarded.
When TZEN is disabled in the RCC or WKUPENn in (PWR_MPUWKUPENR) is clear, bit pair n can be written by a secure and non-secure access.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No pulls</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Pull-up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>Pull-down</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPPUPD4</name>
                <description>Wakeup pull configuration for WKUPn pin (n = 6 to 1)
These bits define the IO pad pull configuration used when WKUPENn = 1 (note that the associated GPIO port pull configuration must be set to the same value or 00). The wakeup pin pull configuration is maintained in Standby mode.
When TZEN is enabled in the RCC and WKUPENn in (PWR_MPUWKUPENR) is set, bit pair n can only be written by a secure access, a non-secure write on this bit pair is discarded.
When TZEN is disabled in the RCC or WKUPENn in (PWR_MPUWKUPENR) is clear, bit pair n can be written by a secure and non-secure access.</description>
                <bitOffset>22</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No pulls</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Pull-up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>Pull-down</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPPUPD5</name>
                <description>Wakeup pull configuration for WKUPn pin (n = 6 to 1)
These bits define the IO pad pull configuration used when WKUPENn = 1 (note that the associated GPIO port pull configuration must be set to the same value or 00). The wakeup pin pull configuration is maintained in Standby mode.
When TZEN is enabled in the RCC and WKUPENn in (PWR_MPUWKUPENR) is set, bit pair n can only be written by a secure access, a non-secure write on this bit pair is discarded.
When TZEN is disabled in the RCC or WKUPENn in (PWR_MPUWKUPENR) is clear, bit pair n can be written by a secure and non-secure access.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No pulls</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Pull-up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>Pull-down</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPPUPD6</name>
                <description>Wakeup pull configuration for WKUPn pin (n = 6 to 1)
These bits define the IO pad pull configuration used when WKUPENn = 1 (note that the associated GPIO port pull configuration must be set to the same value or 00). The wakeup pin pull configuration is maintained in Standby mode.
When TZEN is enabled in the RCC and WKUPENn in (PWR_MPUWKUPENR) is set, bit pair n can only be written by a secure access, a non-secure write on this bit pair is discarded.
When TZEN is disabled in the RCC or WKUPENn in (PWR_MPUWKUPENR) is clear, bit pair n can be written by a secure and non-secure access.</description>
                <bitOffset>26</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No pulls</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Pull-up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>Pull-down</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
