STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          </register>
          <register>
            <name>PWR_WKUPFR</name>
            <displayName>PWR_WKUPFR</displayName>
            <description>PWR wakeup flag register </description>
            <addressOffset>0x24</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>WKUPF1</name>
                <description>Wakeup flag for WKUPn pin before enable, n range [6:1].
This bit is set by hardware and cleared only by a NRST Reset or by setting the WKUPCn bit in the</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No wakeup event occurred</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>A wakeup event was received from WKUPCn pin</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPF2</name>
                <description>Wakeup flag for WKUPn pin before enable, n range [6:1].
This bit is set by hardware and cleared only by a NRST Reset or by setting the WKUPCn bit in the</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No wakeup event occurred</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>A wakeup event was received from WKUPCn pin</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPF3</name>
                <description>Wakeup flag for WKUPn pin before enable, n range [6:1].
This bit is set by hardware and cleared only by a NRST Reset or by setting the WKUPCn bit in the</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No wakeup event occurred</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>A wakeup event was received from WKUPCn pin</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPF4</name>
                <description>Wakeup flag for WKUPn pin before enable, n range [6:1].
This bit is set by hardware and cleared only by a NRST Reset or by setting the WKUPCn bit in the</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No wakeup event occurred</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>A wakeup event was received from WKUPCn pin</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPF5</name>
                <description>Wakeup flag for WKUPn pin before enable, n range [6:1].
This bit is set by hardware and cleared only by a NRST Reset or by setting the WKUPCn bit in the</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No wakeup event occurred</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>A wakeup event was received from WKUPCn pin</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPF6</name>
                <description>Wakeup flag for WKUPn pin before enable, n range [6:1].
This bit is set by hardware and cleared only by a NRST Reset or by setting the WKUPCn bit in the</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No wakeup event occurred</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>A wakeup event was received from WKUPCn pin</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PWR_MPUWKUPENR</name>
            <displayName>PWR_MPUWKUPENR</displayName>
            <description>PWR MPU wakeup enable register </description>
            <addressOffset>0x28</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>WKUPEN1</name>
                <description>Enable Wakeup WKUPn pin and interrupt for MPU, n range [6:1]
Each bit is set and cleared by software.
When TZEN is enabled in the RCC, these bits can only be written by a secure access, a non-secure write is discarded.
When TZEN is disabled in the RCC, these bits can be written by a secure and non-secure access.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>An event on WKUPn pin does not wake up the system from Standby and Stop mode, nor generates an interrupt to MPU.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>A rising or falling edge on WKUPn pin wakes up the system from Standby and Stop mode and generates an interrupt to MPU.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPEN2</name>
                <description>Enable Wakeup WKUPn pin and interrupt for MPU, n range [6:1]
Each bit is set and cleared by software.
When TZEN is enabled in the RCC, these bits can only be written by a secure access, a non-secure write is discarded.
When TZEN is disabled in the RCC, these bits can be written by a secure and non-secure access.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>An event on WKUPn pin does not wake up the system from Standby and Stop mode, nor generates an interrupt to MPU.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>A rising or falling edge on WKUPn pin wakes up the system from Standby and Stop mode and generates an interrupt to MPU.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPEN3</name>
                <description>Enable Wakeup WKUPn pin and interrupt for MPU, n range [6:1]
Each bit is set and cleared by software.
When TZEN is enabled in the RCC, these bits can only be written by a secure access, a non-secure write is discarded.
When TZEN is disabled in the RCC, these bits can be written by a secure and non-secure access.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>An event on WKUPn pin does not wake up the system from Standby and Stop mode, nor generates an interrupt to MPU.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>A rising or falling edge on WKUPn pin wakes up the system from Standby and Stop mode and generates an interrupt to MPU.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPEN4</name>
                <description>Enable Wakeup WKUPn pin and interrupt for MPU, n range [6:1]
Each bit is set and cleared by software.
When TZEN is enabled in the RCC, these bits can only be written by a secure access, a non-secure write is discarded.
When TZEN is disabled in the RCC, these bits can be written by a secure and non-secure access.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>An event on WKUPn pin does not wake up the system from Standby and Stop mode, nor generates an interrupt to MPU.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>A rising or falling edge on WKUPn pin wakes up the system from Standby and Stop mode and generates an interrupt to MPU.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPEN5</name>
                <description>Enable Wakeup WKUPn pin and interrupt for MPU, n range [6:1]
Each bit is set and cleared by software.
When TZEN is enabled in the RCC, these bits can only be written by a secure access, a non-secure write is discarded.
When TZEN is disabled in the RCC, these bits can be written by a secure and non-secure access.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>An event on WKUPn pin does not wake up the system from Standby and Stop mode, nor generates an interrupt to MPU.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>A rising or falling edge on WKUPn pin wakes up the system from Standby and Stop mode and generates an interrupt to MPU.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPEN6</name>
                <description>Enable Wakeup WKUPn pin and interrupt for MPU, n range [6:1]
Each bit is set and cleared by software.
When TZEN is enabled in the RCC, these bits can only be written by a secure access, a non-secure write is discarded.
When TZEN is disabled in the RCC, these bits can be written by a secure and non-secure access.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>An event on WKUPn pin does not wake up the system from Standby and Stop mode, nor generates an interrupt to MPU.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>A rising or falling edge on WKUPn pin wakes up the system from Standby and Stop mode and generates an interrupt to MPU.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PWR_VER</name>
            <displayName>PWR_VER</displayName>
            <description>PWR IP version register </description>
            <addressOffset>0x3f4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000020</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MINREV</name>
                <description>Minor revision number</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>MAJREV</name>
                <description>Major revision number</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PWR_ID</name>
            <displayName>PWR_ID</displayName>
            <description>PWR IP identification register </description>
            <addressOffset>0x3f8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00010001</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>IPID</name>
                <description>IP identification</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PWR_SID</name>
            <displayName>PWR_SID</displayName>
            <description>PWR size ID register </description>
            <addressOffset>0x3fc</addressOffset>
            <size>0x20</size>
            <resetValue>0xA3C5DD01</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SID</name>
                <description>Size identification</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
