STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>RCC_MP_APRSTCR</name>
            <displayName>RCC_MP_APRSTCR</displayName>
            <description>RCC application reset control register</description>
            <addressOffset>0x108</addressOffset>
            <size>0x20</size>
            <resetValue>0x00007F00</resetValue>
            <fields>
              <field>
                <name>RDCTLEN</name>
                <description>Reset delay control enable
	             Set and reset by software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The RDCTL control block is bypassed (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The RDCTL control block is enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSTTO</name>
                <description>Reset timeout delay adjust</description>
                <bitOffset>8</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The timeout function is disabled </description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The timeout is set to 2 x 2HSIDIV us</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7F</name>
                    <description>The timeout is set to 128 x 2HSIDIV us (default after reset)</description>
                    <value>0x7F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_MP_APRSTSR</name>
            <displayName>RCC_MP_APRSTSR</displayName>
            <description>RCC application reset status register</description>
            <addressOffset>0x10C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RSTTOV</name>
                <description>Reset timeout delay value
					Set by hardware in order to give the value of the timeout counter. This function is only available when the RDCTLEN = '1'.
					If RSTTOS = '0' it means that a timeout occurred.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_PWRLPDLYCR</name>
            <displayName>RCC_PWRLPDLYCR</displayName>
            <description>RCC low-power Stop modes delay control register</description>
            <addressOffset>0x110</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PWRLP_DLY</name>
                <description>PWRLP_TEMPO value
				Written by software.
				This register contains the delay value to be observed before activating the PLLs and interconnect clocks, after one of the system Stop modes.
				The delay is counted with the HSI clock. The user has to take into account HSIDIV value.
				The delay value is given by the following formula: PWRLP_DLY[21:0] / FHSI
				...</description>
                <bitOffset>0</bitOffset>
                <bitWidth>22</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>the PWRLP_TEMPO delay is bypassed (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>a PWRLP_TEMPO delay of one period of HSI (at 64 MHz) is observed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3FFFFF</name>
                    <description>a PWRLP_TEMPO delay of about 65.5 milliseconds is observed</description>
                    <value>0x3FFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_MP_GRSTCSETR</name>
            <displayName>RCC_MP_GRSTCSETR</displayName>
            <description>RCC global reset control set register</description>
            <addressOffset>0x114</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>MPSYSRST</name>
                <description>System reset
             Set by software, cleared by hardware.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the block reset is released</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' generates a system reset, see Figure 3.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MPUP0RST</name>
                <description>MPU processor reset
			Set by software, cleared by hardware when the reset command is completed.
			Note that the Snoop Control Unit of the MPU (SCU) is not reset.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the block reset is released</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' generates a reset of the MPU processor 0, reading '1' means that the block reset is asserted</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_BR_RSTSCLRR</name>
            <displayName>RCC_BR_RSTSCLRR</displayName>
            <description>RCC BOOTROM reset status clear register</description>
            <addressOffset>0x118</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000015</resetValue>
            <fields>
              <field>
                <name>PORRSTF</name>
                <description>POR/PDR reset flag
              Cleared by software, set by hardware when a POR/PDR reset occurred.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that no POR/PDR reset occurred</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' clears the PORRSTF flag, reading '1' means that a POR/PDR reset occurred (default after por_rst reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BORRSTF</name>
                <description>BOR reset flag
             Cleared by software, set by hardware when a BOR reset occurred.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that no BOR reset occurred (default after por_rst reset)	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' clears the BORRSTF flag, reading '1' means that a BOR reset occurred</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PADRSTF</name>
                <description>NRST reset flag
            Cleared by software, set by hardware when a PAD reset occurred.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that no PAD reset occurred (default after por_rst reset)	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' clears the PADRSTF flag, reading '1' means that a PAD reset occurred</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HCSSRSTF</name>
                <description>HSE CSS reset flag
             Cleared by software, set by hardware when a failure is detected on HSE.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that no HSE CSS reset occurred (default after por_rst reset)	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' clears the HCSSRSTF flag, reading '1' means that a HSE CSS reset occurred</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VCORERSTF</name>
                <description>VDDCORE reset flag
             Cleared by software, set by hardware when a reset occurred because VDDCORE is lower than the expected value.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that VDDCORE is not the origin of the reset</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' clears the VCORERSTF flag, reading '1' means that VDDCORE is the origin of the reset (default after por_rst reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VCPURSTF</name>
                <description>VDDCPU reset flag
             Cleared by software, set by hardware when a reset occurred because VDDCPU is lower than the expected value.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that VDDCPU is not the origin of the reset</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' clears the VCPURSTF flag, reading '1' means that VDDCPU is the origin of the reset (default after por_rst reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MPSYSRSTF</name>
                <description>MPU System reset flag
             Cleared by software, set by hardware when a MPU system reset occurred.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that no system reset generated by the MPU occurred (default after por_rst reset)	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' clears the MPSYSRSTF flag, reading '1' means that a system reset generated by the MPU occurred</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IWDG1RSTF</name>
                <description>IWDG1 reset flag
              Cleared by software, set by hardware when a IWDG1 reset occurred.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that no IWDG1 reset occurred (default after por_rst reset)	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' clears the IWDG1RSTF flag, reading '1' means that a IWDG1 reset occurred</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IWDG2RSTF</name>
                <description>IWDG2 reset flag
             Cleared by software, set by hardware when a IWDG2 reset occurred.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that no IWDG2 reset occurred (default after por_rst reset)	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' clears the IWDG2RSTF flag, reading '1' means that a IWDG2 reset occurred</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MPUP0RSTF</name>
                <description>MPU processor reset flag
             Cleared by software, set by hardware when a MPU processor reset occurred.</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that no MPU processor reset occurred (default after nreset reset)	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' clears the MPUP0RSTF flag, reading '1' means that MPU processor reset occurred </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
