STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>RCC_MP_CIER</name>
            <displayName>RCC_MP_CIER</displayName>
            <description>RCC clock source interrupt enable register</description>
            <addressOffset>0x200</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>LSIRDYIE</name>
                <description>LSI ready Interrupt Enable
             If RCC_SECCFGR.LSISEC, a write access to this field must be secure. A read access may be secure or non-secure.
             Set and reset by software to enable/disable interrupt caused by the LSI oscillator stabilization.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>LSI ready interrupt disabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>LSI ready interrupt enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LSERDYIE</name>
                <description>LSE ready Interrupt Enable
            If RCC_SECCFGR.LSESEC, a write access to this field must be secure. A read access may be secure or non-secure.
            Set and reset by software to enable/disable interrupt caused by the LSE oscillator stabilization.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>LSE ready interrupt disabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>LSE ready interrupt enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HSIRDYIE</name>
                <description>HSI ready Interrupt Enable
             If RCC_SECCFGR.HSISEC, a write access to this field must be secure. A read access may be secure or non-secure.
             Set and reset by software to enable/disable interrupt caused by the HSI oscillator stabilization.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>HSI ready interrupt disabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>HSI ready interrupt enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HSERDYIE</name>
                <description>HSE ready Interrupt Enable
             If RCC_SECCFGR.HSESEC, a write access to this field must be secure. A read access may be secure or non-secure.
             Set and reset by software to enable/disable interrupt caused by the HSE oscillator stabilization.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>HSE ready interrupt disabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>HSE ready interrupt enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CSIRDYIE</name>
                <description>CSI ready Interrupt Enable
		     If RCC_SECCFGR.CSISEC, a write access to this field must be secure. A read access may be secure or non-secure.
		     Set and reset by software to enable/disable interrupt caused by the CSI oscillator stabilization.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>CSI ready interrupt disabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>CSI ready interrupt enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PLL1DYIE</name>
                <description>PLL1 ready Interrupt Enable
			If RCC_SECCFGR.PLL12SEC, a write access to this field must be secure. A read access may be secure or non-secure.
			Set and reset by software to enable/disable interrupt caused by PLL1 lock.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>PLL1 lock interrupt disabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>PLL1 lock interrupt enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PLL2DYIE</name>
                <description>PLL2 ready Interrupt Enable
			If RCC_SECCFGR.PLL12SEC, a write access to this field must be secure. A read access may be secure or non-secure.
			Set and reset by software to enable/disable interrupt caused by PLL2 lock.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>PLL2 lock interrupt disabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>PLL2 lock interrupt enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PLL3DYIE</name>
                <description>PLL3 ready Interrupt Enable
			If RCC_SECCFGR.PLL3SEC, a write access to this field must be secure. A read access may be secure or non-secure.
			Set and reset by software to enable/disable interrupt caused by PLL3 lock.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>PLL3 lock interrupt disabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>PLL3 lock interrupt enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PLL4DYIE</name>
                <description>PLL4 ready Interrupt Enable
			If RCC_SECCFGR.PLL4SEC, a write access to this field must be secure. A read access may be secure or non-secure.
			Set and reset by software to enable/disable interrupt caused by PLL4 lock.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>PLL4 lock interrupt disabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>PLL4 lock interrupt enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LSECSSIE</name>
                <description>LSE clock security system Interrupt Enable
			If RCC_SECCFGR.LSESEC, a write access to this field must be secure. A read access may be secure or non-secure.
			Set and reset by software to enable/disable interrupt caused by the Clock Security System on
			external 32 kHz oscillator.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>LSE CSS interrupt disabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>LSE CSS interrupt enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPIE</name>
                <description>Wake up from CStop Interrupt Enable
			If RCC_SECCFGR.STPSEC, a write access to this field must be secure. A read access may be secure or non-secure.
			Set and reset by software to enable/disable the generation of the interrupt used to wake up the MPU from CStop.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Wakeup interrupt disabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Wakeup interrupt enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
