STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>RCC_MP_CIFR</name>
            <displayName>RCC_MP_CIFR</displayName>
            <description>RCC clock source interrupt flag register</description>
            <addressOffset>0x204</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>LSIRDYF</name>
                <description>LSI ready Interrupt Flag
If RCC_SECCFGR.PLLSEC, a write access to this field must be secure. A read access may be secure or non-secure.
Reset by software by writing this flag to '1'.
Set by hardware when the LSI clock becomes stable.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No clock ready interrupt caused by the LSI (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Clock ready interrupt caused by the LSI, writing '1' clears this flag</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LSERDYF</name>
                <description>LSE ready Interrupt Flag
If RCC_SECCFGR.PLLSEC, a write access to this field must be secure. A read access may be secure or non-secure.
Reset by software by writing this flag to '1'.
Set by hardware when the LSE clock becomes stable.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No clock ready interrupt caused by the LSE (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Clock ready interrupt caused by the LSE, writing '1' clears this flag</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HSIRDYF</name>
                <description>HSI ready Interrupt Flag
If RCC_SECCFGR.PLLSEC, a write access to this field must be secure. A read access may be secure or non-secure.
Reset by software by writing this flag to '1'.
Set by hardware when the HSI clock becomes stable.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No clock ready interrupt caused by the HSI (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Clock ready interrupt caused by the HSI, writing '1' clears this flag</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HSERDYF</name>
                <description>HSE ready Interrupt Flag
If RCC_SECCFGR.PLLSEC, a write access to this field must be secure. A read access may be secure or non-secure.
Reset by software by writing this flag to '1'.
Set by hardware when the HSE clock becomes stable.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No clock ready interrupt caused by the HSE (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Clock ready interrupt caused by the HSE, writing '1' clears this flag</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CSIRDYF</name>
                <description>CSI ready Interrupt Flag
If RCC_SECCFGR.PLLSEC, a write access to this field must be secure. A read access may be secure or non-secure.
Reset by software by writing this flag to '1'.
Set by hardware when the CSI clock becomes stable.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No clock ready interrupt caused by the CSI (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Clock ready interrupt caused by the CSI, writing '1' clears this flag</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PLL1DYF</name>
                <description>PLL1 ready Interrupt Flag
If RCC_SECCFGR.PLLSEC, a write access to this field must be secure. A read access may be secure or non-secure.
Reset by software by writing this flag to '1'.
Set by hardware when the PLL1 locks.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No clock ready interrupt caused by PLL1 lock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Clock ready interrupt caused by PLL1 lock, writing '1' clears this flag</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PLL2DYF</name>
                <description>PLL2 ready Interrupt Flag
If RCC_SECCFGR.PLLSEC, a write access to this field must be secure. A read access may be secure or non-secure.
Reset by software by writing this flag to '1'.
Set by hardware when the PLL2 locks.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No clock ready interrupt caused by PLL2 lock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Clock ready interrupt caused by PLL2 lock, writing '1' clears this flag</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PLL3DYF</name>
                <description>PLL3 ready Interrupt Flag
If RCC_SECCFGR.PLLSEC, a write access to this field must be secure. A read access may be secure or non-secure.
Reset by software by writing this flag to '1'.
Set by hardware when the PLL3 locks.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No clock ready interrupt caused by PLL3 lock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Clock ready interrupt caused by PLL3 lock, writing '1' clears this flag</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PLL4DYF</name>
                <description>PLL4 ready Interrupt Flag
If RCC_SECCFGR.PLLSEC, a write access to this field must be secure. A read access may be secure or non-secure.
Reset by software by writing this flag to '1'.
Set by hardware when the PLL4 locks.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No clock ready interrupt caused by PLL4 lock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Clock ready interrupt caused by PLL4 lock, writing '1' clears this flag</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LSECSSF</name>
                <description>LSE clock security system Interrupt Flag
If RCC_SECCFGR.LSESEC, a write access to this field must be secure. A read access may be secure or non-secure.
Reset by software by writing this flag to '1'.
Set by hardware when a failure is detected on the external 32 kHz oscillator.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No failure detected on the external 32 kHz oscillator (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>A failure is detected on the external 32 kHz oscillator, writing '1' clears this flag</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WKUPF</name>
                <description>Wake up from CStop Interrupt Flag
If RCC_SECCFGR.STPSEC, a write access to this field must be secure. A read access may be secure or non-secure.
Reset by software by writing this flag to '1'.
Set by hardware when the MPU needs to exit from CStop.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No wakeup interrupt pending (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Wakeup interrupt pending, writing '1' clears this flag</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
