STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>RCC_BDCR</name>
            <displayName>RCC_BDCR</displayName>
            <description>RCC backup domain control register</description>
            <addressOffset>0x400</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000020</resetValue>
            <fields>
              <field>
                <name>LSEON</name>
                <description>LSE oscillator enabled
Set and reset by software.
If RCC_SECCFGR.LSESEC, a write access to this register field must be secure. A read access may be secure or non-secure.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>LSE oscillator OFF (default after backup domain reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>LSE oscillator ON</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LSEBYP</name>
                <description>LSE oscillator bypass
Set and reset by software to bypass oscillator in debug mode.
If RCC_SECCFGR.LSESEC, a write access to this register field must be secure. A read access may be secure or non-secure.
This bit must not be written when the LSE is enabled (LSEON = '1').
Refer to Stop. for details.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>LSE oscillator not bypassed (default after backup domain reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>LSE oscillator bypassed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LSERDY</name>
                <description>LSE oscillator ready
Set and reset by hardware to indicate when the LSE is stable. This bit needs 6 cycles of lse_ck clock to fall down after LSEON has been set to '0'.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>LSE oscillator not ready (default after backup domain reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>LSE oscillator ready</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIGBYP</name>
                <description>LSE digital bypass
Set and reset by software to select the analog or digital bypass mode.
If RCC_SECCFGR.LSESEC, a write access to this register field must be secure. A read access may be secure or non-secure.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The LSE is in analog bypass mode (default after backup domain reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The LSE is in digital bypass mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LSEDRV</name>
                <description>LSE oscillator driving capability
Written by software to select the driving capability of the LSE oscillator.
If RCC_SECCFGR.LSESEC, a write access to this register field must be secure. A read access may be secure or non-secure.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Lowest drive </description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Medium low drive</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>Medium high drive (default after backup domain reset)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>Highest drive</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LSECSSON</name>
                <description>LSE clock security system enable
Set by software to enable the Clock Security System on 32 kHz oscillator.
If RCC_SECCFGR.LSESEC, a write access to this register field must be secure. A read access may be secure or non-secure.
Refer to  for details on the activation and deactivation sequences.
Once the LSECSSON bit is enabled it cannot be disabled, except after a LSE failure detection (LSECSSD = '1').</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Clock Security System on 32 kHz oscillator OFF (default after backup domain reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Clock Security System on 32 kHz oscillator ON</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LSECSSD</name>
                <description>LSE clock security system failure detection
Set by hardware to indicate when a failure has been detected by the Clock Security System on the external 32 kHz oscillator.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No failure detected on 32 kHz oscillator (default after backup domain reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Failure detected on 32 kHz oscillator</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RTCSRC</name>
                <description>RTC clock source selection
Set by software to select the clock source for the RTC.
If at least one function of the RTC is configured as secure via the RTC_SECCFGR register (i.e. if the input signal rtc_sec driven by RTC is asserted), a write access to this register field must be secure. A read access may be secure or non-secure.
This field can be written only one time after backup domain reset.
When a LSE failure occurs, the RTCSRC[1:0] is set to '00', and the software is allowed to write it again once.
This field must be written before LSECSSON is enabled.
Refer to  for details.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No clock (default after backup domain reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>LSE clock used as RTC clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>LSI clock used as RTC clock</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>HSE clock divided by RTCDIV value is used as RTC clock</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RTCCKEN</name>
                <description>RTC clock enable
Set and reset by software.
If at least one function of the RTC is configured as secure via the RTC_SECCFGR register (i.e. if the input signal rtc_sec driven by RTC is asserted), a write access to this register field must be secure. A read access may be secure or non-secure.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>rtc_ck clock is disabled (default after backup domain reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>rtc_ck clock enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VSWRST</name>
                <description>VSW domain software reset
Set and reset by software.
If RCC_SECCFGR.RSTSEC, a write access to this field must be secure. A read access may be secure or non-secure.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>write: release the software reset; read: software reset not activated (default after backup domain reset)	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>write: reset the entire VSW domain; read: software reset activated</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_RDLSICR</name>
            <displayName>RCC_RDLSICR</displayName>
            <description>RCC reset duration and LSI control register</description>
            <addressOffset>0x404</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>LSION</name>
                <description>LSI oscillator enabled
Set and reset by software.
If RCC_SECCFGR.LSISEC, a write access to this field must be secure. A read access may be secure or non-secure.
This bit is used to request the activation of the LSI oscillator. Note that IWDG1 and IWDG2 can also request the activation of LSI.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>LSI oscillator is OFF if no other requester needs it, such as IWDG[2:1] (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>LSI oscillator ON</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LSIRDY</name>
                <description>LSI oscillator ready
Set and reset by hardware to indicate when the LSI is stable. This bit needs 3 cycles of lsi_ck clock to fall down after LSION has been set to '0'.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>LSI oscillator not ready (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>LSI oscillator ready</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MRD</name>
                <description>Minimum reset duration
Written by software.
If RCC_SECCFGR.RSTSEC, a write access to this field must be secure. A read access may be secure or non-secure.
This field defines the minimum guaranteed duration of the NRST low pulse. The LSI oscillator is automatically enabled when needed by the RPCTL.
...</description>
                <bitOffset>16</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>NRST low pulse duration is guaranteed by the pulse stretcher of the PAD. The RPCTL is bypassed (default after reset)	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The guaranteed NRST low pulse duration is about 1 ms (1 x 32 lsi_ck cycles),</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>The guaranteed NRST low pulse duration is about 2 ms (2 x 32 lsi_ck cycles),</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1F</name>
                    <description>The guaranteed NRST low pulse duration is about 31 ms (31 x 32 lsi_ck cycles).</description>
                    <value>0x1F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EADLY</name>
                <description>External access delays
Written by software.
If RCC_SECCFGR.RSTSEC, a write access to this field must be secure. A read access may be secure or non-secure.
Time to wait before the BOOTROM performs any external access (UART, USB, QUADSPI, FMC, SDMMC,...)</description>
                <bitOffset>24</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>10 ms (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>No extra delay added by the BOOTROM</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>100 us</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>200 us</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>500 us</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x5</name>
                    <description>1 ms</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x6</name>
                    <description>2 ms</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7</name>
                    <description>5 ms</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SPARE</name>
                <description>Spare bits
Written by software.
If RCC_SECCFGR.RSTSEC, a write access to this field must be secure. A read access may be secure or non-secure.
Reserved for future use.</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
