STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>RCC_OCENSETR</name>
            <displayName>RCC_OCENSETR</displayName>
            <description>RCC oscillator clock enable set register</description>
            <addressOffset>0x420</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>HSION</name>
                <description>Set HSION bit
Set by software to enable the HSI clock.
This bit must be written by a secure agent if the HSI clock is configured as secure (i.e. if RCC_SECCFGR.HSISEC=1).
The HSION is also set by hardware to force the HSI to ON when the product leaves Standby mode or one of the Stop modes.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Set the HSION bit</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HSIKERON</name>
                <description>Set HSIKERON bit
Set by software to force the HSI to ON, even in (LP-)Stop mode, in order to be quickly available as kernel clock for peripherals.
This bit must be written by a secure agent if the HSI clock is configured as secure (i.e. if RCC_SECCFGR.HSISEC=1).
This bit has no effect on the value of HSION.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Set the HSIKERON bit</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CSION</name>
                <description>Set CSION bit
Set by software to enable CSI clock.
This bit must be written by a secure agent if the CSI clock is configured as secure (i.e. if RCC_SECCFGR.CSISEC=1).</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Set the CSION bit</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CSIKERON</name>
                <description>Set CSIKERON bit
Set by software to force the CSI to ON, even in (LP-)Stop mode, in order to be quickly available as kernel clock for some peripherals.
This bit must be written by a secure agent if the CSI clock is configured as secure (i.e. if RCC_SECCFGR.CSISEC=1).
This bit has no effect on the value of CSION.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Set the CSIKERON bit</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIGBYP</name>
                <description>Set DIGBYP bit
Set by software when the external HSE clock is connected to OSC_IN as a full-swing digital signal.
This bit must be written by a secure agent if the HSE clock is configured as secure (i.e. if RCC_SECCFGR.HSESEC=1).</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Set DIGBYP bit (digital bypass)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HSEON</name>
                <description>Set HSEON bit
Set by software to enable the HSE.
This bit must be written by a secure agent if the HSE clock is configured as secure (i.e. if RCC_SECCFGR.HSESEC=1).</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Set HSEON bit</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HSEKERON</name>
                <description>Set HSEKERON bit
Set by software to force the HSE to ON, even in (LP-)Stop mode, in order to be quickly available as kernel clock for some peripherals.
This bit must be written by a secure agent if the HSE clock is configured as secure (i.e. if RCC_SECCFGR.HSESEC=1).
This bit has no effect on the value of HSEON.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Set the HSEKERON bit</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HSEBYP</name>
                <description>Set HSEBYP bit
Set by software in order to enable the bypass mode.
This bit must be written by a secure agent if the HSE clock is configured as secure (i.e. if RCC_SECCFGR.HSESEC=1).</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Set the HSEBYP bit</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HSECSSON</name>
                <description>Set the HSECSSON bit</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Reading '0' means that the Clock Security System on HSE is OFF (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the Clock Security System on HSE, reading '1' means that the Clock Security System on HSE is ON</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_OCENCLRR</name>
            <displayName>RCC_OCENCLRR</displayName>
            <description>RCC oscillator clock enable clear register</description>
            <addressOffset>0x424</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>HSION</name>
                <description>Clear of HSION bit
Cleared by software to disable the HSI clock.
This bit must be written by a secure agent if the HSI clock is configured as secure (i.e. if RCC_SECCFGR.HSISEC=1).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Clear the HSION bit</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HSIKERON</name>
                <description>Clear of HSIKERON bit
Cleared by software in order to allow the HSI to be switched off in one of the Stop modes.
This bit must be written by a secure agent if the HSI clock is configured as secure (i.e. if RCC_SECCFGR.HSISEC=1).
This bit has no effect on the value of HSION.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Clear the HSIKERON bit</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CSION</name>
                <description>Clear of CSION bit
Cleared by software to disable the CSI clock.
This bit must be written by a secure agent if the CSI clock is configured as secure (i.e. if RCC_SECCFGR.CSISEC=1).</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>CSI is OFF</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Clear the CSION bit</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CSIKERON</name>
                <description>Clear of CSIKERON bit
Cleared by software in order to allow the CSI to be switched off in one of the Stop modes.
This bit must be written by a secure agent if the CSI clock is configured as secure (i.e. if RCC_SECCFGR.CSISEC=1).
This bit has no effect on the value of CSION.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Clear the CSIKERON bit</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIGBYP</name>
                <description>Clear of DIGBYP bit
Cleared by software when the external clock connected to OSC_IN is a low-swing signal.
This bit must be written by a secure agent if the HSE clock is configured as secure (i.e. if RCC_SECCFGR.HSESEC=1).</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Clear the DIGBYP bit (analog bypass)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HSEON</name>
                <description>Clear of HSEON bit
Cleared by software to disable the HSE clock.
This bit must be written by a secure agent if the HSE clock is configured as secure (i.e. if RCC_SECCFGR.HSESEC=1).</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Clear the HSEON bit</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HSEKERON</name>
                <description>Clear HSEKERON bit
Cleared by software in order to allow the HSE to be switched off in one of the Stop modes.
This bit must be written by a secure agent if the HSE clock is configured as secure (i.e. if RCC_SECCFGR.HSESEC=1).</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Clear the HSEKERON bit</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HSEBYP</name>
                <description>Clear the HSEBYP bit
Cleared by software in order to disable the bypass mode.
This bit must be written by a secure agent if the HSE clock is configured as secure (i.e. if RCC_SECCFGR.HSESEC=1).</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Clear the HSEBYP bit</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_OCRDYR</name>
            <displayName>RCC_OCRDYR</displayName>
            <description>RCC oscillators and MPU and AXI clock ready register</description>
            <addressOffset>0x428</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>HSIRDY</name>
                <description>HSI clock ready flag
Set by hardware to indicate that the HSI oscillator is stable.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>HSI clock is not ready (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>HSI clock is ready</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HSIDIVRDY</name>
                <description>HSI divider ready flag
Set and reset by hardware.
As a write in HSIDIV has not an immediate effect on the frequency, this flag indicates the current status of the HSI divider. HSIDIVF will go immediately to '0' when HSIDIV value is changed, and will be set back to '1' when the output frequency matches the value programmed into HSIDIV</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>the new division ratio is not yet propagated to hsi_ck (hsi_ker_ck) (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>the hsi_ck (hsi_ker_ck) clock frequency reflects the new HSIDIV value</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CSIRDY</name>
                <description>CSI clock ready flag
Set by hardware to indicate that the CSI oscillator is stable.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>CSI clock is not ready (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>CSI clock is ready</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HSERDY</name>
                <description>HSE clock ready flag
Set by hardware to indicate that the HSE oscillator is stable.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>HSE clock is not ready (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>HSE clock is ready</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MPUCKRDY</name>
                <description>MPU clock ready flag
Set by hardware to indicate that the mpuss_ck clock is available.</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>mpuss_ck clock is not available (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>mpuss_ck clock is available</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AXICKRDY</name>
                <description>AXI sub-system clock ready flag
Set by hardware to indicate that the axiss_ck clock is available.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>axiss_ck clock is not available (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>axiss_ck clock is available</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
