STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>RCC_HSICFGR</name>
            <displayName>RCC_HSICFGR</displayName>
            <description>RCC HSI configuration register</description>
            <addressOffset>0x440</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>HSIDIV</name>
                <description>HSI clock divider
Written by software.
These bits allows the user to select a division ratio in order to select the wanted HSI clock frequency. The bit HSIDIVRDY of (RCC_OCRDYR) indicates when the new division ratio is taken into account.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Division by 1, hsi_ck (hsi_ker_ck) = 64 MHz (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Division by 2, hsi_ck (hsi_ker_ck) = 32 MHz</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>Division by 4, hsi_ck (hsi_ker_ck) = 16 MHz</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>Division by 8, hsi_ck (hsi_ker_ck) = 8 MHz</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HSITRIM</name>
                <description>HSI clock trimming
Set by software to adjust calibration. HSITRIM represents a signed value.
HSITRIM field is added to the engineering Option Bytes loaded during reset phase (bsec_hsi_cal[11:0]) in order to form the calibration trimming value.
HSICAL[11:0] = HSITRIM[6:0] + bsec_hsi_cal[11:0].
...
...</description>
                <bitOffset>8</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x40</name>
                    <description>bsec_hsi_cal[11:0] - 64</description>
                    <value>0x40</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x41</name>
                    <description>bsec_hsi_cal[11:0] - 63</description>
                    <value>0x41</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>bsec_hsi_cal[11:0] (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3E</name>
                    <description>bsec_hsi_cal[11:0] + 62</description>
                    <value>0x3E</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3F</name>
                    <description>bsec_hsi_cal[11:0] + 63</description>
                    <value>0x3F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HSICAL</name>
                <description>HSI clock calibration
Set by hardware by option byte loading during system reset
Adjusted by software through trimming bits HSITRIM.
This field represents the sum of engineering Option Byte calibration value and HSITRIM bits value.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_CSICFGR</name>
            <displayName>RCC_CSICFGR</displayName>
            <description>RCC CSI configuration register</description>
            <addressOffset>0x444</addressOffset>
            <size>0x20</size>
            <resetValue>0x00001000</resetValue>
            <fields>
              <field>
                <name>CSITRIM</name>
                <description>CSI clock trimming
Set by software to adjust calibration.
CSITRIM field is added to the engineering Option Bytes loaded during reset phase (bsec_csi_cal[7:0]) in order to form the calibration trimming value.
CSICAL[7:0] = CSITRIM[4:0] + bsec_csi_cal[7:0].</description>
                <bitOffset>8</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CSICAL</name>
                <description>CSI clock calibration
Set by hardware by option byte loading during system reset.
Adjusted by software through trimming bits CSITRIM.
This field represents the sum of engineering Option Byte calibration value and CSITRIM bits value</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_MCO1CFGR</name>
            <displayName>RCC_MCO1CFGR</displayName>
            <description>RCC MCO1 configuration register</description>
            <addressOffset>0x460</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>MCO1SEL</name>
                <description>MCO1 clock output selection
Set and cleared by software. Clock source selection may generate glitches on MCO1.
It is highly recommended to configure these bits only after reset, before enabling the external
oscillators and the PLLs.
others: reserved</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>HSI clock selected (hsi_ck) (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>HSE clock selected (hse_ck)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>CSI clock selected (csi_ck)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>LSI clock selected (lsi_ck)</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>LSE oscillator clock selected (lse_ck)</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MCO1DIV</name>
                <description>MCO1 prescaler
Set and cleared by software to configure the prescaler of the MCO1. Modification of this
prescaler may generate glitches on MCO1. It is highly recommended to change this
prescaler only after reset, before enabling the external oscillators and the PLLs.
Refer to  for details.
...</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>bypass (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>division by 2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>division by 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xF</name>
                    <description>division by 16</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MCO1ON</name>
                <description>Control of the MCO1 output
Set and cleared by software to enable the MCO1 output</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The MCO1 output is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The MCO1 output is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_MCO2CFGR</name>
            <displayName>RCC_MCO2CFGR</displayName>
            <description>RCC MCO2 configuration register</description>
            <addressOffset>0x464</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>MCO2SEL</name>
                <description>Micro-controller clock output 2
Set and cleared by software. Clock source selection may generate glitches on MCO2.
It is highly recommended to configure these bits only after reset, before enabling the external
oscillators and the PLLs.
others: reserved</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>MPU clock selected (mpuss_ck) (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>AXI clock selected (axiss_ck)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>MLAHB clock selected (mlahbss_ck)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>PLL4 clock selected (pll4_p_ck)</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>HSE clock selected (hse_ck)</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x5</name>
                    <description>HSI clock selected (hsi_ck)</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MCO2DIV</name>
                <description>MCO2 prescaler
Set and cleared by software to configure the prescaler of the MCO2. Modification of this
prescaler may generate glitches on MCO2. It is highly recommended to change this
prescaler only after reset, before enabling the external oscillators and the PLLs.
Refer to Section1.4.4: Clock Output generation (MCO1 &amp; MCO2) for details.
...</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>bypass (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>division by 2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>division by 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xF</name>
                    <description>division by 16</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MCO2ON</name>
                <description>Control of the MCO2 output
Set and cleared by software to enable the MCO2 output</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The MCO2 output is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The MCO2 output is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_DBGCFGR</name>
            <displayName>RCC_DBGCFGR</displayName>
            <description>RCC debug configuration register</description>
            <addressOffset>0x468</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>TRACEDIV</name>
                <description>Clock divider for the trace clock (ck_trace)
Written by software to control the ck_trace clock division factor.
It is possible to change this division ratio on-the-fly.
others: aclk / 16</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>aclk</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>aclk / 2 (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>aclk / 4</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>aclk / 8</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DBGCKEN</name>
                <description>Clock enable for debug function
Set and cleared by software to control the generation of the ck_apb_dbg clock (DEBUG APB clock), the ck_sys_dbg. See  for additional information.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The enabling of the clock for the debug function is controlled by cdbgwrupreq signal from DAP. (default after reset)	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The clock for the debug function is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TRACECKEN</name>
                <description>Clock enable for trace function
Set and cleared by software to control the generation of the trace_ck clock.
See  for additional information.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The clock for the trace function is disabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The clock for the trace function is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DBGRST</name>
                <description>Reset of the debug function
Set and cleared by software to control the generation of the reset (dbg_rstn) for the trace and debug parts.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The trace and debug parts are not reset. (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The trace and debug parts are under reset.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_RCK12SELR</name>
            <displayName>RCC_RCK12SELR</displayName>
            <description>RCC PLL1 and PLL2 reference clock selection register</description>
            <addressOffset>0x480</addressOffset>
            <size>0x20</size>
            <resetValue>0x80000000</resetValue>
            <fields>
              <field>
                <name>PLL12SRC</name>
                <description>Source clock selection for PLL12
Written by software to select the PLL12 source clock.
In order to save power when PLL12 is not used, PLL12SRC[1:0] must be set to '1x'.
others: No clock send to DIVM1 divider and PLL12</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>HSI selected as PLL12 clock (hsi_ck) (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>HSE selected as PLL12 clock (hse_ck)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PLL12SRCRDY</name>
                <description>PLL12 source clock switch status
Set and reset by hardware to indicate if the PLL12 clock switch transition has been properly performed.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The PLL12 switch is not ready or in position '1x': no clock is generated on its output</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The PLL12 switch is ready: the clock switch is selecting the clock given by PLL12SRC[1:0] field. (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
