STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>RCC_RCK3SELR</name>
            <displayName>RCC_RCK3SELR</displayName>
            <description>RCC PLL3 reference clock selection register</description>
            <addressOffset>0x484</addressOffset>
            <size>0x20</size>
            <resetValue>0x80000000</resetValue>
            <fields>
              <field>
                <name>PLL3SRC</name>
                <description>Source clock selection for PLL3
Written by software to select the PLL3 clock source.
In order to save power, when PLL3 is not used, PLL3SRC[1:0] must be set to '11'.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>HSI selected as PLL clock (hsi_ck) (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>HSE selected as PLL clock (hse_ck)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>CSI selected as PLL clock (csi_ck)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>No clock send to DIVM3 divider and PLL3</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PLL3SRCRDY</name>
                <description>PLL3 source clock switch status
Set and reset by hardware to indicate if the PLL3 clock switch transition has been properly performed.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The PLL3 switch is not ready or in position '11': no clock is generated on its output</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The PLL3 switch is ready: the clock switch is selecting the clock given by PLL3SRC[1:0] field. (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_RCK4SELR</name>
            <displayName>RCC_RCK4SELR</displayName>
            <description>RCC PLL4 reference clock selection register</description>
            <addressOffset>0x488</addressOffset>
            <size>0x20</size>
            <resetValue>0x80000000</resetValue>
            <fields>
              <field>
                <name>PLL4SRC</name>
                <description>Source clock selection for PLL4
Written by software to select the PLL4 clock source.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>HSI selected as PLL clock (hsi_ck) (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>HSE selected as PLL clock (hse_ck)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>CSI selected as PLL clock (csi_ck)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>Signal I2S_CKIN used as source clock</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PLL4SRCRDY</name>
                <description>PLL4 source clock switch status
Set and reset by hardware to indicate if the PLL4 clock switch transition has been properly performed.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The PLL4 switch is not ready or in position '11': no clock is generated on its output</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The PLL4 switch is ready: the clock switch is selecting the clock given by PLL4SRC[1:0] field. (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_PLL1CR</name>
            <displayName>RCC_PLL1CR</displayName>
            <description>RCC PLL1 control register</description>
            <addressOffset>0x4a0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PLLON</name>
                <description>PLL1 enable.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>PLL1 OFF (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>PLL1 is ON, and ref1_ck is provided to the PLL1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PLL1RDY</name>
                <description>PLL1 clock ready flag
Set by hardware to indicate that the PLL1 is locked.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>PLL1 unlocked (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>PLL1 locked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SSCG_CTRL</name>
                <description>Spread Spectrum Clock Generator of PLL1 enable
Set and reset by software to enable the spread spectrum clock generator of PLL1, in order to reduce the amount of EMI peaks.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Clock Spreading Generator disabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Clock Spreading Generator enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIVPEN</name>
                <description>PLL1 DIVP divider output enable
Set and reset by software to enable the pll1_p_ck output of the PLL1.
In order to save power, when the pll1_p_ck is not needed, DIVPEN and DIVP must be set to '0'.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll1_p_ck output is disabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll1_p_ck output is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIVQEN</name>
                <description>PLL1 DIVQ divider output enable
Set and reset by software to enable the pll1_q_ck output of the PLL1.
In order to save power, when the pll1_q_ck is not needed, DIVQEN and DIVQ must be set to '0'.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll1_q_ck output is disabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll1_q_ck output is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIVREN</name>
                <description>PLL1 DIVR divider output enable
Set and reset by software to enable the pll1_r_ck output of the PLL1.
In order to save power, when the pll1_r_ck is not needed, DIVREN and DIVR must be set to '0'.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll1_r_ck output is disabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll1_r_ck output is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_PLL1CFGR1</name>
            <displayName>RCC_PLL1CFGR1</displayName>
            <description>RCC PLL1 configuration register 1</description>
            <addressOffset>0x4a4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00010031</resetValue>
            <fields>
              <field>
                <name>DIVN</name>
                <description>Multiplication factor for PLL1 VCO
Written by software to control the multiplication factor of the VCO.
Warning: the software has to set correctly these bits to ensure that the VCO output frequency
is between its valid frequency range, which is: 992 to 1800 MHz.
VCO output frequency = Fref1_ck x 2 x (DIVN+1), when value 0 has been loaded into FRACV, with:
- Valid division ratios for DIVN: between 25 and 100
- The input frequency Fref1_ck between 8 and 16 MHz
...
...
Others: wrong configurations</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x18</name>
                    <description>Division ratio is 25</description>
                    <value>0x18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x19</name>
                    <description>Division ratio is 26</description>
                    <value>0x19</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x31</name>
                    <description>Division ratio is 50 (default after reset)</description>
                    <value>0x31</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x63</name>
                    <description>Division ratio is 100</description>
                    <value>0x63</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIVM1</name>
                <description>Prescaler for PLL1
Set and cleared by software to configure the prescaler of the PLL1.
...</description>
                <bitOffset>16</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>bypass</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>division by 2 (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>division by 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3F</name>
                    <description>division by 64</description>
                    <value>0x3F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_PLL1CFGR2</name>
            <displayName>RCC_PLL1CFGR2</displayName>
            <description>RCC PLL1 configuration register 2</description>
            <addressOffset>0x4a8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00010100</resetValue>
            <fields>
              <field>
                <name>DIVP</name>
                <description>PLL1 DIVP division factor
Written by software to control the frequency of the pll1_p_ck clock.
Odd division factors are not recommended due to duty cycle degradation.
...</description>
                <bitOffset>0</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll1_p_ck = fout1_ck (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll1_p_ck = fout1_ck / 2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>pll1_p_ck = fout1_ck / 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7F</name>
                    <description>pll1_p_ck = fout1_ck / 128</description>
                    <value>0x7F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIVQ</name>
                <description>PLL1 DIVQ division factor
Written by software to control the frequency of the pll1_q_ck clock.
...</description>
                <bitOffset>8</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll1_q_ck = fout1_ck</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll1_q_ck = fout1_ck / 2 (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>pll1_q_ck = fout1_ck / 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7F</name>
                    <description>pll1_q_ck = fout1_ck / 128</description>
                    <value>0x7F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIVR</name>
                <description>PLL1 DIVR division factor
Written by software to control the frequency of the pll1_r_ck clock.
...</description>
                <bitOffset>16</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll1_r_ck = fout1_ck</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll1_r_ck = fout1_ck / 2 (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>pll1_r_ck = fout1_ck / 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7F</name>
                    <description>pll1_r_ck = fout1_ck / 128</description>
                    <value>0x7F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_PLL1FRACR</name>
            <displayName>RCC_PLL1FRACR</displayName>
            <description>RCC PLL1 fractional register</description>
            <addressOffset>0x4ac</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>FRACV</name>
                <description>Fractional part of the multiplication factor for PLL1 VCO
Written by software to control the fractional part of the multiplication factor of the VCO.
These bits can be written at any time, allowing dynamic fine-tuning of the PLL1 VCO.
Warning: the software has to set correctly these bits to ensure that the VCO output frequency
is between its valid frequency range, which is: 800 to 1600 MHz
VCO output frequency = Fref1_ck x ((DIVN+1) + (FRACV / 8192)), with
- DIVN shall be between 4 and 512
- FRACV can be between 0 and 8191
- The input frequency Fref1_ck shall be between 4 and 16 MHz
In order to change the FRACV value on-the-fly even if the PLL is enabled, the application has to proceed as follow:
- set the bit FRACLE to '0',
- write the new fractional value into FRACV,
- set the bit FRACLE to '1'.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>13</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FRACLE</name>
                <description>PLL1 fractional latch enable
Set and reset by software to latch the content of FRACV into the Sigma-Delta modulator.
In order to latch the FRACV value into the Sigma-Delta modulator, FRACLE must be set to '0', then set to '1': the transition 0 to '1' transfers the content of FRACV into the modulator. Refer to  and  for additional information on the PLL programming.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
