STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>RCC_PLL1CSGR</name>
            <displayName>RCC_PLL1CSGR</displayName>
            <description>RCC PLL1 clock spreading generator register</description>
            <addressOffset>0x4b0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>MOD_PER</name>
                <description>Modulation Period Adjustment for PLL1
Written by software to adjust the modulation period of the clock spreading generator.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>13</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TPDFN_DIS</name>
                <description>Dithering TPDF noise control
Set and reset by software.
This bit is used to enable or disable the injection of a dithering noise into the SSCG modulator. This dithering noise is generated using a triangular probability density function.</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Dithering noise injection enabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Dithering noise injection disabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RPDFN_DIS</name>
                <description>Dithering RPDF noise control
Set and reset by software.
This bit is used to enable or disable the injection of a dithering noise into the SSCG modulator. This dithering noise is generated using a rectangular probability density function.</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Dithering noise injection enabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Dithering noise injection disabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SSCG_MODE</name>
                <description>Spread spectrum clock generator mode
Set and reset by software to select the clock spreading mode.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Center-spread modulation selected (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Down-spread modulation selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INC_STEP</name>
                <description>Modulation Depth Adjustment for PLL1
Written by software to adjust the modulation depth of the clock spreading generator.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>15</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_PLL2CR</name>
            <displayName>RCC_PLL2CR</displayName>
            <description>RCC PLL2 control register</description>
            <addressOffset>0x4d0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PLLON</name>
                <description>PLL2 enable
Set and cleared by software to enable the PLL2.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>PLL2 OFF (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>PLL2 ON, and ref2_ck is provided to the PLL2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PLL2RDY</name>
                <description>PLL2 clock ready flag
Set by hardware to indicate that the PLL2 is locked.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>PLL2 unlocked (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>PLL2 locked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SSCG_CTRL</name>
                <description>Clock Spreading Generator of PLL2 enable
Set and reset by software to enable the clock spreading generator of PLL2, in order to reduce the amount of EMI peaks.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Clock Spreading Generator disabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Clock Spreading Generator enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIVPEN</name>
                <description>PLL2 DIVP divider output enable
Set and reset by software to enable the pll2_p_ck output of the PLL2.
In order to save power, when the pll2_p_ck is not needed, DIVPEN and DIVP must be set to '0'.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll2_p_ck output is disabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll2_p_ck output is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIVQEN</name>
                <description>PLL2 DIVQ divider output enable
Set and reset by software to enable the pll2_q_ck output of the PLL2.
In order to save power, when the pll2_q_ck is not needed, DIVQEN and DIVQ must be set to '0'.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll2_q_ck output is disabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll2_q_ck output is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIVREN</name>
                <description>PLL2 DIVR divider output enable
Set and reset by software to enable the pll2_r_ck output of the PLL2.
In order to save power, when the pll2_r_ck is not needed, DIVREN and DIVR must be set to '0'.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll2_r_ck output is disabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll2_r_ck output is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_PLL2CFGR1</name>
            <displayName>RCC_PLL2CFGR1</displayName>
            <description>RCC PLL2 configuration register 1</description>
            <addressOffset>0x4d4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00010063</resetValue>
            <fields>
              <field>
                <name>DIVN</name>
                <description>Multiplication factor for PLL2 VCO
Written by software to control the multiplication factor of the VCO.
Warning: the software has to set correctly these bits to ensure that the VCO output frequency
is between its valid frequency range, which is: 800 to 1600 MHz.
VCO output frequency = Fref2_ck x (DIVN+1), when value 0 has been loaded into FRACV, with:
- Valid division ratios for DIVN: between 25 and 100
- The input frequency Fref2_ck between 8 and 16 MHz
Others: wrong configurations
...
...</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x18</name>
                    <description>Division ratio is 25</description>
                    <value>0x18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x19</name>
                    <description>Division ratio is 26</description>
                    <value>0x19</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x31</name>
                    <description>Division ratio is 50</description>
                    <value>0x31</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x63</name>
                    <description>Division ratio is 100 (default after reset)</description>
                    <value>0x63</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIVM2</name>
                <description>Prescaler for PLL2
Set and cleared by software to configure the prescaler of the PLL2.
...</description>
                <bitOffset>16</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>bypass</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>division by 2 (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>division by 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3F</name>
                    <description>division by 64</description>
                    <value>0x3F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_PLL2CFGR2</name>
            <displayName>RCC_PLL2CFGR2</displayName>
            <description>RCC PLL2 configuration register 2</description>
            <addressOffset>0x4d8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00010101</resetValue>
            <fields>
              <field>
                <name>DIVP</name>
                <description>PLL2 DIVP division factor
Written by software to control the frequency of the pll2_p_ck clock.
...</description>
                <bitOffset>0</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll2_p_ck = fout2_ck</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll2_p_ck = fout2_ck / 2 (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>pll2_p_ck = fout2_ck / 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7F</name>
                    <description>pll2_p_ck = fout2_ck / 128</description>
                    <value>0x7F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIVQ</name>
                <description>PLL2 DIVQ division factor
Written by software to control the frequency of the pll2_q_ck clock.
...</description>
                <bitOffset>8</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll2_q_ck = fout2_ck</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll2_q_ck = fout2_ck / 2 (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>pll2_q_ck = fout2_ck / 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7F</name>
                    <description>pll2_q_ck = fout2_ck / 128</description>
                    <value>0x7F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIVR</name>
                <description>PLL2 DIVR division factor
Written by software to control the frequency of the pll2_r_ck clock.
...</description>
                <bitOffset>16</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll2_r_ck = fout2_ck</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll2_r_ck = fout2_ck / 2 (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>pll2_r_ck = fout2_ck / 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7F</name>
                    <description>pll2_r_ck = fout2_ck / 128</description>
                    <value>0x7F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_PLL2FRACR</name>
            <displayName>RCC_PLL2FRACR</displayName>
            <description>RCC PLL2 fractional register</description>
            <addressOffset>0x4dc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>FRACV</name>
                <description>Fractional part of the multiplication factor for PLL2 VCO
Written by software to control the fractional part of the multiplication factor of the VCO.
These bits can be written at any time, allowing dynamic fine-tuning of the PLL2 VCO.
Warning: the software has to set correctly these bits to ensure that the VCO output frequency
is between its valid frequency range, which is: 800 to 1600 MHz
VCO output frequency = Fref2_ck x ((DIVN+1) + (FRACV / 8192)), with
- DIVN shall be between 4 and 512
- FRACV can be between 0 and 8191
- The input frequency Fref2_ck shall be between 4 and 16 MHz
In order to change the FRACV value on-the-fly even if the PLL is enabled, the application has to proceed as follow:
- set the bit FRACLE to '0',
- write the new fractional value into FRACV,
- set the bit FRACLE to '1'.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>13</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FRACLE</name>
                <description>PLL2 fractional latch enable
Set and reset by software to latch the content of FRACV into the Sigma-Delta modulator.
In order to latch the FRACV value into the Sigma-Delta modulator, FRACLE must be set to '0', then set to '1': the transition 0 to '1' transfers the content of FRACV into the modulator. Refer to  and  for additional information on the PLL programming.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
