STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>RCC_PLL3CSGR</name>
            <displayName>RCC_PLL3CSGR</displayName>
            <description>RCC PLL3 clock spreading generator register</description>
            <addressOffset>0x510</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>MOD_PER</name>
                <description>Modulation Period Adjustment for PLL3
Written by software to adjust the modulation period of the clock spreading generator.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>13</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TPDFN_DIS</name>
                <description>Dithering TPDF noise control
Set and reset by software.
This bit is used to enable or disable the injection of a dithering noise into the SSCG modulator. This dithering noise is generated using a triangular probability density function.</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Dithering noise injection enabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Dithering noise injection disabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RPDFN_DIS</name>
                <description>Dithering RPDF noise control
Set and reset by software.
This bit is used to enable or disable the injection of a dithering noise into the SSCG modulator. This dithering noise is generated using a rectangular probability density function.</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Dithering noise injection enabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Dithering noise injection disabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SSCG_MODE</name>
                <description>Spread spectrum clock generator mode
Set and reset by software to select the clock spreading mode.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Center-spread modulation selected (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Down-spread modulation selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INC_STEP</name>
                <description>Modulation Depth Adjustment for PLL3
Written by software to adjust the modulation depth of the clock spreading generator.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>15</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_PLL4CR</name>
            <displayName>RCC_PLL4CR</displayName>
            <description>RCC PLL4 control register</description>
            <addressOffset>0x520</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PLLON</name>
                <description>PLL4 enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>PLL4 OFF (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>PLL4 ON, and ref4_ck is provided to the PLL4</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PLL4RDY</name>
                <description>PLL4 clock ready flag
Set by hardware to indicate that the PLL4 is locked.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>PLL4 unlocked (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>PLL4 locked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SSCG_CTRL</name>
                <description>Clock Spreading Generator of PLL4 enable
Set and reset by software to enable the clock spreading generator of PLL4, in order to reduce the amount of EMI peaks.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Clock Spreading Generator disabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Clock Spreading Generator enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIVPEN</name>
                <description>PLL4 DIVP divider output enable
Set and reset by software to enable the pll4_p_ck output of the PLL4.
Cleared by hardware when entering a Stop mode or Standby.
In order to save power, when the pll4_p_ck is not needed, DIVPEN must be set to '0'.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll4_p_ck output is disabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll4_p_ck output is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIVQEN</name>
                <description>PLL4 DIVQ divider output enable
Set and reset by software to enable the pll4_q_ck output of the PLL4.
Cleared by hardware when entering a Stop mode or Standby.
In order to save power, when the pll4_q_ck is not needed, DIVQEN must be set to '0'.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll4_q_ck output is disabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll4_q_ck output is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIVREN</name>
                <description>PLL4 DIVR divider output enable
Set and reset by software to enable the pll4_r_ck output of the PLL4.
Cleared by hardware when entering a Stop mode or Standby.
In order to save power, when the pll4_r_ck is not needed, DIVREN must be set to '0'.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll4_r_ck output is disabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll4_r_ck output is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_PLL4CFGR1</name>
            <displayName>RCC_PLL4CFGR1</displayName>
            <description>RCC PLL4 configuration register 1</description>
            <addressOffset>0x524</addressOffset>
            <size>0x20</size>
            <resetValue>0x00010031</resetValue>
            <fields>
              <field>
                <name>DIVN</name>
                <description>Multiplication factor for PLL4 VCO
Written by software to control the multiplication factor of the VCO.
Warning: the software has to set correctly these bits to ensure that the VCO output frequency
is between its valid frequency range, which is between 400 and 800 MHz.
VCO output frequency = Fref4_ck x (DIVN+1), when value 0 has been loaded into FRACV, with:
- Valid division ratios for DIVN: between 25 and 200
- The input frequency Fref4_ck between 4 and 16 MHz
...
...
Others: wrong configurations</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x18</name>
                    <description>Division ratio is 25</description>
                    <value>0x18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x19</name>
                    <description>Division ratio is 26</description>
                    <value>0x19</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1A</name>
                    <description>Division ratio is 27</description>
                    <value>0x1A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x31</name>
                    <description>Division ratio is 50 (default after reset)</description>
                    <value>0x31</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xC7</name>
                    <description>Division ratio is 200</description>
                    <value>0xC7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIVM4</name>
                <description>Prescaler for PLL4
Set and cleared by software to configure the prescaler of the PLL4.
...</description>
                <bitOffset>16</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>bypass</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>division by 2 (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>division by 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3F</name>
                    <description>division by 64</description>
                    <value>0x3F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IFRGE</name>
                <description>PLL4 input frequency range
Written by software to select the proper reference frequency range used for PLL4.
x0: The PLL4 input (ref4_ck) clock range frequency is between 4 and 8 MHz (default after reset)
x1: The PLL4 input (ref4_ck) clock range frequency is between 8 and 16 MHz
Note that if ref3_ck is equal to 8 MHz, it is recommended to set IFRGE = 'x1</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_PLL4CFGR2</name>
            <displayName>RCC_PLL4CFGR2</displayName>
            <description>RCC PLL4 configuration register 2</description>
            <addressOffset>0x528</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DIVP</name>
                <description>PLL4 DIVP division factor
Written by software to control the frequency of the pll4_p_ck clock.
...</description>
                <bitOffset>0</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll4_p_ck = vco4_ck (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll4_p_ck = vco4_ck / 2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>pll4_p_ck = vco4_ck / 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7F</name>
                    <description>pll4_p_ck = vco4_ck / 128</description>
                    <value>0x7F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIVQ</name>
                <description>PLL4 DIVQ division factor
Written by software to control the frequency of the pll4_q_ck clock.
...</description>
                <bitOffset>8</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll4_q_ck = vco4_ck (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll4_q_ck = vco4_ck / 2 </description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>pll4_q_ck = vco4_ck / 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7F</name>
                    <description>pll4_q_ck = vco4_ck / 128</description>
                    <value>0x7F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIVR</name>
                <description>PLL4 DIVR division factor
Written by software to control the frequency of the pll4_r_ck clock.
...</description>
                <bitOffset>16</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll4_r_ck = vco4_ck (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll4_r_ck = vco4_ck / 2 </description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>pll4_r_ck = vco4_ck / 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7F</name>
                    <description>pll4_r_ck = vco4_ck / 128</description>
                    <value>0x7F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_PLL4FRACR</name>
            <displayName>RCC_PLL4FRACR</displayName>
            <description>RCC PLL4 fractional register</description>
            <addressOffset>0x52c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>FRACV</name>
                <description>Fractional part of the multiplication factor for PLL4 VCO
Written by software to control the fractional part of the multiplication factor of the VCO.
These bits can be written at any time, allowing dynamic fine-tuning of the PLL4 VCO.
Warning: the software has to set correctly these bits to ensure that the VCO output frequency
is between its valid frequency range, which is between 400 and 800 MHz.
VCO output frequency = Fref4_ck x ((DIVN+1) + (FRACV / 8192)), with
- DIVN shall be between 4 and 512
- FRACV can be between 0 and 8191
- The input frequency Fref4_ck shall be between 1 and 16 MHz
In order to change the FRACV value on-the-fly even if the PLL is enabled, the application has to proceed as follow:
- set the bit FRACLE to '0',
- write the new fractional value into FRACV,
- set the bit FRACLE to '1'.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>13</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FRACLE</name>
                <description>PLL4 fractional latch enable
Set and reset by software to latch the content of FRACV into the Sigma-Delta modulator.
In order to latch the FRACV value into the Sigma-Delta modulator, FRACLE must be set to '0', then set to '1': the transition 0 to '1' transfers the content of FRACV into the modulator. Refer to Section: Refer to  and dividers for additional information.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
