STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>RCC_PLL4CSGR</name>
            <displayName>RCC_PLL4CSGR</displayName>
            <description>RCC PLL4 clock spreading generator register</description>
            <addressOffset>0x530</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>MOD_PER</name>
                <description>Modulation Period Adjustment for PLL4
Written by software to adjust the modulation period of the clock spreading generator.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>13</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TPDFN_DIS</name>
                <description>Dithering TPDF noise control
Set and reset by software.
This bit is used to enable or disable the injection of a dithering noise into the SSCG modulator. This dithering noise is generated using a triangular probability density function.</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Dithering noise injection enabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Dithering noise injection disabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RPDFN_DIS</name>
                <description>Dithering RPDF noise control
Set and reset by software.
This bit is used to enable or disable the injection of a dithering noise into the SSCG modulator. This dithering noise is generated using a rectangular probability density function.</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Dithering noise injection enabled (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Dithering noise injection disabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SSCG_MODE</name>
                <description>Spread spectrum clock generator mode
Set and reset by software to select the clock spreading mode.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Center-spread modulation selected (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Down-spread modulation selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INC_STEP</name>
                <description>Modulation Depth Adjustment for PLL4
Written by software to adjust the modulation depth of the clock spreading generator.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>15</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_MPCKSELR</name>
            <displayName>RCC_MPCKSELR</displayName>
            <description>RCC MPU clock selection register</description>
            <addressOffset>0x540</addressOffset>
            <size>0x20</size>
            <resetValue>0x80000000</resetValue>
            <fields>
              <field>
                <name>MPUSRC</name>
                <description>MPU clock switch
Written by software to select the MPU sub-system clock source (mpuss_ck).
Note that MPUDIV is disabled if MPUSRC[1:0] is different from '11'.
Be sure that MPUDIV is different from '000' before setting MPUSRC to '11'.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>HSI selected as MPU sub-system clock (hsi_ck) (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>HSE selected as MPU sub-system clock (hse_ck)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>PLL1 selected as MPU sub-system clock (pll1_p_ck)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>divided PLL1 pll1_p_ck clock is selected as MPU sub-system clock, c.f. RCC_MPCKDIVR.MPUDIV[3:0]</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MPUSRCRDY</name>
                <description>MPU clock switch status
Set and reset by hardware to indicate if the MPU clock switch transition has been properly performed.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The MPU switch is not ready: no clock is generated on its output</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The MPU switch is ready: the clock switch is selecting the clock given by MPUSRC field. (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_ASSCKSELR</name>
            <displayName>RCC_ASSCKSELR</displayName>
            <description>RCC AXI sub-system clock selection register.</description>
            <addressOffset>0x544</addressOffset>
            <size>0x20</size>
            <resetValue>0x80000000</resetValue>
            <fields>
              <field>
                <name>AXISSRC</name>
                <description>AXI sub-system clock switch
Written by software to select the AXI sub-system clock source (axiss_ck).
others: axiss_ck is gated</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>HSI selected as AXI sub-system clock (hsi_ck) (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>HSE selected as AXI sub-system clock (hse_ck)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>PLL2 selected as AXI sub-system clock (pll2_p_ck)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AXISSRCRDY</name>
                <description>AXI sub-system clock switch status
Set and reset by hardware to indicate if the AXI clock switch transition has been properly performed.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The AXI sub-system switch is not ready or in positions higher than '011': no clock is generated on its output	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The AXI sub-system switch is ready: the clock switch is selecting the clock given by AXISSRC field. (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_MSSCKSELR</name>
            <displayName>RCC_MSSCKSELR</displayName>
            <description>RCC MLAHB sub-system clock selection register</description>
            <addressOffset>0x548</addressOffset>
            <size>0x20</size>
            <resetValue>0x80000000</resetValue>
            <fields>
              <field>
                <name>MLAHBSSRC</name>
                <description>MLAHB sub-system clock switch
Written by software to select the MLAHB sub-system clock source (mlahbss_ck).
Reset by hardware in order to select hsi_ck when the system exits from one of the Stop modes.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>HSI selected as MLAHB sub-system clock (hsi_ck) (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>HSE selected as MLAHB sub-system clock (hse_ck)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>CSI selected as MLAHB sub-system clock (csi_ck)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>PLL3 selected as MLAHB sub-system clock (pll3_p_ck)</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MLAHBSSRCRDY</name>
                <description>MLAHB sub-system clock switch status
Set and reset by hardware to indicate if the MLAHB clock switch transition has been properly performed.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The MLAHB sub-system switch is not ready or in positions higher than '011': no clock is generated on its output	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The MLAHB sub-system switch is ready: the clock switch is selecting the clock given by MLAHBSSRC field. (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_CPERCKSELR</name>
            <displayName>RCC_CPERCKSELR</displayName>
            <description>RCC common peripheral kernel clock selection register</description>
            <addressOffset>0x54c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CKPERSRC</name>
                <description>Oscillator selection for kernel clock
Set and cleared by software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>hsi_ker_ck clock selected (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>csi_ker_ck clock selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>hse_ker_ck clock selected</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>Clock disabled</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_RTCDIVR</name>
            <displayName>RCC_RTCDIVR</displayName>
            <description>RCC RTC clock division register</description>
            <addressOffset>0x560</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RTCDIV</name>
                <description>HSE division factor for RTC clock
Set and cleared by software to divide the HSE to generate a clock for RTC.
Caution: The software has to set these bits correctly to ensure that the clock supplied to the
RTC is lower than 4 MHz. These bits must be configured if needed before selecting the RTC
clock source.
Note that when the RTCSRC is different from 3, this divider is disabled (does not provide clock).
...</description>
                <bitOffset>0</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>HSE (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>HSE/2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>HSE/3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>HSE/4</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3E</name>
                    <description>HSE/63</description>
                    <value>0x3E</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3F</name>
                    <description>HSE/64</description>
                    <value>0x3F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_MPCKDIVR</name>
            <displayName>RCC_MPCKDIVR</displayName>
            <description>RCC MPU clock divider register</description>
            <addressOffset>0x564</addressOffset>
            <size>0x20</size>
            <resetValue>0x80000001</resetValue>
            <fields>
              <field>
                <name>MPUDIV</name>
                <description>MPU Core clock divider
Written by software to control the MPU clock division factor when the MPUSRC is set to position 3.
It is possible to change this division ratio on-the-fly. It impacts only the frequency of the MPU clock. The clocks are divided with the new prescaler factor, from 1 to 16 pll1_p_ck cycles after MPUDIV update. The application can check if the new division factor is taken into account by reading back the MPUDIVRDY flag. Note that this divider is disabled if MPUSRC[1:0] is different from '11'.
0x&lt;n&gt;: The mpuss_ck is equal to pll1_p_ck divided by 0x&lt;n&gt;+1</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The MPUDIV is disabled; i.e. no clock generated</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The mpuss_ck is equal to pll1_p_ck divided by 2 (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>The mpuss_ck is equal to pll1_p_ck divided by 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xF</name>
                    <description>The mpuss_ck is equal to pll1_p_ck divided by 16</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MPUDIVRDY</name>
                <description>MPU sub-system clock divider status
Set and reset by hardware to indicate if the new division factor is taken into account.
This bit significant only when MPUSRC[1:0] = '11'.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The new division factor is not yet taken into account.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The new division factor is taken into account. (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_AXIDIVR</name>
            <displayName>RCC_AXIDIVR</displayName>
            <description>RCC AXI clock divider register</description>
            <addressOffset>0x568</addressOffset>
            <size>0x20</size>
            <resetValue>0x80000000</resetValue>
            <fields>
              <field>
                <name>AXIDIV</name>
                <description>AXI, AHB5 and AHB6 clock divider
Written by software to control the AXI, AHB5 and AHB6 clock division factor.
It is possible to change this division ratio on-the-fly. It impacts the frequency of AXI, APB4, APB5 AHB5 and AHB6 clocks.
The clocks are divided with the new prescaler factor, from 1 to 4 axiss_ck cycles after AXIDIV
update. The application can check if the new division factor is taken into account by reading back the AXIDIVRDY flag.
others: axiss_ck / 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>axiss_ck (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>axiss_ck / 2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>axiss_ck / 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AXIDIVRDY</name>
                <description>AXI sub-system clock divider status
Set and reset by hardware to indicate if the new division factor is taken into account.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The new division factor is not yet taken into account.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The new division factor is taken into account. (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
