STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>RCC_MLAHBDIVR</name>
            <displayName>RCC_MLAHBDIVR</displayName>
            <description>RCC MLAHB clock divider register</description>
            <addressOffset>0x56c</addressOffset>
            <size>0x20</size>
            <resetValue>0x80000000</resetValue>
            <fields>
              <field>
                <name>MLAHBDIV</name>
                <description>MLAHB clock divider
Written by software to control the MLAHB clock division factor.
Changing this division ratio has an impact on the frequency of MLAHB clock, and all bus matrix clocks. The clocks are divided with the new prescaler factor, from 1 to 512 cycles of mlahbss_ck, after MLAHBDIV update. The application can check if the new division factor is taken into account by reading back the MLAHBDIVRDY flag.
others: mlahbss_ck divided by 512</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>mlahbss_ck not divided (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>mlahbss_ck divided by 2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>mlahbss_ck divided by 4</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>mlahbss_ck divided by 8</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>mlahbss_ck divided by 16</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x5</name>
                    <description>mlahbss_ck divided by 32</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x6</name>
                    <description>mlahbss_ck divided by 64</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7</name>
                    <description>mlahbss_ck divided by 128</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x8</name>
                    <description>mlahbss_ck divided by 256</description>
                    <value>0x8</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MLAHBDIVRDY</name>
                <description>MLAHB clock prescaler status
Set and reset by hardware to indicate if the new division factor is taken into account.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The new division factor is not yet taken into account.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The new division factor is taken into account. (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_APB1DIVR</name>
            <displayName>RCC_APB1DIVR</displayName>
            <description>RCC APB1 clock divider register</description>
            <addressOffset>0x570</addressOffset>
            <size>0x20</size>
            <resetValue>0x80000000</resetValue>
            <fields>
              <field>
                <name>APB1DIV</name>
                <description>APB1 clock divider
Written by software to control the APB1 clock division factor.
The APB1 peripheral clock is divided with the new prescaler factor, from 1 to 16 mlhclk cycles after APB1DIV update. The application can check if the new division factor is taken into account by reading back the APB1DIVRDY flag.
others: Not allowed</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>mlhclk (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>mlhclk / 2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>mlhclk / 4</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>mlhclk / 8</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>mlhclk / 16</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>APB1DIVRDY</name>
                <description>APB1 clock prescaler status
Set and reset by hardware to indicate if the new division factor is taken into account.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The new division factor is not yet taken into account.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The new division factor is taken into account. (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_APB2DIVR</name>
            <displayName>RCC_APB2DIVR</displayName>
            <description>RCC APB2 clock divider register </description>
            <addressOffset>0x574</addressOffset>
            <size>0x20</size>
            <resetValue>0x80000000</resetValue>
            <fields>
              <field>
                <name>APB2DIV</name>
                <description>APB2 clock divider
Written by software to control the APB2 clock division factor.
The APB2 clock is divided with the new prescaler factor, from 1 to 16 mlhclk cycles after APB2DIV
update. The application can check if the new division factor is taken into account by reading back the APB2DIVRDY flag.
others: Not allowed</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>mlhclk (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>mlhclk / 2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>mlhclk / 4</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>mlhclk / 8</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>mlhclk / 16</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>APB2DIVRDY</name>
                <description>APB2 clock prescaler status
Set and reset by hardware to indicate if the new division factor is taken into account.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The new division factor is not yet taken into account.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The new division factor is taken into account. (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_APB3DIVR</name>
            <displayName>RCC_APB3DIVR</displayName>
            <description>RCC APB3 clock divider register</description>
            <addressOffset>0x578</addressOffset>
            <size>0x20</size>
            <resetValue>0x80000000</resetValue>
            <fields>
              <field>
                <name>APB3DIV</name>
                <description>APB3 clock divider
Written by software to control the APB3 clock division factor.
The APB3 clock is divided by this new prescaler factor, from 1 to 16 hclk cycles after APB3DIV
update. The application can check if the new division factor is taken into account by reading back the APB3DIVRDY flag.
others: hclk / 16</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>hclk (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>hclk / 2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>hclk / 4</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>hclk / 8</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>APB3DIVRDY</name>
                <description>APB3 clock prescaler status
Set and reset by hardware to indicate if the new division factor is taken into account.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The new division factor is not yet taken into account.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The new division factor is taken into account. (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_APB4DIVR</name>
            <displayName>RCC_APB4DIVR</displayName>
            <description>RCC APB4 clock divider register.</description>
            <addressOffset>0x57c</addressOffset>
            <size>0x20</size>
            <resetValue>0x80000000</resetValue>
            <fields>
              <field>
                <name>APB4DIV</name>
                <description>APB4 clock divider
Written by software to control the APB4 clock division factor.
It is possible to change this division ratio on-the-fly. It impacts only the frequency of APB4 clock.
The clocks are divided with the new prescaler factor, from 1 to 16 aclk cycles after APB4DIV
update. The application can check if the new division factor is taken into account by reading back the APB4DIVRDY flag.
others: aclk / 16</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>aclk (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>aclk / 2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>aclk / 4</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>aclk / 8</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>APB4DIVRDY</name>
                <description>APB4 clock divider status
Set and reset by hardware to indicate if the new division factor is taken into account.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The new division factor is not yet taken into account.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The new division factor is taken into account. (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_APB5DIVR</name>
            <displayName>RCC_APB5DIVR</displayName>
            <description>RCC APB5 clock divider register</description>
            <addressOffset>0x580</addressOffset>
            <size>0x20</size>
            <resetValue>0x80000000</resetValue>
            <fields>
              <field>
                <name>APB5DIV</name>
                <description>APB5 clock divider
Written by software to control the APB5 clock division factor.
It is possible to change this division ratio on-the-fly. It impacts only the frequency of APB5 clock.
The clocks are divided with the new prescaler factor, from 1 to 16 aclk cycles after APB5DIV
update. The application can check if the new division factor is taken into account by reading the APB5DIVRDY flag.
others: aclk / 16</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>aclk (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>aclk / 2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>aclk / 4</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>aclk / 8</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>APB5DIVRDY</name>
                <description>APB5 clock divider status
Set and reset by hardware to indicate if the new division factor is taken into account.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The new division factor is not yet taken into account.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The new division factor is taken into account. (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_APB6DIVR</name>
            <displayName>RCC_APB6DIVR</displayName>
            <description>RCC APB6 clock divider register</description>
            <addressOffset>0x584</addressOffset>
            <size>0x20</size>
            <resetValue>0x80000000</resetValue>
            <fields>
              <field>
                <name>APB6DIV</name>
                <description>APB6 clock divider
Written by software to control the APB6 clock division factor.
It is possible to change this division ratio on-the-fly. It impacts only the frequency of APB6 clock.
The clocks are divided with the new prescaler factor, from 1 to 16 aclk cycles after APB6DIV
update. The application can check if the new division factor is taken into account by reading the APB6DIVRDY flag.
others: aclk / 16</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>aclk (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>aclk / 2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>aclk / 4</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>aclk / 8</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>APB6DIVRDY</name>
                <description>APB6 clock divider status
Set and reset by hardware to indicate if the new division factor is taken into account.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The new division factor is not yet taken into account.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The new division factor is taken into account. (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
