STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>RCC_TIMG1PRER</name>
            <displayName>RCC_TIMG1PRER</displayName>
            <description>RCC APB1 timers group1 prescaler register.</description>
            <addressOffset>0x5a0</addressOffset>
            <size>0x20</size>
            <resetValue>0x80000000</resetValue>
            <fields>
              <field>
                <name>TIMG1PRE</name>
                <description>Timers clocks prescaler selection
This bit is set and reset by software to control the clock frequency of all the timers connected
to APB1 domain.
Refer to .</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The Timers kernel clock is equal to mlhclk if APB1DIV is corresponding to a division by 1 or 2, else it is equal to 2 x Fpclk1 (default after reset)	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The Timers kernel clock is equal to mlhclk if APB1DIV is corresponding to division by 1, 2 or 4, else it is equal to 4 x Fpclk1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIMG1PRERDY</name>
                <description>Timers clocks prescaler status
Set and reset by hardware to indicate if the new division factor is taken into account.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The new division factor is not yet taken into account.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The new division factor is taken into account (default after reset).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_TIMG2PRER</name>
            <displayName>RCC_TIMG2PRER</displayName>
            <description>RCC APB2 timers group2 prescaler register</description>
            <addressOffset>0x5a4</addressOffset>
            <size>0x20</size>
            <resetValue>0x80000000</resetValue>
            <fields>
              <field>
                <name>TIMG2PRE</name>
                <description>Timers clocks prescaler selection
This bit is set and reset by software to control the clock frequency of all the timers connected
to APB2 domain.
Refer to .</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The Timers kernel clock is equal to mlhclk if APB2DIV is corresponding to a division by 1 or 2, else it is equal to 2 x Fpclk2 (default after reset)	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The Timers kernel clock is equal to mlhclk if APB2DIV is corresponding to division by 1, 2 or 4, else it is equal to 4 x Fpclk2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIMG2PRERDY</name>
                <description>Timers clocks prescaler status
Set and reset by hardware to indicate if the new division factor is taken into account.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The new division factor is not yet taken into account.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The new division factor is taken into account (default after reset).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_TIMG3PRER</name>
            <displayName>RCC_TIMG3PRER</displayName>
            <description>RCC APB6 timers group3 prescaler register</description>
            <addressOffset>0x5a8</addressOffset>
            <size>0x20</size>
            <resetValue>0x80000000</resetValue>
            <fields>
              <field>
                <name>TIMG3PRE</name>
                <description>Timers clocks prescaler selection
This bit is set and reset by software to control the clock frequency of all the timers connected
to APB6 domain.
Refer to .</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The Timers kernel clock is equal to mlhclk if APB6DIV is corresponding to a division by 1 or 2, else it is equal to 2 x Fpclk6 (default after reset)	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The Timers kernel clock is equal to mlhclk if APB6DIV is corresponding to division by 1, 2 or 4, else it is equal to 4 x Fpclk6</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIMG3PRERDY</name>
                <description>Timers clocks prescaler status
Set and reset by hardware to indicate if the new division factor is taken into account.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The new division factor is not yet taken into account.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The new division factor is taken into account (default after reset).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
