STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>RCC_UART12CKSELR</name>
            <displayName>RCC_UART12CKSELR</displayName>
            <description>RCC USART1 and USART2 kernel clock selection register</description>
            <addressOffset>0x614</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>UART1SRC</name>
                <description>USART1 kernel clock source selection
If USART1 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Written by software.
others: reserved, the kernel clock is disabled</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pclk6 clock selected as kernel peripheral clock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll3_q_ck clock selected as kernel peripheral clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>hsi_ker_ck clock selected as kernel peripheral clock</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>csi_ker_ck clock selected as kernel peripheral clock</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>pll4_q_ck clock selected as kernel peripheral clock</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x5</name>
                    <description>hse_ker_ck clock selected as kernel peripheral clock</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UART2SRC</name>
                <description>USART2 kernel clock source selection
If USART2 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Written by software.
others: reserved, the kernel clock is disabled</description>
                <bitOffset>3</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pclk6 clock selected as kernel peripheral clock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll3_q_ck clock selected as kernel peripheral clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>hsi_ker_ck clock selected as kernel peripheral clock</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>csi_ker_ck clock selected as kernel peripheral clock</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>pll4_q_ck clock selected as kernel peripheral clock</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x5</name>
                    <description>hse_ker_ck clock selected as kernel peripheral clock</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_UART35CKSELR</name>
            <displayName>RCC_UART35CKSELR</displayName>
            <description>RCC USART3 and UART5 kernel clock selection register</description>
            <addressOffset>0x618</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>UART35SRC</name>
                <description>USART3 and UART5 kernel clock source selection
Written by software.
others: reserved, the kernel clock is disabled</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pclk1 clock selected as kernel peripheral clock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll4_q_ck clock selected as kernel peripheral clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>hsi_ker_ck clock selected as kernel peripheral clock</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>csi_ker_ck clock selected as kernel peripheral clock</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>hse_ker_ck clock selected as kernel peripheral clock</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_UART4CKSELR</name>
            <displayName>RCC_UART4CKSELR</displayName>
            <description>RCC UART4 kernel clock selection register</description>
            <addressOffset>0x61c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>UART4SRC</name>
                <description>UART4 kernel clock source selection
Written by software.
others: reserved, the kernel clock is disabled</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pclk1 clock selected as kernel peripheral clock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll4_q_ck clock selected as kernel peripheral clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>hsi_ker_ck clock selected as kernel peripheral clock</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>csi_ker_ck clock selected as kernel peripheral clock</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>hse_ker_ck clock selected as kernel peripheral clock</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_UART6CKSELR</name>
            <displayName>RCC_UART6CKSELR</displayName>
            <description>RCC USART6 kernel clock selection register</description>
            <addressOffset>0x620</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>UART6SRC</name>
                <description>USART6 kernel clock source selection
Written by software.
others: reserved, the kernel clock is disabled</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pclk2 clock selected as kernel peripheral clock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll4_q_ck clock selected as kernel peripheral clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>hsi_ker_ck clock selected as kernel peripheral clock</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>csi_ker_ck clock selected as kernel peripheral clock</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>hse_ker_ck clock selected as kernel peripheral clock</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_UART78CKSELR</name>
            <displayName>RCC_UART78CKSELR</displayName>
            <description>RCC UART7 and UART8 kernel clock selection register</description>
            <addressOffset>0x624</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>UART78SRC</name>
                <description>UART7 and UART8 kernel clock source selection
Written by software.
others: reserved, the kernel clock is disabled</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pclk1 clock selected as kernel peripheral clock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll4_q_ck clock selected as kernel peripheral clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>hsi_ker_ck clock selected as kernel peripheral clock</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>csi_ker_ck clock selected as kernel peripheral clock</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>hse_ker_ck clock selected as kernel peripheral clock</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_LPTIM1CKSELR</name>
            <displayName>RCC_LPTIM1CKSELR</displayName>
            <description>RCC LPTIM1 kernel clock selection register</description>
            <addressOffset>0x628</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>LPTIM1SRC</name>
                <description>LPTIM1 kernel clock source selection
Written by software.
others: the kernel clock is disabled</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pclk1 clock selected as kernel peripheral clock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll4_p_ck clock selected as kernel peripheral clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>pll3_q_ck clock selected as kernel peripheral clock</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>lse_ck clock selected as kernel peripheral clock</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>lsi_ck clock selected as kernel peripheral clock</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x5</name>
                    <description>per_ck clock selected as kernel peripheral clock</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_LPTIM23CKSELR</name>
            <displayName>RCC_LPTIM23CKSELR</displayName>
            <description>RCC LPTIM2 and LPTIM3 kernel clock selection register</description>
            <addressOffset>0x62c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>LPTIM2SRC</name>
                <description>LPTIM2 kernel clock source selection
If LPTIM2 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Written by software.
others: the kernel clock is disabled</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pclk3 clock selected as kernel peripheral clock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll4_q_ck clock selected as kernel peripheral clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>per_ck clock selected as kernel peripheral clock</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>lse_ck clock selected as kernel peripheral clock</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>lsi_ck clock selected as kernel peripheral clock</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LPTIM3SRC</name>
                <description>LPTIM3 kernel clock source selection
If LPTIM3 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Written by software.
others: the kernel clock is disabled</description>
                <bitOffset>3</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pclk3 clock selected as kernel peripheral clock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll4_q_ck clock selected as kernel peripheral clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>per_ck clock selected as kernel peripheral clock</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>lse_ck clock selected as kernel peripheral clock</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>lsi_ck clock selected as kernel peripheral clock</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_LPTIM45CKSELR</name>
            <displayName>RCC_LPTIM45CKSELR</displayName>
            <description>RCC LPTIM4 and LPTIM5 kernel clock selection register</description>
            <addressOffset>0x630</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>LPTIM45SRC</name>
                <description>LPTIM4 and LPTIM5 kernel clock source selection
Written by software.
others: the kernel clock is disabled</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pclk3 clock selected as kernel peripheral clock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll4_p_ck clock selected as kernel peripheral clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>pll3_q_ck clock selected as kernel peripheral clock</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>lse_ck clock selected as kernel peripheral clock</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>lsi_ck clock selected as kernel peripheral clock</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x5</name>
                    <description>per_ck clock selected as kernel peripheral clock</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_SAI1CKSELR</name>
            <displayName>RCC_SAI1CKSELR</displayName>
            <description>RCC SAI1 kernel clock selection register</description>
            <addressOffset>0x634</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SAI1SRC</name>
                <description>SAI1 and DFSDM kernel clock source selection
Written by software.
others: reserved, the kernel clock is disabled</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll4_q_ck clock selected as kernel peripheral clock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll3_q_ck clock selected as kernel peripheral clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>I2S_CKIN clock selected as kernel peripheral clock</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>per_ck clock selected as kernel peripheral clock</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>pll3_r_ck clock selected as kernel peripheral clock</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
