STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>RCC_SAI2CKSELR</name>
            <displayName>RCC_SAI2CKSELR</displayName>
            <description>RCC SAI2 kernel clock selection register</description>
            <addressOffset>0x638</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SAI2SRC</name>
                <description>SAI2 kernel clock source selection
Written by software.
others: reserved, the kernel clock is disabled</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll4_q_ck clock selected as kernel peripheral clock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll3_q_ck clock selected as kernel peripheral clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>I2S_CKIN clock selected as kernel peripheral clock</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>per_ck clock selected as kernel peripheral clock</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>spdif_ck_symb clock from SPDIFRX selected as kernel peripheral clock</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x5</name>
                    <description>pll3_r_ck clock selected as kernel peripheral clock</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_FDCANCKSELR</name>
            <displayName>RCC_FDCANCKSELR</displayName>
            <description>RCC FDCAN kernel clock selection register</description>
            <addressOffset>0x63c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>FDCANSRC</name>
                <description>FDCAN kernel clock source selection
Written by software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>hse_ker_ck clock selected as kernel peripheral clock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll3_q_ck clock selected as kernel peripheral clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>pll4_q_ck clock selected as kernel peripheral clock</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>pll4_r_ck clock selected as kernel peripheral clock</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_SPDIFCKSELR</name>
            <displayName>RCC_SPDIFCKSELR</displayName>
            <description>RCC SPDIFRX kernel clock selection register</description>
            <addressOffset>0x640</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SPDIFSRC</name>
                <description>SPDIFRX kernel clock source selection
Written by software.
others: reserved, the kernel clock is disabled</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll4_p_ck clock selected as kernel peripheral clock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll3_q_ck clock selected as kernel peripheral clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>hsi_ker_ck clock selected as kernel peripheral clock</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_ADC12CKSELR</name>
            <displayName>RCC_ADC12CKSELR</displayName>
            <description>This register may be separately and securely write-protected at a field level depending on
the secure state of the corresponding peripheral, i.e. depending on the corresponding
DECPROT[1] field of the ETZPC register.
This register is used to control the selection of the kernel clock for the (AHB2) ADC1 and
ADC2 blocks. Note that changing the clock source on-the-fly is allowed, and will not
generate any timing violation, however the user has to ensure that both the previous and the
new clock sources are present during the switching, and for the whole transition time. Refer
to Section : Clock enabling delays.</description>
            <addressOffset>0x644</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>ADC1SRC</name>
                <description>ADC1 kernel clock source selection
If ADC1 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Written by software.
others: the kernel clock is disabled</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll4_r_ck clock selected as kernel peripheral clock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>per_ck clock selected as kernel peripheral clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>pll3_q_ck clock selected as kernel peripheral clock</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ADC2SRC</name>
                <description>ADC2 kernel clock source selection
If ADC2 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Written by software.
others: the kernel clock is disabled</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll4_r_ck clock selected as kernel peripheral clock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>per_ck clock selected as kernel peripheral clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>pll3_q_ck clock selected as kernel peripheral clock</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_SDMMC12CKSELR</name>
            <displayName>RCC_SDMMC12CKSELR</displayName>
            <description>This register may be separately and securely write-protected at a field level depending on
the secure state of the corresponding peripheral, i.e. depending on the corresponding
DECPROT[1] field of the ETZPC register.
This register is used to control the selection of the kernel clock for the (AHB6) SDMMC1 and
SDMMC2. Note that changing the clock source on-the-fly is allowed, and will not generate
any timing violation, however the user has to ensure that both the previous and the new
clock sources are present during the switching, and for the whole transition time. Refer to
Section : Clock enabling delays.</description>
            <addressOffset>0x648</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000003</resetValue>
            <fields>
              <field>
                <name>SDMMC1SRC</name>
                <description>SDMMC1 kernel clock source selection
If SDMMC1 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Written by software.
others: reserved, the kernel clock is disabled</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>hclk6 clock selected as kernel peripheral clock</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll3_r_ck clock selected as kernel peripheral clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>pll4_p_ck clock selected as kernel peripheral clock</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>hsi_ker_ck clock selected as kernel peripheral clock (default after reset)</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SDMMC2SRC</name>
                <description>SDMMC2 kernel clock source selection
If SDMMC2 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Written by software.
others: reserved, the kernel clock is disabled</description>
                <bitOffset>3</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>hclk6 clock selected as kernel peripheral clock</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll3_r_ck clock selected as kernel peripheral clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>pll4_p_ck clock selected as kernel peripheral clock</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>hsi_ker_ck clock selected as kernel peripheral clock (default after reset)</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_ETH12CKSELR</name>
            <displayName>RCC_ETH12CKSELR</displayName>
            <description>This register may be separately and securely write-protected at a field level depending on
the secure state of the corresponding peripheral, i.e. depending on the corresponding
DECPROT[1] field of the ETZPC register.
This register is used to control the selection of the kernel clock for the ETH1 and ETH2
blocks. Note that changing the clock source on-the-fly is allowed, and will not generate any
timing violation, however the user has to ensure that both the previous and the new clock
sources are present during the switching, and for the whole transition time. Refer to
Section : Clock enabling delays.</description>
            <addressOffset>0x64c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>ETH1SRC</name>
                <description>ETH1 kernel clock source selection
If ETH1 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Written by software.
others: the kernel clock is disabled</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll4_p_ck clock selected as kernel peripheral clock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll3_q_ck clock selected as kernel peripheral clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ETH1PTPDIV</name>
                <description>ETH1 clock divider for Precision Time Protocol (PTP)
If ETH1 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Written by software to configure the divider value.
...</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>bypass (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>division by 2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>division by 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xF</name>
                    <description>division by 16</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ETH2SRC</name>
                <description>ETH2 kernel clock source selection
If ETH2 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Written by software.
others: the kernel clock is disabled</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll4_p_ck clock selected as kernel peripheral clock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll3_q_ck clock selected as kernel peripheral clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ETH2PTPDIV</name>
                <description>ETH2 clock divider for Precision Time Protocol (PTP)
If ETH2 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Written by software to configure the divider value.
...</description>
                <bitOffset>12</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>bypass (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>division by 2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>division by 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xF</name>
                    <description>division by 16</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_USBCKSELR</name>
            <displayName>RCC_USBCKSELR</displayName>
            <description>This register may be separately and securely write-protected at a field level depending on
the secure state of the corresponding peripheral, i.e. depending on the corresponding
DECPROT[1] field of the ETZPC register.
This register is used to control the selection of the kernel clock for the USBPHY PLL of the
USB Host (USBH) and the USB On-The-Go (USBO). It also controls the pre-divider for the
reference clock for the USBPHY. Note that changing the clock source on-the-fly is allowed,
and will not generate any timing violation, however the user has to ensure that both the
previous and the new clock sources are present during the switching, and for the whole
transition time. Refer to Section : Clock enabling delays.</description>
            <addressOffset>0x650</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>USBPHYSRC</name>
                <description>USB PHY kernel clock source selection
If USBPHY block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Written by software.
other: clock disabled</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>hse_ker_ck clock selected as kernel peripheral clock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll4_r_ck clock selected as kernel peripheral clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>hse_ker_ck/2 clock selected as kernel peripheral clock</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>USBOSRC</name>
                <description>USB OTG kernel clock source selection
If USBO block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Written by software.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll4_r_ck clock selected as kernel peripheral clock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>clock provided by the USB PHY (rcc_ck_usbo_48m) selected as kernel peripheral clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
