STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>RCC_QSPICKSELR</name>
            <displayName>RCC_QSPICKSELR</displayName>
            <description>If (AHB6) QUADSPI is configured as secure via the corresponding DECPROT[1] field of the
ETZPC register, a write access to this register must be secure. A read access may be
secure or non-secure.
This register is used to control the selection of the kernel clock for the QUADSPI. Note that
changing the clock source on-the-fly is allowed, and will not generate any timing violation,
however the user has to ensure that both the previous and the new clock sources are
present during the switching, and for the whole transition time. Refer to Section : Clock
enabling delays.</description>
            <addressOffset>0x654</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>QSPISRC</name>
                <description>QUADSPI kernel clock source selection
Written by software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>aclk clock selected as kernel peripheral clock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll3_r_ck clock selected as kernel peripheral clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>pll4_p_ck clock selected as kernel peripheral clock</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>per_ck clock selected as kernel peripheral clock</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_FMCCKSELR</name>
            <displayName>RCC_FMCCKSELR</displayName>
            <description>If (AHB6) FMC is configured as secure via the corresponding DECPROT[1] field of the
ETZPC register, a write access to this register must be secure. A read access may be
secure or non-secure.
This register is used to control the selection of the kernel clock for the FMC block. Note that
changing the clock source on-the-fly is allowed, and will not generate any timing violation,
however the user has to ensure that both the previous and the new clock sources are
present during the switching, and for the whole transition time. Refer to Section : Clock
enabling delays.</description>
            <addressOffset>0x658</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>FMCSRC</name>
                <description>FMC kernel clock source selection
Written by software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>aclk clock selected as kernel peripheral clock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll3_r_ck clock selected as kernel peripheral clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>pll4_p_ck clock selected as kernel peripheral clock</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>per_ck clock selected as kernel peripheral clock</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_RNG1CKSELR</name>
            <displayName>RCC_RNG1CKSELR</displayName>
            <description>If (AHB5) RNG1 is configured as secure via the corresponding DECPROT[1] field of the
ETZPC register, a write access to this register must be secure. A read access may be
secure or non-secure.
This register is used to control the selection of the kernel clock for the RNG1. Note that
changing the clock source on-the-fly is allowed, and will not generate any timing violation,
however the user has to ensure that both the previous and the new clock sources are
present during the switching, and for the whole transition time. Refer to Section : Clock
enabling delays.</description>
            <addressOffset>0x65c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RNG1SRC</name>
                <description>RNG1 kernel clock source selection
Written by software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>csi_ker_ck clock selected as kernel peripheral clock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll4_r_ck clock selected as kernel peripheral clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>lse_ck clock selected as kernel peripheral clock</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>lsi_ck clock selected as kernel peripheral clock</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_STGENCKSELR</name>
            <displayName>RCC_STGENCKSELR</displayName>
            <description>If (APB5) STGENC is configured as secure via the corresponding DECPROT[1] field of the
ETZPC register, a write access to this register must be secure. A read access may be
secure or non-secure.
STGEN is a dual APB interface IP, with STGENC APB5 controller part which may be secure
or non-secure depending on the corresponding DECPROT[1]. Its other STGENRO APB4
read-only interface is non-secure.
This register is used to select the peripheral clock for the STGEN block. Note that this clock
is used to provide a time reference for the application. Refer to Section : Clock enabling
delays.</description>
            <addressOffset>0x660</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>STGENSRC</name>
                <description>Oscillator selection for kernel clock
Set and cleared by software.
others: Clock disabled</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>hsi_ker_ck clock selected (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>hse_ker_ck clock selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_DCMIPPCKSELR</name>
            <displayName>RCC_DCMIPPCKSELR</displayName>
            <description>If (APB4) DCMIPP is configured as secure via the corresponding DECPROT[1] field of the
ETZPC register, a write access to this register must be secure. A read access may be
secure or non-secure.
This register is used to control the selection of the kernel clock for the DCMIPP block. Note
that changing the clock source on-the-fly is allowed, and will not generate any timing
violation, however the user has to ensure that both the previous and the new clock sources
are present during the switching, and for the whole transition time. Refer to Section : Clock
enabling delays.</description>
            <addressOffset>0x664</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DCMIPPSRC</name>
                <description>DCMIPP kernel clock source selection
Written by software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>aclk clock selected as kernel peripheral clock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll2_q_ck clock selected as kernel peripheral clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>pll4_p_ck clock selected as kernel peripheral clock</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>per_ck clock selected as kernel peripheral clock</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_SAESCKSELR</name>
            <displayName>RCC_SAESCKSELR</displayName>
            <description>If (AHB5) SAES is configured as secure via the corresponding DECPROT[1] field of the
ETZPC register, a write access to this register must be secure. A read access may be
secure or non-secure.
This register is used to control the selection of the kernel clock for the SAES block. Note that
changing the clock source on-the-fly is allowed, and will not generate any timing violation,
however the user has to ensure that both the previous and the new clock sources are
present during the switching, and for the whole transition time. Refer to Section : Clock
enabling delays.</description>
            <addressOffset>0x668</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SAESSRC</name>
                <description>SAES kernel clock source selection
Written by software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>axiss_ck clock selected as kernel peripheral clock (default after reset)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>per_ck clock selected as kernel peripheral clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>pll_4_r_ck clock selected as kernel peripheral clock</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>lsi_ck clock selected as kernel peripheral clock</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
