STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>RCC_APB4RSTCLRR</name>
            <displayName>RCC_APB4RSTCLRR</displayName>
            <description>This register may be separately and securely write-protected at a field level, as detailed in
the following register fields description.
This register is used to release the reset of the corresponding peripheral. Writing '0' has no
effect, reading will return the effective values of the corresponding bits. Writing a '1' releases
the reset of the corresponding peripheral.</description>
            <addressOffset>0x6bc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>LTDCRST</name>
                <description>LTDC block reset
If LTDC is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Cleared by software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the block reset is released</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' releases the block reset, reading '1' means that the block reset is asserted</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DCMIPPRST</name>
                <description>DCMIPP block reset
If DCMIPP is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Cleared by software.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the block reset is released</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' releases the block reset, reading '1' means that the block reset is asserted</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DDRPERFMRST</name>
                <description>DDRPERFM block reset
Cleared by software.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the block reset is released</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' releases the block reset, reading '1' means that the block reset is asserted</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>USBPHYRST</name>
                <description>USBPHYC block reset
If USB PHY is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Cleared by software.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the block reset is released</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' releases the block reset, reading '1' means that the block reset is asserted</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_APB5RSTSETR</name>
            <displayName>RCC_APB5RSTSETR</displayName>
            <description>This register may be separately and securely write-protected at a field level depending on
the secure state of the corresponding peripheral, i.e. depending on the corresponding
DECPROT[1] field of the ETZPC register.
This register is used to activate the reset of the corresponding peripheral. Writing '0' has no
effect, reading will return the effective values of the corresponding bits. Writing a '1'
activates the reset of the corresponding peripheral.</description>
            <addressOffset>0x6c0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>STGENRST</name>
                <description>STGEN block reset
If STGENC (STGEN controller sub-part) is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Set by software.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the block reset is released</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' asserts the block reset, reading '1' means that the block reset is asserted</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_APB5RSTCLRR</name>
            <displayName>RCC_APB5RSTCLRR</displayName>
            <description>This register may be separately and securely write-protected at a field level depending on
the secure state of the corresponding peripheral, i.e. depending on the corresponding
DECPROT[1] field of the ETZPC register.
This register is used to release the reset of the corresponding peripheral. Writing '0' has no
effect, reading will return the effective values of the corresponding bits. Writing a '1' releases
the reset of the corresponding peripheral.</description>
            <addressOffset>0x6c4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>STGENRST</name>
                <description>STGEN block reset
If STGENC (STGEN controller sub-part) is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Cleared by software.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the block reset is released</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' releases the block reset, reading '1' means that the block reset is asserted</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
