STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>RCC_MP_APB4LPENSETR</name>
            <displayName>RCC_MP_APB4LPENSETR</displayName>
            <description>This register may be separately and securely write-protected at a field level, as detailed in
the following register fields description.
This register is used in order to set the PERxLPEN bit of the corresponding peripheral.
Writing '0' has no effect, reading will return the effective values of the corresponding bits.
Writing a '1' sets the corresponding bit to '1'.</description>
            <addressOffset>0x828</addressOffset>
            <size>0x20</size>
            <resetValue>0x00118102</resetValue>
            <fields>
              <field>
                <name>DCMIPPLPEN</name>
                <description>DCMIPP peripheral clocks enable during CSleep mode
If DCMIPP is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Set by software.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DDRPERFMLPEN</name>
                <description>DDRPERFM APB clock enable during CSleep mode
Set by software.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the APB clock is disabled in CSleep</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the APB clock in CSleep, reading '1' means that the APB clock is enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IWDG2APBLPEN</name>
                <description>IWDG2 APB clock enable during CSleep mode
Set by software.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the APB clock is disabled in CSleep</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the APB clock in CSleep, reading '1' means that the APB clock is enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>USBPHYLPEN</name>
                <description>USBPHYC peripheral clocks enable during CSleep mode
If USB PHY is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Set by software.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>STGENROLPEN</name>
                <description>STGEN read-only interface peripheral clocks enable during CSleep mode
Set by software.
The peripheral clocks of the STGEN read-only interface are the pclk4, and the kernel clock as selected by the RCC_STGENCKSELR register.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the pclk4 is disabled in CSleep, and that the kernel clock gating is defined by RCC_MP_APB5ENxxxR.STGENCEN with xxx=SET/CLR</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the pclk4 and the kernel clock in CSleep; reading '1' means that the pck4 and the kernel clock are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>STGENROSTPEN</name>
                <description>STGEN read-only interface peripheral clocks enable during CStop mode
Set by software.
The peripheral clocks of the STGEN read-only interface are the pclk4, and the kernel clock as selected by the RCC_STGENCKSELR register.</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the pclk4 is disabled in CStop, and that the kernel clock gating is defined by RCC_MP_APB5ENxxxR.STGENCEN with xxx=SET/CLR</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the pclk4 and the kernel clock in CStop; reading '1' means that the pck4 and the kernel clock are enabled in CStop</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_MP_APB4LPENCLRR</name>
            <displayName>RCC_MP_APB4LPENCLRR</displayName>
            <description>This register may be separately and securely write-protected at a field level, as detailed in
the following register fields description.
This register is used in order to clear the PERxLPEN bit of the corresponding peripheral.
Writing '0' has no effect, reading will return the effective values of the corresponding bits.
Writing a '1' sets the corresponding bit to '0'.</description>
            <addressOffset>0x82c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00118102</resetValue>
            <fields>
              <field>
                <name>DCMIPPLPEN</name>
                <description>DCMIPP peripheral clocks enable during CSleep mode
If DCMIPP is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Cleared by software.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' disables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DDRPERFMLPEN</name>
                <description>DDRPERFM APB clock enable during CSleep mode
Cleared by software.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the APB clock is disabled in CSleep</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' disables the APB clock in CSleep, reading '1' means that the APB clock is enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IWDG2APBLPEN</name>
                <description>IWDG2 APB clock enable during CSleep mode
Cleared by software.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the APB clock is disabled in CSleep</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' disables the APB clock in CSleep, reading '1' means that the APB clock is enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>USBPHYLPEN</name>
                <description>USBPHYC peripheral clocks enable during CSleep mode
If USB PHY is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Cleared by software.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' disables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>STGENROLPEN</name>
                <description>STGEN read-only interface peripheral clocks enable during CSleep mode
Cleared by software.
The peripheral clocks of the STGEN read-only interface are the pclk4, and the kernel clock as selected by the RCC_STGENCKSELR register.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the pclk4 is disabled in CSleep, and that the kernel clock gating is defined by RCC_MP_APB5LPENxxxR.STGENCLPEN with xxx=SET/CLR</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' disables the pclk4 and the kernel clock in CSleep; reading '1' means that the pck4 and the kernel clock are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>STGENROSTPEN</name>
                <description>STGEN read-only interface peripheral clocks enable during CStop mode
Cleared by software.
The peripheral clocks of the STGEN read-only interface are the pclk4, and the kernel clock as selected by the RCC_STGENCKSELR register.</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the pclk4 is disabled in CStop, and that the kernel clock gating is defined by RCC_MP_APB5LPENxxxR.STGENCLPEN with xxx=SET/CLR</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' disables the pclk4 and the kernel clock in CStop; reading '1' means that the pck4 and the kernel clock are enabled in CStop</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_MP_S_APB4LPENSETR</name>
            <displayName>RCC_MP_S_APB4LPENSETR</displayName>
            <description>This is a secure register for enabling the clock of the LTDC when it is used with a secure
composition layer. A write access to this register field must be secure. A read access may
be secure or non-secure.
This register is used in order to set the PERxLPEN bit of the corresponding peripheral.
Writing '0' has no effect, reading will return the effective values of the corresponding bits.
Writing a '1' sets the corresponding bit to '1'.</description>
            <addressOffset>0x830</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>LTDCLPEN</name>
                <description>LTDC peripheral clocks enable during CSleep mode
Set by (secure) software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_MP_S_APB4LPENCLRR</name>
            <displayName>RCC_MP_S_APB4LPENCLRR</displayName>
            <description>This is a secure register for disabling the clock of the LTDC when it is used with a secure
composition layer. A write access to this register field must be secure. A read access may
be secure or non-secure.
This register is used in order to clear the PERxLPEN bit of the corresponding peripheral.
Writing '0' has no effect, reading will return the effective values of the corresponding bits.
Writing a '1' sets the corresponding bit to '0'.</description>
            <addressOffset>0x834</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>LTDCLPEN</name>
                <description>LTDC peripheral clocks enable during CSleep mode
Cleared by (secure) software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' disables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_MP_NS_APB4LPENSETR</name>
            <displayName>RCC_MP_NS_APB4LPENSETR</displayName>
            <description>This is a non-secure register, for enabling the clock of the LTDC when it is used with one or
two non-secure composition layers.
This register is used in order to set the PERxLPEN bit of the corresponding peripheral.
Writing '0' has no effect, reading will return the effective values of the corresponding bits.
Writing a '1' sets the corresponding bit to '1'.</description>
            <addressOffset>0x838</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>LTDCLPEN</name>
                <description>LTDC peripheral clocks enable during CSleep mode
Set by software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_MP_NS_APB4LPENCLRR</name>
            <displayName>RCC_MP_NS_APB4LPENCLRR</displayName>
            <description>This is a non-secure register, for disabling the clock of the LTDC when it is used with one or
two non-secure composition layers.
This register is used in order to clear the PERxLPEN bit of the corresponding peripheral.
Writing '0' has no effect, reading will return the effective values of the corresponding bits.
Writing a '1' sets the corresponding bit to '0'.</description>
            <addressOffset>0x83c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>LTDCLPEN</name>
                <description>LTDC peripheral clocks enable during CSleep mode
Cleared by software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' disables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
