STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>RCC_MP_APB6LPENSETR</name>
            <displayName>RCC_MP_APB6LPENSETR</displayName>
            <description>This register may be separately and securely write-protected at a field level depending on
the secure state of the corresponding peripheral, i.e. depending on the corresponding
DECPROT[1] field of the ETZPC register.
This register is used in order to set the PERxLPEN bit of the corresponding peripheral.
Writing '0' has no effect, reading will return the effective values of the corresponding bits.
Writing a '1' sets the corresponding bit to '1'.</description>
            <addressOffset>0x848</addressOffset>
            <size>0x20</size>
            <resetValue>0x00001FFF</resetValue>
            <fields>
              <field>
                <name>USART1LPEN</name>
                <description>USART1 peripherals clocks during CSleep mode
If USART1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Cleared by software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripherals clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the peripherals clocks in CSleep, reading '1' means that the peripherals clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>USART2LPEN</name>
                <description>USART2 peripherals clocks during CSleep mode
If USART2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Cleared by software.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripherals clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the peripherals clocks in CSleep, reading '1' means that the peripherals clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SPI4LPEN</name>
                <description>SPI4 peripherals clocks during CSleep mode
If SPI4 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Cleared by software.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripherals clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the peripherals clocks in CSleep, reading '1' means that the peripherals clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SPI5LPEN</name>
                <description>SPI5 peripherals clocks during CSleep mode
If SPI5 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Cleared by software.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripherals clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the peripherals clocks in CSleep, reading '1' means that the peripherals clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C3LPEN</name>
                <description>I2C3 peripherals clocks during CSleep mode
If I2C3 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Cleared by software.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripherals clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the peripherals clocks in CSleep, reading '1' means that the peripherals clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C4LPEN</name>
                <description>I2C4 peripherals clocks during CSleep mode
If I2C4 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Cleared by software.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripherals clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the peripherals clocks in CSleep, reading '1' means that the peripherals clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C5LPEN</name>
                <description>I2C5 peripherals clocks during CSleep mode
If I2C5 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Cleared by software.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripherals clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the peripherals clocks in CSleep, reading '1' means that the peripherals clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM12LPEN</name>
                <description>TIM12 peripherals clocks during CSleep mode
If TIM12 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Cleared by software.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripherals clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the peripherals clocks in CSleep, reading '1' means that the peripherals clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM13LPEN</name>
                <description>TIM13 peripherals clocks during CSleep mode
If TIM13 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Cleared by software.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripherals clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the peripherals clocks in CSleep, reading '1' means that the peripherals clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM14LPEN</name>
                <description>TIM14 peripherals clocks during CSleep mode
If TIM14 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Cleared by software.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripherals clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the peripherals clocks in CSleep, reading '1' means that the peripherals clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM15LPEN</name>
                <description>TIM15 peripherals clocks during CSleep mode
If TIM15 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Cleared by software.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripherals clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the peripherals clocks in CSleep, reading '1' means that the peripherals clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM16LPEN</name>
                <description>TIM16 peripherals clocks during CSleep mode
If TIM16 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Cleared by software.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripherals clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the peripherals clocks in CSleep, reading '1' means that the peripherals clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM17LPEN</name>
                <description>TIM17 peripherals clocks during CSleep mode
If TIM17 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Cleared by software.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripherals clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the peripherals clocks in CSleep, reading '1' means that the peripherals clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
