STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>RCC_MP_S_AHB4LPENSETR</name>
            <displayName>RCC_MP_S_AHB4LPENSETR</displayName>
            <description>This is a secure register, for enabling the clock of the secure (AHB4) GPIO ports, as defined
by the GPIO register file and more specifically the GPIOxSECCFGR.SECy control bit with
x=A..I, and y = 0..15 (or 2 for x=I). A write access to this register field must be secure. A
read access may be secure or non-secure.
This register is used in order to set the PERxLPEN bit of the corresponding peripheral.
Writing '0' has no effect, reading will return the effective values of the corresponding bits.
Writing a '1' sets the corresponding bit to '1'.</description>
            <addressOffset>0x868</addressOffset>
            <size>0x20</size>
            <resetValue>0x000001FF</resetValue>
            <fields>
              <field>
                <name>GPIOALPEN</name>
                <description>GPIOA peripheral clocks enable during CSleep mode
Set by (secure) software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GPIOBLPEN</name>
                <description>GPIOB peripheral clocks enable during CSleep mode
Set by (secure) software.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GPIOCLPEN</name>
                <description>GPIOC peripheral clocks enable during CSleep mode
Set by (secure) software.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GPIODLPEN</name>
                <description>GPIOD peripheral clocks enable during CSleep mode
Set by (secure) software.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GPIOELPEN</name>
                <description>GPIOE peripheral clocks enable during CSleep mode
Set by (secure) software.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GPIOFLPEN</name>
                <description>GPIOF peripheral clocks enable during CSleep mode
Set by (secure) software.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GPIOGLPEN</name>
                <description>GPIOG peripheral clocks enable during CSleep mode
Set by (secure) software.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GPIOHLPEN</name>
                <description>GPIOH peripheral clocks enable during CSleep mode
Set by (secure) software.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GPIOILPEN</name>
                <description>GPIOI peripheral clocks enable during CSleep mode
Set by (secure) software.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_MP_S_AHB4LPENCLRR</name>
            <displayName>RCC_MP_S_AHB4LPENCLRR</displayName>
            <description>This is a secure register, for disabling the clock of the secure (AHB4) GPIO ports</description>
            <addressOffset>0x86c</addressOffset>
            <size>0x20</size>
            <resetValue>0x000001FF</resetValue>
            <fields>
              <field>
                <name>GPIOALPEN</name>
                <description>GPIOA peripheral clocks enable during CSleep mode
Cleared by (secure) software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' disables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GPIOBLPEN</name>
                <description>GPIOB peripheral clocks enable during CSleep mode
Cleared by (secure) software.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' disables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GPIOCLPEN</name>
                <description>GPIOC peripheral clocks enable during CSleep mode
Cleared by (secure) software.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' disables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GPIODLPEN</name>
                <description>GPIOD peripheral clocks enable during CSleep mode
Cleared by (secure) software.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' disables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GPIOELPEN</name>
                <description>GPIOE peripheral clocks enable during CSleep mode
Cleared by (secure) software.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' disables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GPIOFLPEN</name>
                <description>GPIOF peripheral clocks enable during CSleep mode
Cleared by (secure) software.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' disables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GPIOGLPEN</name>
                <description>GPIOG peripheral clocks enable during CSleep mode
Cleared by (secure) software.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' disables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GPIOHLPEN</name>
                <description>GPIOH peripheral clocks enable during CSleep mode
Cleared by (secure) software.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' disables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GPIOILPEN</name>
                <description>GPIOI peripheral clocks enable during CSleep mode
Cleared by (secure) software.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' disables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
