STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>RCC_MP_S_AHB6LPENCLRR</name>
            <displayName>RCC_MP_S_AHB6LPENCLRR</displayName>
            <description>This is a secure register for disabling the clock of the MDMA in Sleep mode when it is not
used as secure. A write access to this register field must be secure. A read access may be
secure or non-secure.
This register is used in order to clear the PERxLPEN bit of the corresponding peripheral.
Writing '0' has no effect, reading will return the effective values of the corresponding bits.
Writing a '1' sets the corresponding bit to '0'.</description>
            <addressOffset>0x88c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>MDMALPEN</name>
                <description>MDMA peripheral clocks enable during CSleep mode
Cleared by (secure) software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' disables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_MP_NS_AHB6LPENSETR</name>
            <displayName>RCC_MP_NS_AHB6LPENSETR</displayName>
            <description>This is a non-secure register for enabling the clock of the MDMA in Sleep mode when it is
not used as secure.
This register is used in order to set the PERxLPEN bit of the corresponding peripheral.
Writing '0' has no effect, reading will return the effective values of the corresponding bits.
Writing a '1' sets the corresponding bit to '1'.</description>
            <addressOffset>0x890</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>MDMALPEN</name>
                <description>MDMA peripheral clocks enable during CSleep mode
Set by software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_MP_NS_AHB6LPENCLRR</name>
            <displayName>RCC_MP_NS_AHB6LPENCLRR</displayName>
            <description>This is a non-secure register for disabling the clock of the MDMA in Sleep mode when it is
not used as secure.
This register is used in order to clear the PERxLPEN bit of the corresponding peripheral.
Writing '0' has no effect, reading will return the effective values of the corresponding bits.
Writing a '1' sets the corresponding bit to '0'.</description>
            <addressOffset>0x894</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>MDMALPEN</name>
                <description>MDMA peripheral clocks enable during CSleep mode
Cleared by software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the peripheral clocks are disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' disables the peripheral clocks in CSleep, reading '1' means that the peripheral clocks are enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_MP_S_AXIMLPENSETR</name>
            <displayName>RCC_MP_S_AXIMLPENSETR</displayName>
            <description>This is a secure register, for enabling the clock of the SYSRAM during CSleep mode. A write
access to this register field must be secure. A read access may be secure or non-secure.
This register is used in order to set the PERxLPEN bit of the corresponding peripheral.
Writing '0' has no effect, reading will return the effective values of the corresponding bits.
Writing a '1' sets the corresponding bit to '1'.</description>
            <addressOffset>0x898</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>SYSRAMLPEN</name>
                <description>SYSRAM interface clock enable during CSleep mode
Set by (secure) software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the memory interface clock is disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the memory interface clock in CSleep, reading '1' means that the memory interface clock is enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_MP_S_AXIMLPENCLRR</name>
            <displayName>RCC_MP_S_AXIMLPENCLRR</displayName>
            <description>This is a secure register, for disabling the clock of the SYSRAM during CSleep mode.</description>
            <addressOffset>0x89c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>SYSRAMLPEN</name>
                <description>SYSRAM interface clock enable during CSleep mode
Cleared by (secure) software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the memory interface is disabled in CSleep</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' disables the memory interface in CSleep, reading '1' means that the memory interface is enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_MP_NS_AXIMLPENSETR</name>
            <displayName>RCC_MP_NS_AXIMLPENSETR</displayName>
            <description>This is a non-secure register, for enabling the clock of the SYSRAM during CSleep mode.
This register is used in order to set the PERxLPEN bit of the corresponding peripheral.
Writing '0' has no effect, reading will return the effective values of the corresponding bits.
Writing a '1' sets the corresponding bit to '1'.</description>
            <addressOffset>0x8a0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>SYSRAMLPEN</name>
                <description>SYSRAM interface clock enable during CSleep mode
Set by software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the memory interface clock is disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the memory interface clock in CSleep, reading '1' means that the memory interface clock is enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_MP_NS_AXIMLPENCLRR</name>
            <displayName>RCC_MP_NS_AXIMLPENCLRR</displayName>
            <description>This is a non-secure register, for disabling the clock of the SYSRAM during CSleep mode.</description>
            <addressOffset>0x8a4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>SYSRAMLPEN</name>
                <description>SYSRAM interface clock enable during CSleep mode
Cleared by software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the memory interface is disabled in CSleep</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' disables the memory interface in CSleep, reading '1' means that the memory interface is enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_MP_MLAHBLPENSETR</name>
            <displayName>RCC_MP_MLAHBLPENSETR</displayName>
            <description>This register may be separately and securely write-protected at a field level, as detailed in
the following register fields description.
This register is used in order to set the PERxLPEN bit of the corresponding peripheral.
Writing '0' has no effect, reading will return the effective values of the corresponding bits.
Writing a '1' sets the corresponding bit to '1'.</description>
            <addressOffset>0x8a8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000007</resetValue>
            <fields>
              <field>
                <name>SRAM1LPEN</name>
                <description>SRAM1 interface clock enable during CSleep mode
If SRAM1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Set by software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the memory interface clock is disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the memory interface clock in CSleep, reading '1' means that the memory interface is enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SRAM2LPEN</name>
                <description>SRAM2 interface clock enable during CSleep mode
If SRAM2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Set by software.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the memory interface clock is disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the memory interface clock in CSleep, reading '1' means that the memory interface is enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SRAM3LPEN</name>
                <description>SRAM3 interface clock enable during CSleep mode
If SRAM3 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Set by software.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the memory interface clock is disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' enables the memory interface clock in CSleep, reading '1' means that the memory interface is enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_MP_MLAHBLPENCLRR</name>
            <displayName>RCC_MP_MLAHBLPENCLRR</displayName>
            <description>This register may be separately and securely write-protected at a field level</description>
            <addressOffset>0x8ac</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000007</resetValue>
            <fields>
              <field>
                <name>SRAM1LPEN</name>
                <description>SRAM1 interface clock enable during CSleep mode
If SRAM1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Cleared by software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the memory interface clock is disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' disables the memory interface clock in CSleep, reading '1' means that the memory interface is enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SRAM2LPEN</name>
                <description>SRAM2 interface clock enable during CSleep mode
If SRAM2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Cleared by software.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the memory interface clock is disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' disables the memory interface clock in CSleep, reading '1' means that the memory interface is enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SRAM3LPEN</name>
                <description>SRAM3 interface clock enable during CSleep mode
If SRAM3 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure.
Cleared by software.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means that the memory interface clock is disabled in CSleep	</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' disables the memory interface clock in CSleep, reading '1' means that the memory interface is enabled in CSleep</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_APB3SECSR</name>
            <displayName>RCC_APB3SECSR</displayName>
            <description>This read register reflects at a bit level the secure state of each APB3 securable peripheral,
as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
            <addressOffset>0x8c0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00004003</resetValue>
			<fields>		  
			   <field>
				 <name>LPTIM2SECF</name>
				 <description>LPTIM2 block secure status flag
	This bit reflects the LPTIM2 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
				 <bitOffset>0</bitOffset>
				 <bitWidth>1</bitWidth>
				 <access>read-only</access>
				 <enumeratedValues>
					<enumeratedValue>
					   <name>B_0x0</name>
					   <description>peripheral is non-secure</description>
					   <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					   <name>B_0x1</name>
					   <description>peripheral is secure</description>
					   <value>0x1</value>
					</enumeratedValue>
			  </enumeratedValues>
			  </field>
			  <field>
				<name>LPTIM3SECF</name>
				<description>LPTIM3 block secure status flag
	This bit reflects the LPTIM3 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
			   <bitOffset>1</bitOffset>
			   <bitWidth>1</bitWidth>
			   <access>read-only</access>
			   <enumeratedValues>
				 <enumeratedValue>
					 <name>B_0x0</name>
					 <description>peripheral is non-secure</description>
					 <value>0x0</value>
				 </enumeratedValue>
				 <enumeratedValue>
					 <name>B_0x1</name>
					 <description>peripheral is secure</description>
					 <value>0x1</value>
				 </enumeratedValue>
			   </enumeratedValues>
			 </field>
			 <field>
			   <name>VREFSECF</name>
			   <description>VREF block secure status flag
	This bit reflects the VREF block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
			  <bitOffset>13</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-only</access>
			  <enumeratedValues>
				<enumeratedValue>
					<name>B_0x0</name>
					<description>peripheral is non-secure</description>
					<value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
					<name>B_0x1</name>
					<description>peripheral is secure</description>
					<value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
		   </fields>
          </register>
