STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>RCC_APB4SECSR</name>
            <displayName>RCC_APB4SECSR</displayName>
            <description>This read register reflects at a bit level the secure state of each APB4 securable peripheral,
as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
            <addressOffset>0x8c4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00010002</resetValue>
            <fields>
              <field>
                <name>DCMIPPSECF</name>
                <description>DCMIPP block secure status flag
This bit reflects the DCMIPP block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>USBPHYSECF</name>
                <description>USBPHY block secure status flag
This bit reflects the USBPHY block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_APB5SECSR</name>
            <displayName>RCC_APB5SECSR</displayName>
            <description>This read register reflects at a bit level the secure state of each APB5 secure or securable
peripheral, as configured either via the corresponding DECPROT[1] field of the ETZPC
register or via the TrustZone-aware peripheral itself.</description>
            <addressOffset>0x8c8</addressOffset>
            <size>0x20</size>
            <resetValue>0x0031A800</resetValue>
            <fields>
              <field>
                <name>RTCSECF</name>
                <description>RTC block secure status flag
This bit reflects the RTC block secure state. If at least one function of the RTC is configured as secure via the RTC_SECCFGR register (i.e. if the input signal rtc_sec driven by RTC is asserted), this bit is asserted.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure (default)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure (at least one RTC sub-function)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TZCSECF</name>
                <description>TZC block secure status flag
This bit reflects the TZC block secure state.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ETZPCSECF</name>
                <description>ETZPC block secure status flag
This bit reflects the ETZPC block secure state.</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IWDG1SECF</name>
                <description>IWDG1 block secure status flag
This bit reflects the IWDG1 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BSECSECF</name>
                <description>BSEC block secure status flag
This bit reflects the BSEC block secure state.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>STGENCSECF</name>
                <description>STGENC block secure status flag
This field reflects the STGENC block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>peripheral is secure</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_APB6SECSR</name>
            <displayName>RCC_APB6SECSR</displayName>
            <description>This read register reflects at a bit level the secure state of each APB6 securable peripheral,
as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
            <addressOffset>0x8cc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00001FFF</resetValue>
            <fields>
              <field>
                <name>USART1SECF</name>
                <description>USART1 block secure status flag
This bit reflects the USART1 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>USART2SECF</name>
                <description>USART2 block secure status flag
This bit reflects the USART2 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SPI4SECF</name>
                <description>SPI4 block secure status flag
This bit reflects the SPI4 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SPI5SECF</name>
                <description>SPI5 block secure status flag
This bit reflects the SPI5 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C3SECF</name>
                <description>I2C3 block secure status flag
This bit reflects the I2C3 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C4SECF</name>
                <description>I2C4 block secure status flag
This bit reflects the I2C4 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C5SECF</name>
                <description>I2C5 block secure status flag
This bit reflects the I2C5 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM12SECF</name>
                <description>TIM12 block secure status flag
This bit reflects the TIM12 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM13SECF</name>
                <description>TIM13 block secure status flag
This bit reflects the TIM13 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM14SECF</name>
                <description>TIM14 block secure status flag
This bit reflects the TIM14 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM15SECF</name>
                <description>TIM15 block secure status flag
This bit reflects the TIM15 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM16SECF</name>
                <description>TIM16 block secure status flag
This bit reflects the TIM16 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM17SECF</name>
                <description>TIM17 block secure status flag
This bit reflects the TIM17 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
