STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>RCC_AHB2SECSR</name>
            <displayName>RCC_AHB2SECSR</displayName>
            <description>This read register reflects at a bit level the secure state of each AHB2 securable peripheral,
as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
            <addressOffset>0x8d0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000178</resetValue>
            <fields>
              <field>
                <name>DMA3SECF</name>
                <description>DMA3 block secure status flag
This bit reflects the DMA3 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DMAMUX2SECF</name>
                <description>DMAMUX2 block secure status flag
This bit reflects the DMAMUX2 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ADC1SECF</name>
                <description>ADC1 block secure status flag
This bit reflects the ADC1 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ADC2SECF</name>
                <description>ADC2 block secure status flag
This bit reflects the ADC2 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>USBOSECF</name>
                <description>USBO block secure status flag
This bit reflects the USBO block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_AHB4SECSR</name>
            <displayName>RCC_AHB4SECSR</displayName>
            <description>This read register reflects at a bit level the secure state of each AHB4 securable peripheral,
as configured either via the corresponding DECPROT[1] field of the ETZPC register or via
the TrustZone-aware peripheral itself.</description>
            <addressOffset>0x8d4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00004000</resetValue>
            <fields>
              <field>
                <name>TSCSECF</name>
                <description>TSC block secure status flag
This bit reflects the TSC block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_AHB5SECSR</name>
            <displayName>RCC_AHB5SECSR</displayName>
            <description>This read register reflects at a bit level the secure state of each AHB5 securable peripheral,
as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
            <addressOffset>0x8d8</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000017C</resetValue>
            <fields>
              <field>
                <name>PKASECF</name>
                <description>PKA block secure status flag
This bit reflects the PKA block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SAESSECF</name>
                <description>SAES block secure status flag
This bit reflects the SAES block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CRYP1SECF</name>
                <description>CRYP1 block secure status flag
This bit reflects the CRYP1 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HASH1SECF</name>
                <description>HASH1 block secure status flag
This bit reflects the HASH1 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RNG1SECF</name>
                <description>RNG1 block secure status flag
This bit reflects the RNG1 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BKPSRAMSECF</name>
                <description>BKPSRAM block secure status flag
This bit reflects the BKPSRAM block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_AHB6SECSR</name>
            <displayName>RCC_AHB6SECSR</displayName>
            <description>This read register reflects at a bit level the secure state of each AHB6 securable peripheral,
as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
            <addressOffset>0x8dc</addressOffset>
            <size>0x20</size>
            <resetValue>0xF8035F82</resetValue>
            <fields>
              <field>
                <name>MCESECF</name>
                <description>MCE block secure status flag
This bit reflects the MCE block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ETH1SECF</name>
                <description>ETH1 block secure status flag
This field reflects the ETH1 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1F</name>
                    <description>peripheral is secure</description>
                    <value>0x1F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FMCSECF</name>
                <description>FMC block secure status flag
This bit reflects the FMC block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>QSPISECF</name>
                <description>QSPI block secure status flag
This bit reflects the QSPI block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SDMMC1SECF</name>
                <description>SDMMC1 block secure status flag
This bit reflects the SDMMC1 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SDMMC2SECF</name>
                <description>SDMMC2 block secure status flag
This bit reflects the SDMMC2 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>peripheral is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ETH2SECF</name>
                <description>ETH2 block secure status flag
This field reflects the ETH2 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register.</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>peripheral is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1F</name>
                    <description>peripheral is secure</description>
                    <value>0x1F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_VERR</name>
            <displayName>RCC_VERR</displayName>
            <description>This register gives the IP version</description>
            <addressOffset>0xff4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000020</resetValue>
            <fields>
              <field>
                <name>MINREV</name>
                <description>Minor Revision of the IP</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>MAJREV</name>
                <description>Major Revision of the IP</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_IDR</name>
            <displayName>RCC_IDR</displayName>
            <description>This register gives the unique identifier of the RCC</description>
            <addressOffset>0xff8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>ID</name>
                <description>Identifier of the RCC</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_SIDR</name>
            <displayName>RCC_SIDR</displayName>
            <description>This register gives the decoding space, which is for the RCC of 4 kB.</description>
            <addressOffset>0xffc</addressOffset>
            <size>0x20</size>
            <resetValue>0xA3C5DD04</resetValue>
            <fields>
              <field>
                <name>SID</name>
                <description>Decoding space is 4 kbytes</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
