STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>SAES_SUSP6R</name>
            <displayName>SAES_SUSP6R</displayName>
            <description>SAES suspend registers </description>
            <addressOffset>0x58</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SUSP</name>
                <description>SAES suspend
Upon suspend operation, this bitfield of the corresponding SAES_SUSPxR register takes the value of one of internal SAES registers.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SAES_SUSP7R</name>
            <displayName>SAES_SUSP7R</displayName>
            <description>SAES suspend registers </description>
            <addressOffset>0x5c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SUSP</name>
                <description>SAES suspend
Upon suspend operation, this bitfield of the corresponding SAES_SUSPxR register takes the value of one of internal SAES registers.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SAES_IER</name>
            <displayName>SAES_IER</displayName>
            <description>SAES interrupt enable register </description>
            <addressOffset>0x300</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CCFIE</name>
                <description>Computation complete flag interrupt enable
This bit enables or disables (masks) the SAES interrupt generation when CCF (computation complete flag) is set.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Disabled (masked)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Enabled (not masked)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RWEIE</name>
                <description>Read or write error interrupt enable
This bit enables or disables (masks) the SAES interrupt generation when RWEIF (read and/or write error flag) is set.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Disabled (masked)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Enabled (not masked)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>KEIE</name>
                <description>Key error interrupt enable
This bit enables or disables (masks) the SAES interrupt generation when KEIF (key error flag) is set.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Disabled (masked)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Enabled (not masked)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RNGEIE</name>
                <description>RNG error interrupt enable
This bit enables or disables (masks) the SAES interrupt generation when RNGEIF (RNG error flag) is set.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Disabled (masked)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Enabled (not masked)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SAES_ISR</name>
            <displayName>SAES_ISR</displayName>
            <description>SAES interrupt status register </description>
            <addressOffset>0x304</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CCF</name>
                <description>Computation complete flag
This flag indicates whether the computation is completed:
The flag is set by hardware upon the completion of the computation. It is cleared by software, upon setting the CCF bit of the SAES_ICR register.
Upon the flag setting, an interrupt is generated if enabled through the CCFIE bit of the SAES_IER register.
The flag is significant only when the DMAOUTEN bit is 0. It may stay high when DMA_EN is 1.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Not completed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Completed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RWEIF</name>
                <description>Read or write error interrupt flag
This read-only bit is set by hardware when a RDERR or a WRERR error flag is set in the SAES_SR register.
RWEIF bit is cleared when application sets the corresponding bit of SAES_ICR register. An interrupt is generated if the RWEIE bit has been previously set in the SAES_IER register.
This flags has no meaning when key derivation mode is selected.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No read or write error detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Read or write error detected (see SAES_SR register for details)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>KEIF</name>
                <description>Key error interrupt flag
This read-only bit is set by hardware when key information failed to load into key registers or key register usage is forbidden.
KEIF bit is cleared when application sets the corresponding bit in SAES_ICR register. An interrupt is generated if the KEIE bit has been previously set in the SAES_IER register.
KEIF is triggered if one of below error occurred:
Application did not write SAES_KEYRx registers in the correct sequence. Specifically, If KEYSIZE=0 SAES_KEYR0, then SAES_KEYR1, then SAES_KEYR2 then SAES_KEYR3 register must be written (or the reverse order). If KEYSIZE=1 SAES_KEYR0, then SAES_KEYR1, then SAES_KEYR2 then SAES_KEYR3, then SAES_KEYR4, then SAES_KEYR5, then SAES_KEYR6, then SAES_KEYR7 register must be written (or the reverse order).
SAES failed to load the DHUK (KEYSEL=001 or 100)
SAES failed to load the BHK (KEYSEL=010 or 100) using the same sequence as above.
AES failed to load the key shared by SAES peripheral (KMOD=10)
When KEYVALID=1 and (KEYPROT=1 or KEYSEL not 0x0), security context of the application that loaded the key (secure, non-secure, CPU) does not match the security or Compartment ID attribute of the access to SAES_CR or SAES_DOUT. In this case KEYVALID and EN bits are cleared.
KEIF must be cleared by application otherwise KEYVALID cannot be set.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No key error detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Key information failed to load into key registers, or key register usage is forbidden</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RNGEIF</name>
                <description>RNG error interrupt flag
This read-only bit is set by hardware when an error is detected on RNG bus interface (e.g. bad entropy).
RNGEIE bit is cleared when application sets the corresponding bit of SAES_ICR register. An interrupt is generated if the RNGEIE bit has been previously set in the SAES_IER register. Clearing this bit triggers the reload of a new random number from RNG peripheral.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>RNG bus is functional</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Error detected on RNG bus interface (random seed fetching error)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SAES_ICR</name>
            <displayName>SAES_ICR</displayName>
            <description>SAES interrupt clear register </description>
            <addressOffset>0x308</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CCF</name>
                <description>Computation complete flag clear
Application must set this bit to clear the CCF status bit in SAES_SR and SAES_ISR register.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>RWEIF</name>
                <description>Read or write error interrupt flag clear
Application must set this bit to clear the RWEIF status bit in SAES_ISR register, and both RDERR and WRERR flags in SAES_SR register.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>KEIF</name>
                <description>Key error interrupt flag clear
Application must set this bit to clear the KEIF status bit in SAES_ISR register.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>RNGEIF</name>
                <description>RNG error interrupt flag clear
Application must set this bit to clear the RNGEIF status bit in SAES_ISR register.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>		  
		  <register>
            <name>SAES_HWCFGR</name>
            <displayName>SAES_HWCFGR</displayName>
            <description>SAES hardware configuration register</description>
            <addressOffset>0x3F0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000112</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CFG1</name>
                <description>HW Generic 1</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFG2</name>
                <description>HW Generic 2</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFG3</name>
                <description>HW Generic 3</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>		  		  
          <register>
            <name>SAES_VERR</name>
            <displayName>SAES_VERR</displayName>
            <description>SAES version register </description>
            <addressOffset>0x3f4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000030</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MINREV</name>
                <description>Minor revision
This bitfield returns the SAES peripheral minor version (0x0).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>MAJREV</name>
                <description>Major revision
This bitfield returns the SAES peripheral major version (0x3).</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SAES_IPIDR</name>
            <displayName>SAES_IPIDR</displayName>
            <description>SAES identification register </description>
            <addressOffset>0x3f8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00170023</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ID</name>
                <description>Identification code of the peripheral
This bitfield returns the identification code of the SAES peripheral.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SAES_SIDR</name>
            <displayName>SAES_SIDR</displayName>
            <description>SAES size ID register </description>
            <addressOffset>0x3fc</addressOffset>
            <size>0x20</size>
            <resetValue>0xA3C5DD01</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SID</name>
                <description>Size identification code
This bitfield returns the size identification code of the SAES peripheral as defined below:
Bits[31:8] = 0xA3C5DD (fixed code)
Bits[7:0] = 0x01 (1 Kbyte address decoding)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
