STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>SPI_VERR</name>
            <displayName>SPI_VERR</displayName>
            <description>SPI/I2S version register </description>
            <addressOffset>0x3f4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000011</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MINREV</name>
                <description>minor revision of the IP.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>MAJREV</name>
                <description>major revision of the IP.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SPI_IPIDR</name>
            <displayName>SPI_IPIDR</displayName>
            <description>SPI/I2S identification register </description>
            <addressOffset>0x3f8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00130022</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ID</name>
                <description>IP identification
MCD identification code which identifies the IP.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SPI_SIDR</name>
            <displayName>SPI_SIDR</displayName>
            <description>SPI/I2S size identification register </description>
            <addressOffset>0x3fc</addressOffset>
            <size>0x20</size>
            <resetValue>0xA3C5DD01</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SID</name>
                <description>size identification
Bits[31:8]: fixed code 0xA3C5DD0
Bits[7:0]: range of address decoding boundary
All the other combination are reserved.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>1 Kbyte</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>2 Kbytes</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>4 Kbytes</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x8</name>
                    <description>8 Kbytes</description>
                    <value>0x8</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>         
      </registers>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI2</name>     
      <baseAddress>0x4000B000</baseAddress>   
      <interrupt>
        <name>SPI2</name>
        <description>SPI2 global interrupt</description>
        <value>37</value>
      </interrupt>	  
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI3</name>
      <baseAddress>0x4000C000</baseAddress>
	  <interrupt>
        <name>SPI3</name>
        <description>SPI3 global interrupt</description>
        <value>52</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI4</name>
      <baseAddress>0x4C002000</baseAddress>
	  <interrupt>
        <name>SPI4</name>
        <description>SPI4 global interrupt</description>
        <value>85</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI5</name>
      <baseAddress>0x4C003000</baseAddress>
	  <interrupt>
        <name>SPI5</name>
        <description>SPI5 global interrupt</description>
        <value>86</value>
      </interrupt>
    </peripheral>
	<peripheral>
        <name>STGENC</name>
        <description>STGEN</description>
		<groupName>STGEN</groupName>
        <baseAddress>0x5C008000</baseAddress>
        <addressBlock>
          <offset>0x0</offset>
          <size>0x1000</size>
          <usage>registers</usage>
        </addressBlock>
        <registers>
          <register>
            <name>STGENC_CNTCR</name>
            <displayName>STGENC_CNTCR</displayName>
            <description>STGENC control register </description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>counter disabled and not incrementing</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>counter enabled and incrementing</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HLTDBG</name>
                <description>halt on debug</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>do not halt on debug; hltdbg signal into the counter has no effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>halt on debug; when hltdbg is driven high, the count value is held static.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENC_CNTSR</name>
            <displayName>STGENC_CNTSR</displayName>
            <description>STGENC status register </description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>counter disabled and not incrementing</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>counter enabled and incrementing</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HLTDBG</name>
                <description>halt on debug</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>do not halt on debug; hltdbg signal into the counter has no effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>halt on debug; when hltdbg is driven high, the count value is held static.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENC_CNTCVL</name>
            <displayName>STGENC_CNTCVL</displayName>
            <description>STGENC value lower register </description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CNTCVL_L_32</name>
                <description>current value of the timestamp counter, lower 32 bits
To change the current timestamp value, write the lower 32 bits of the new value to this register before writing the upper 32 bits to STGENC_CNTCVU. The timestamp value is not changed until the STGENC_CNTCVU register is written to.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENC_CNTCVU</name>
            <displayName>STGENC_CNTCVU</displayName>
            <description>STGENC value upper register </description>
            <addressOffset>0xc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CNTCVU_U_32</name>
                <description>current value of the timestamp counter, upper 32 bits
To change the current timestamp value, write the lower 32 bits of the new value to STGENC_CNTCVL before writing the upper 32 bits to this register. The 64-bit timestamp value is updated with the value from both writes when this register is written to.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENC_CNTFID0</name>
            <displayName>STGENC_CNTFID0</displayName>
            <description>STGENC base frequency register </description>
            <addressOffset>0x20</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>FREQ</name>
                <description>frequency in number of ticks per second.
It can be specified up to 4 GHz. This register must be programmed to match the clock frequency of the clock input to TSGEN (tsgen_clk), in ticks per second. For example, for a 50 MHz clock, the register value has to be 0x02FAF080.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENC_PIDR4</name>
            <displayName>STGENC_PIDR4</displayName>
            <description>STGENC peripheral ID4 register </description>
            <addressOffset>0xfd0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000004</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DES_2</name>
                <description>part of designer identification
Together PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify the designer of the component.
0b0100 JEDEC continuation code.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>SIZE</name>
                <description>always 0b0000
Indicates that the device only occupies 4 Kbytes of memory.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENC_PIDR5</name>
            <displayName>STGENC_PIDR5</displayName>
            <description>STGENC peripheral ID5 register </description>
            <addressOffset>0xfd4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PIDR5</name>
                <description>peripheral ID5</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENC_PIDR6</name>
            <displayName>STGENC_PIDR6</displayName>
            <description>STGENC peripheral ID6 register </description>
            <addressOffset>0xfd8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PIDR6</name>
                <description>peripheral ID6</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENC_PIDR7</name>
            <displayName>STGENC_PIDR7</displayName>
            <description>STGENC peripheral ID7 register </description>
            <addressOffset>0xfdc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PIDR7</name>
                <description>peripheral ID7</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENC_PIDR0</name>
            <displayName>STGENC_PIDR0</displayName>
            <description>STGENC peripheral ID0 register </description>
            <addressOffset>0xfe0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000001</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PART_0</name>
                <description>bits[7:0] of the 12-bit part number of the component.
The designer of the component assigns this part number.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENC_PIDR1</name>
            <displayName>STGENC_PIDR1</displayName>
            <description>STGENC peripheral ID1 register </description>
            <addressOffset>0xfe4</addressOffset>
            <size>0x20</size>
            <resetValue>0x000000B1</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PART_1</name>
                <description>Bits[11:8] of the 12-bit part number of the component
The designer of the component assigns this part number..</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DES_0</name>
                <description>part of designer identification
Together PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify the designer of the component.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENC_PIDR2</name>
            <displayName>STGENC_PIDR2</displayName>
            <description>STGENC peripheral ID2 register </description>
            <addressOffset>0xfe8</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000001B</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DES_1</name>
                <description>part of designer identification
Together PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify the designer of the component.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>JEDEC</name>
                <description>always 1
Indicates that the JEDEC-assigned designer ID is used.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>REVISION</name>
                <description>device revision number</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENC_PIDR3</name>
            <displayName>STGENC_PIDR3</displayName>
            <description>STGENC peripheral ID3 register </description>
            <addressOffset>0xfec</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CMOD</name>
                <description>customer modified
Indicates whether the customer has modified the behavior of the component. In most cases, this field is 0b0000 (no modification done). Customers change this value when they make authorized modifications to this component.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>REVAND</name>
                <description>customer version
0b0000 indicates there are no errata fixes to this component.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENC_CIDR0</name>
            <displayName>STGENC_CIDR0</displayName>
            <description>STGENC component ID0 register </description>
            <addressOffset>0xff0</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000000D</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRMBL_0</name>
                <description>preamble 0
Contains bits[7:0] of the component identification code.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENC_CIDR1</name>
            <displayName>STGENC_CIDR1</displayName>
            <description>STGENC component ID1 register </description>
            <addressOffset>0xff4</addressOffset>
            <size>0x20</size>
            <resetValue>0x000000F0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRMBL_1</name>
                <description>preamble 1
Contains bits[11:8] of the component identification code.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CLASS</name>
                <description>class of the component
For example, the component can be a ROM table or a generic CoreSight SoC-400 component. Contains bits[15:12] of the component identification code.
0b1111 Indicates the component is a CoreSight SoC-400 component.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENC_CIDR2</name>
            <displayName>STGENC_CIDR2</displayName>
            <description>STGENC component ID2 register </description>
            <addressOffset>0xff8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000050</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRMBL_2</name>
                <description>preamble 2
Contains bits[23:16] of the component identification code</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENC_CIDR3</name>
            <displayName>STGENC_CIDR3</displayName>
            <description>STGENC component ID3 register </description>
            <addressOffset>0xffc</addressOffset>
            <size>0x20</size>
            <resetValue>0x000000B1</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRMBL_3</name>
                <description>preamble 3
Contains bits[31:24] of the component identification code</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
