STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
        </registers>
    </peripheral>	  
    <peripheral>
        <name>STGENR</name>
        <description>STGENR</description>
		<groupName>STGENR</groupName>
        <baseAddress>0x5A005000</baseAddress>		
        <addressBlock>
          <offset>0x0</offset>
          <size>0x1000</size>
          <usage>registers</usage>
        </addressBlock>
        <registers>
          <register>
            <name>STGENR_CNTCVL</name>
            <displayName>STGENR_CNTCVL</displayName>
            <description>STGENR value lower register </description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CNTCVL_L_32</name>
                <description>current value of the timestamp counter (the lower 32 bits)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENR_CNTCVU</name>
            <displayName>STGENR_CNTCVU</displayName>
            <description>STGENR value upper register </description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CNTCVU_U_32</name>
                <description>current value of the timestamp counter (the upper 32 bits)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENR_PIDR4</name>
            <displayName>STGENR_PIDR4</displayName>
            <description>STGENR peripheral ID4 register </description>
            <addressOffset>0xfd0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000004</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DES_2</name>
                <description>part of designer identification
Together PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify the designer of the component.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>SIZE</name>
                <description>always 0b0000
Indicates that the device only occupies 4 Kbytes of memory.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENR_PIDR5</name>
            <displayName>STGENR_PIDR5</displayName>
            <description>STGENR peripheral ID5 register </description>
            <addressOffset>0xfd4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PIDR5</name>
                <description>peripheral ID5</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENR_PIDR6</name>
            <displayName>STGENR_PIDR6</displayName>
            <description>STGENR peripheral ID6 register </description>
            <addressOffset>0xfd8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PIDR6</name>
                <description>peripheral ID6</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENR_PIDR7</name>
            <displayName>STGENR_PIDR7</displayName>
            <description>STGENR peripheral ID7 register </description>
            <addressOffset>0xfdc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PIDR7</name>
                <description>peripheral ID7</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENR_PIDR0</name>
            <displayName>STGENR_PIDR0</displayName>
            <description>STGENR peripheral ID0 register </description>
            <addressOffset>0xfe0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000001</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PART_0</name>
                <description>bits[7:0] of the 12-bit part number of the component.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENR_PIDR1</name>
            <displayName>STGENR_PIDR1</displayName>
            <description>STGENR peripheral ID1 register </description>
            <addressOffset>0xfe4</addressOffset>
            <size>0x20</size>
            <resetValue>0x000000B1</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PART_1</name>
                <description>Bits[11:8] of the 12-bit part number of the component</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DES_0</name>
                <description>part of designer identification
Together PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify the designer of the component.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENR_PIDR2</name>
            <displayName>STGENR_PIDR2</displayName>
            <description>STGENR peripheral ID2 register </description>
            <addressOffset>0xfe8</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000001B</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DES_1</name>
                <description>part of designer identification
Together PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2, identify the designer of the component.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>JEDEC</name>
                <description>always 1
Indicates that the JEDEC-assigned designer ID is used.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>REVISION</name>
                <description>device revision number</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENR_PIDR3</name>
            <displayName>STGENR_PIDR3</displayName>
            <description>STGENR peripheral ID3 register </description>
            <addressOffset>0xfec</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CMOD</name>
                <description>customer modified
Indicates whether the customer has modified the behavior of the component. In most cases, this field is 0b0000 (no modification done). Customers change this value when they make authorized modifications to this component.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>REVAND</name>
                <description>errata fix identification
0b0000 indicates there are no errata fixes to this component.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENR_CIDR0</name>
            <displayName>STGENR_CIDR0</displayName>
            <description>STGENR component ID0 register </description>
            <addressOffset>0xff0</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000000D</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRMBL_0</name>
                <description>preamble 0
Contains bits[7:0] of the component identification code.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENR_CIDR1</name>
            <displayName>STGENR_CIDR1</displayName>
            <description>STGENR component ID1 register </description>
            <addressOffset>0xff4</addressOffset>
            <size>0x20</size>
            <resetValue>0x000000F0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRMBL_1</name>
                <description>preamble 1
Contains bits[11:8] of the component identification code.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CLASS</name>
                <description>class of the component
Contains bits[15:12] of the component identification code.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENR_CIDR2</name>
            <displayName>STGENR_CIDR2</displayName>
            <description>STGENR component ID2 register </description>
            <addressOffset>0xff8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000050</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRMBL_2</name>
                <description>preamble 2
Contains bits[23:16] of the component identification code.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STGENR_CIDR3</name>
            <displayName>STGENR_CIDR3</displayName>
            <description>STGENR component ID3 register </description>
            <addressOffset>0xffc</addressOffset>
            <size>0x20</size>
            <resetValue>0x000000B1</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRMBL_3</name>
                <description>preamble 3
Contains bits[31:24] of the component identification code.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
