STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
        </registers>
    </peripheral>
	<peripheral>
        <name>SYSCFG</name>
        <description>SYSCFG</description>
		<groupName>SYSCFG</groupName>
        <baseAddress>0x50020000</baseAddress>
        <addressBlock>
          <offset>0x0</offset>
          <size>0x400</size>
          <usage>registers</usage>
        </addressBlock>
        <registers>
          <register>
            <name>SYSCFG_BOOTR</name>
            <displayName>SYSCFG_BOOTR</displayName>
            <description>SYSCFG boot pins control register </description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFF0</resetMask>
            <fields>
              <field>
                <name>BOOT0</name>
                <description>BOOT0 pin value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>low</name>
                    <description>BOOT0 pin connected to VSS</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>high</name>
                    <description>BOOT0 pin connected to VDD</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BOOT1</name>
                <description>BOOT1 pin value</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>low</name>
                    <description>BOOT1 pin connected to VSS</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>high</name>
                    <description>BOOT1 pin connected to VDD</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BOOT2</name>
                <description>BOOT2 pin value</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>low</name>
                    <description>BOOT2 pin connected to VSS</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>high</name>
                    <description>BOOT2 pin connected to VDD</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_PMCSETR</name>
            <displayName>SYSCFG_PMCSETR</displayName>
            <description>SYSCFG peripheral mode configuration set register	</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>I2C1_FMP</name>
                <description>Fast Mode Plus (FM+) Enable
Set by software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means I2C1 use is possible up to 400 kHz</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' sets this bit, reading '1' means the I2C1 SCL &amp; SDA I/Os are in Fast mode plus (FM+), when the corresponding alternate function is selected. The I/O low drive is enhanced to support up to 1 MHz.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C2_FMP</name>
                <description>Fast Mode Plus (FM+) Enable
Set by software.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means I2C2 use is possible up to 400 kHz</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' sets this bit, reading '1' means the I2C2 SCL &amp; SDA I/Os are in Fast mode plus (FM+), when the corresponding alternate function is selected. The I/O low drive is enhanced to support up to 1 MHz.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C3_FMP</name>
                <description>Fast Mode Plus (FM+) Enable
Set by software.
This bit is secure if I2C3 is set to secure in the ETZPC.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means I2C3 use is possible up to 400kHz</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' sets this bit, reading '1' means the I2C3 SCL &amp; SDA I/Os are in Fast mode plus (FM+), when the corresponding alternate function is selected. The I/O low drive is enhanced to support up to 1 MHz.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C4_FMP</name>
                <description>Fast Mode Plus (FM+) Enable
Set by software.
This bit is secure if I2C4 is set to secure in the ETZPC.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means I2C4 use is possible up to 400 kHz</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' sets this bit, reading '1' means the I2C4 SCL &amp; SDA I/Os are in Fast mode plus (FM+), when the corresponding alternate function is selected. The I/O low drive is enhanced to support up to 1 MHz.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C5_FMP</name>
                <description>Fast mode plus (FM+) enable
Set by software.
This bit is secure if I2C5 is set to secure in the ETZPC.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means I2C5 use is possible up to 400 kHz </description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' sets this bit, reading '1' means the I2C5 SCL &amp; SDA I/Os are in Fast mode plus (FM+), when the corresponding alternate function is selected. The I/O low drive is enhanced to support up to 1 MHz.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN_BOOSTER</name>
                <description>GPIO analog switch supply voltage booster enable.
Set by software.
Used to reduce the total harmonic distortion of the I/O analog switches when VDDA and VDD supplies are below 2.7 V. Activating the booster guarantees the AC performance on I/O analog switches. When activated the performance of the analog switch is the same over the full voltage range.
This bit is always secure.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means booster is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' sets this bit, reading '1' means booster is enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ANASWVDD</name>
                <description>GPIO analog switch supply voltage selection
Cleared by software.
This bit is always secure.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means analog switches are supplied by VDDA (if present and EN_BOOSTER=0) or by the booster output (EN_BOOSTER=1)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' sets this bit, reading '1' means analog switches are supplied by VDD.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ETH1_CLK_SEL</name>
                <description>Gigabit Ethernet 125 MHz clock selection. Only useful with RGMII PHY.
Set by software.
This bit is secure if ETH1 is set to secure in the ETZPC.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means the transmit clock comes from the ETHx_CLK125 pin.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' sets this bit, reading '1' means the transmit clock comes from the RCC.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ETH1_REF_CLK_SEL</name>
                <description>Ethernet reference clock selection.
Set by software.
This bit is secure if ETH1 is set to secure in the ETZPC.</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means the receive clock (MII/RGMII mode) or the reference clock (RMII mode) comes from the ETH1_RX_CLK/ETH1_REF_CLK pin.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' sets this bit, reading '1' means the reference clock (RMII mode) comes from the RCC</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ETH1_SEL</name>
                <description>Ethernet PHY interface selection.
Set by software. Writing '0' has no effect. Set individual bits by writing '1. Reading means:
Note: Configuration must be done while the ETH is under reset and before enabling the ETH clocks
This bit field is secure if ETH1 is set to secure in the ETZPC.</description>
                <bitOffset>21</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>MII</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>RGMII</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>RMII</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ETH2_CLK_SEL</name>
                <description>Gigabit Ethernet 125 MHz clock selection. Only useful with RGMII PHY.
Set by software.
This bit is secure if ETH2 is set to secure in the ETZPC.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means the transmit clock comes from the ETHx_CLK125 pin.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' sets this bit, reading '1' means the transmit clock comes from the RCC.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ETH2_REF_CLK_SEL</name>
                <description>Ethernet reference clock selection.
Set by software.
This bit is secure if ETH2 is set to secure in the ETZPC.</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means the receive clock (MII/RGMII mode) or the reference clock (RMII mode) comes from the ETH2_RX_CLK/ETH2_REF_CLK pin.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' sets this bit, reading '1' means the reference clock (RMII mode) comes from the RCC</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ETH2_SEL</name>
                <description>Ethernet PHY interface selection.
Set by software. Writing '0' has no effect. Set individual bits by writing '1. Reading means:
Note: Configuration must be done while the ETH is under reset and before enabling the ETH clocks
This bit field is secure if ETH2 is set to secure in the ETZPC.</description>
                <bitOffset>29</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>MII</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>RGMII</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>RMII</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
