STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>SYSCFG_PMCCLRR</name>
            <displayName>SYSCFG_PMCCLRR</displayName>
            <description>SYSCFG peripheral mode configuration clear register	</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>I2C1_FMP</name>
                <description>Fast Mode Plus (FM+) Enable
Cleared by software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means I2C1 usage is possible up to 400 kHz</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' sets this bit, reading '1' means the I2C1 SCL &amp; SDA I/Os are in Fast mode plus (FM+), when the corresponding alternate function is selected. The I/O low drive is enhanced to support up to 1 MHz.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C2_FMP</name>
                <description>Fast Mode Plus (FM+) Enable
Cleared by software.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means I2C2 usage is possible up to 400 kHz</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' sets this bit, reading '1' means the I2C2 SCL &amp; SDA I/Os are in Fast mode plus (FM+), when the corresponding alternate function is selected. The I/O low drive is enhanced to support up to 1 MHz.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C3_FMP</name>
                <description>Fast Mode Plus (FM+) Enable
Cleared by software.
This bit is secure if I2C3 is set to secure in the ETZPC.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means I2C3 usage is possible up to 400kHz</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' sets this bit, reading '1' means the I2C3 SCL &amp; SDA I/Os are in Fast mode plus (FM+), when the corresponding alternate function is selected. The I/O low drive is enhanced to support up to 1 MHz.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C4_FMP</name>
                <description>Fast Mode Plus (FM+) Enable
Cleared by software.
This bit is secure if I2C4 is set to secure in the ETZPC.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means I2C4 usage is possible up to 400 kHz</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' sets this bit, reading '1' means the I2C4 SCL &amp; SDA I/Os are in Fast mode plus (FM+), when the corresponding alternate function is selected. The I/O low drive is enhanced to support up to 1 MHz.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C5_FMP</name>
                <description>Fast Mode Plus (FM+) Enable
Cleared by software.
This bit is secure if I2C5 is set to secure in the ETZPC.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means I2C5 usage is possible up to 400 kHz</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' sets this bit, reading '1' means the I2C5 SCL &amp; SDA I/Os are in Fast mode plus (FM+), when the corresponding alternate function is selected. The I/O low drive is enhanced to support up to 1 MHz.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN_BOOSTER</name>
                <description>GPIO analog switch supply voltage booster enable.
Cleared by software.
Used to reduce the Total harmonic distortion of the I/O analog switches when VDDA and VDD supplies are below 2.7 V. Activating the booster guarantees the AC performance on I/O analog switches. When activated the performance of the analog switch is the same over the full voltage range.
This bit is always secure.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means Booster is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' clears this bit, reading '1' means Booster is enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ANASWVDD</name>
                <description>GPIO analog switch supply voltage selection
Cleared by software.
(if present and EN_BOOSTER=0) or by the booster output (EN_BOOSTER=1)
This bit is always secure.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means analog switches are supplied by VDDA</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' clears this bit, reading '1' means analog switches are supplied by VDD.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ETH1_CLK_SEL</name>
                <description>Gigabit Ethernet 125 MHz clock selection. Only useful with RGMII PHY.
Set by software.
This bit is secure if ETH1 is set to secure in the ETZPC</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means the transmit clock comes from the ETHx_CLK125 pin.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' clears this bit, reading '1' means the transmit clock comes from the RCC.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ETH1_REF_CLK_SEL</name>
                <description>Ethernet reference clock selection.
Set by software.
This bit is secure if ETH1 is set to secure in the ETZPC</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means the receive clock (MII/RGMII mode) or the reference clock (RMII mode) comes from the ETH1_RX_CLK/ETH1_REF_CLK pin.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' clears this bit, reading '1' means the reference clock (RMII mode) comes from the RCC</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ETH1_SEL</name>
                <description>Ethernet PHY interface selection.
Set by software. Writing '0' has no effect. Clear individual bits by writing '1. Reading means:
Note: Configuration must be done while the ETH is under reset and before enabling the ETH clocks
This bit field is secure if ETH1 is set to secure in the ETZPC.</description>
                <bitOffset>21</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>MII</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>RGMII</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>RMII</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ETH2_CLK_SEL</name>
                <description>Gigabit Ethernet 125 MHz clock selection. Only useful with RGMII PHY.
Set by software.
This bit is secure if ETH2 is set to secure in the ETZPC.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writing '0' has no effect, reading '0' means the transmit clock comes from the ETHx_CLK125 pin.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' clears this bit, reading '1' means the transmit clock comes from the RCC.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ETH2_REF_CLK_SEL</name>
                <description>Ethernet reference clock selection.
Set by software.
This bit is secure if ETH2 is set to secure in the ETZPC.</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>'Writing '0' has no effect, reading '0' means the receive clock (MII/RGMII mode) or the reference clock (RMII mode) comes from the ETH2_RX_CLK/ETH2_REF_CLK pin.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writing '1' clears this bit, reading '1' means the reference clock (RMII mode) comes from the RCC</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ETH2_SEL</name>
                <description>Ethernet PHY interface selection.
Set by software. Writing '0' has no effect. Clear individual bits by writing '1. Reading means:
Note: Configuration must be done while the ETH is under reset and before enabling the ETH clocks
This bit field is secure if ETH2 is set to secure in the ETZPC.</description>
                <bitOffset>29</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>MII</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>RGMII</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>RMII</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_BOOTCR</name>
            <displayName>SYSCFG_BOOTCR</displayName>
            <description>SYSCFG boot control register </description>
            <addressOffset>0xc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BMEN</name>
                <description>Boot mode enable
This bit is writable only by secure privileged code. It should be used only during secure boot time, to ensure the timely execution of the firmware in charge of tamper management.
When this bit is cleared from 1 to 0 while a potential tamper event is active, accesses to SRAM3 are automatically blocked (as defined above) and PKA, SAES, HASH and CRYP peripherals are reset.
When a confirmed (not potential) tamper is raised by TAMP peripheral, SRAM3 is erased (as defined in TAMP) and PKA, SAES, HASH and CRYP peripherals are reset regardless of BMEN value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>While a potential tamper event is raised by TAMP peripheral, multiple blocking and erase actions occur in the device. Among those actions the SRAM3 reads as zero and the writes to SRAM3 are ignored. Also a reset pulse is triggered on PKA, SAES, HASH and CRYP peripherals. See TAMP section for details.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>While a potential tamper event is raised by TAMP peripheral, read and write accesses to the SRAM3 are allowed, and the PKA, SAES, HASH and CRYP peripherals are not reset. The other blocking and erasing actions defined in TAMP peripheral are not impacted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_SRAM3ERASER</name>
            <displayName>SYSCFG_SRAM3ERASER</displayName>
            <description>SYSCFG SRAM3 erase register </description>
            <addressOffset>0x10</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SRAM3ER</name>
                <description>SRAM3 erase request
This bit is set by software and automatically reset by hardware at the end of the erase operation. It can only be set if the correct unlock sequence has previously been written to the SYSCFG_SRAM3KR.KEY[7:0] register field. This bit is secure if SRAM3 is set to secure in the ETZPC.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SRAM3EO</name>
                <description>SRAM3 erase ongoing
This bit indicates whether an erase of SRAM3 is being carried out, whatever the trigger (tamper or software).</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>no erase ongoing</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>erase ongoing</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_SRAM3KR</name>
            <displayName>SYSCFG_SRAM3KR</displayName>
            <description>SYSCFG SRAM3 erase key register </description>
            <addressOffset>0x14</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>KEY</name>
                <description>SRAM3 software erase key
Writing the following sequence to KEY[7:0] unlocks the SRAM3 software erase feature:
0xCA
0x53
Writing any other value locks the feature.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
