STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>SYSCFG_CMPCR</name>
            <displayName>SYSCFG_CMPCR</displayName>
            <description>SYSCFG main compensation cell control register	</description>
            <addressOffset>0x20</addressOffset>
            <size>0x20</size>
            <resetValue>0x00870000</resetValue>
            <resetMask>0x00FFFFFF</resetMask>
            <fields>
              <field>
                <name>SW_CTRL</name>
                <description>Compensation software control
Note: SW_CTRL = 0 is not taken into account until READY = 1.
This means that whatever SW_CTRL value, the RANSRC[3:0] and RAPSRC[3:0] are used for I/O compensation when the compensation cell is in power down (EN = 0, which is the case after a reset).</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>I/O compensation values come from compensation values in ANSRC[3:0] and APSRC[3:0]</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>I/O compensation values come from RANSRC[3:0] and RAPSRC[3:0] register values</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>READY</name>
                <description>Compensation cell ready flag</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>I/O compensation cell not ready</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>I/O compensation cell ready, the values of APSRC[3:0] and ANSRC[3:0] are valid</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RANSRC</name>
                <description>NMOS I/O compensation value sent to I/Os when SW_CTRL = 1
....
....
Note: If compensation is needed, it is recommended to use automatic compensation</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>maximum compensation of slow conditions</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7</name>
                    <description>compensation for typical conditions</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xE</name>
                    <description>maximum compensation of fast conditions</description>
                    <value>0xE</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RAPSRC</name>
                <description>PMOS I/O Compensation value sent to I/Os when SW_CTRL = 1
....
....
Note: If compensation is needed, it is recommended to use automatic compensation</description>
                <bitOffset>20</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>maximum compensation of fast conditions</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x8</name>
                    <description>compensation for typical conditions</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xE</name>
                    <description>maximum compensation of slow conditions</description>
                    <value>0xE</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ANSRC</name>
                <description>NMOS I/O compensation value provided by compensation cell
Value sent to I/Os when SW_CTRL = 0 and READY = 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>APSRC</name>
                <description>PMOS I/O compensation value provided by compensation cell
Value sent to I/O compensation when SW_CTRL = 0 and READY = 1.</description>
                <bitOffset>28</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_CMPENSETR</name>
            <displayName>SYSCFG_CMPENSETR</displayName>
            <description>SYSCFG main compensation cell enable set register	</description>
            <addressOffset>0x24</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Compensation cell enable
Set by software.
Note: The CSI oscillator must be enabled and ready (controlled in RCC) before EN can be set to 1. Similarly, the CSI oscillator can be disabled only if EN is set to 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>power_down</name>
                    <description>Writing '0' has no effect, reading '0 means I/O compensation cell in power-down mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>enabled</name>
                    <description>Writing '1' enables I/O compensation cell, reading '1 means I/O compensation cell is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_CMPENCLRR</name>
            <displayName>SYSCFG_CMPENCLRR</displayName>
            <description>SYSCFG main compensation cell enable set register	</description>
            <addressOffset>0x28</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Compensation cell enable
Cleared by software.
Note: The CSI oscillator must be enabled and ready (controlled in RCC) before EN can be set to 1. Similarly, the CSI oscillator can be disabled only if EN is set to 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>power_down</name>
                    <description>Writing '0' has no effect, reading '0 means I/O compensation cell in powerdown mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>enabled</name>
                    <description>Writing '1' clears EN bit, reading '1 means I/O compensation cell is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_CBR</name>
            <displayName>SYSCFG_CBR</displayName>
            <description>SYSCFG control timer break register </description>
            <addressOffset>0x2c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PVDL</name>
                <description>PVD lock enable bit
This bit is set by software and cleared only by a system reset. It can be used to enable and lock the PVD connection to TIM1/8/15/16/17 Break input, as well as the PVDE and PLS[2:0] in the PWR_CR1 register.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>PVD interrupt disconnected from TIM1/8/15/16/17 Break input. PVDE and PLS[2:0] bits can be programmed by the application.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>PVD interrupt connected to TIM1/8/15/16/17 Break input. PVDE and PLS[2:0] bits are read only.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_CMPSD1CR</name>
            <displayName>SYSCFG_CMPSD1CR</displayName>
            <description>SYSCFG VDDSD1 compensation cell control register	</description>
            <addressOffset>0x30</addressOffset>
            <size>0x20</size>
            <resetValue>0x00870000</resetValue>
            <resetMask>0x00FFFFFF</resetMask>
            <fields>
              <field>
                <name>SW_CTRL</name>
                <description>Compensation software control
Note: SW_CTRL = 0 is not taken into account until READY = 1.
This means that whatever SW_CTRL value, the RANSRC[3:0] and RAPSRC[3:0] are used for I/O compensation when the compensation cell is in power down (EN = 0, which is the case after a reset).
This bit is secure if SDMMC1 is set to secure in the ETZPC.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>I/O compensation values come from compensation values in ANSRC[3:0] and APSRC[3:0]</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>I/O compensation values come from RANSRC[3:0] and RAPSRC[3:0] register values</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>READY</name>
                <description>Compensation cell ready flag</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>I/O compensation cell not ready.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>I/O compensation cell ready, the values of APSRC[3:0] and ANSRC[3:0] are valid</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RANSRC</name>
                <description>NMOS I/O compensation value sent to I/Os when SW_CTRL = 1
....
....
Note: If compensation is needed, it is recommended to use automatic compensation
This bit field is secure if SDMMC1 is set to secure in the ETZPC.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>maximum compensation of slow conditions</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7</name>
                    <description>compensation for typical conditions</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xE</name>
                    <description>maximum compensation of fast conditions</description>
                    <value>0xE</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RAPSRC</name>
                <description>PMOS I/O compensation value sent to I/Os when SW_CTRL = 1
....
....
Note: If compensation is needed, it is recommended to use automatic compensation
This bit field is secure if SDMMC1 is set to secure in the ETZPC.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>maximum compensation of fast conditions</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x8</name>
                    <description>compensation for typical conditions</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xE</name>
                    <description>maximum compensation of slow conditions</description>
                    <value>0xE</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ANSRC</name>
                <description>NMOS I/O Compensation value provided by compensation cell
Value sent to I/Os when SW_CTRL = 0 and READY = 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>APSRC</name>
                <description>PMOS I/O Compensation value provided by compensation cell
Value sent to I/Os compensation when SW_CTRL = 0 and READY = 1.</description>
                <bitOffset>28</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_CMPSD1ENSETR</name>
            <displayName>SYSCFG_CMPSD1ENSETR</displayName>
            <description>SYSCFG VDDSD1 compensation cell enable set register	</description>
            <addressOffset>0x34</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Compensation cell enable
Set by software.
Note: The CSI oscillator must be enabled and ready (controlled in RCC) before EN can be set to 1. Similarly, the CSI oscillator can be disabled only if MPU_EN is set to 0.
This bit is secure if SDMMC1 is set to secure in the ETZPC.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>power_down</name>
                    <description>Writing '0' has no effect, reading '0 means I/O compensation cell in power-down mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>enabled</name>
                    <description>Writing '1' enables I/O compensation cell, reading '1 means I/O compensation cell is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_CMPSD1ENCLRR</name>
            <displayName>SYSCFG_CMPSD1ENCLRR</displayName>
            <description>SYSCFG VDDSD1 compensation cell enable clear register	</description>
            <addressOffset>0x38</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Compensation cell enable
Cleared by software.
Note: The CSI oscillator must be enabled and ready (controlled in RCC) before EN can be set to 1. Similarly, the CSI oscillator can be disabled only if EN is set to 0.
This bit is secure if SDMMC1 is set to secure in the ETZPC.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>power_down</name>
                    <description>Writing '0' has no effect, reading '0 means I/O compensation cell in powerdown mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>enabled</name>
                    <description>Writing '1' clear EN bit, reading '1 means I/O compensation cell is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
