STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>SYSCFG_CMPSD2CR</name>
            <displayName>SYSCFG_CMPSD2CR</displayName>
            <description>SYSCFG VDDSD2 compensation cell control register	</description>
            <addressOffset>0x40</addressOffset>
            <size>0x20</size>
            <resetValue>0x00870000</resetValue>
            <resetMask>0x00FFFFFF</resetMask>
            <fields>
              <field>
                <name>SW_CTRL</name>
                <description>Compensation Software Control
Note: SW_CTRL = 0 is not taken into account until READY = 1.
This means that whatever SW_CTRL value, the RANSRC[3:0] and RAPSRC[3:0] are used for I/O compensation when the compensation cell is in power down (EN = 0, which is the case after a reset).
This bit is secure if SDMMC2 is set to secure in the ETZPC</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>I/O compensation values come from compensation values in ANSRC[3:0] and APSRC[3:0]</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>I/O compensation values come from RANSRC[3:0] and RAPSRC[3:0] register values</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>READY</name>
                <description>Compensation cell ready flag</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>I/O compensation cell not ready.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>I/O compensation cell ready, the values of APSRC[3:0] and ANSRC[3:0] are valid</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RANSRC</name>
                <description>NMOS I/O compensation value sent to I/Os when SW_CTRL = 1
....
....
Note: If compensation is needed, it is recommended to use automatic compensation
This bit field is secure if SDMMC2 is set to secure in the ETZPC.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>maximum compensation of slow conditions</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7</name>
                    <description>compensation for typical conditions</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xE</name>
                    <description>maximum compensation of fast conditions</description>
                    <value>0xE</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RAPSRC</name>
                <description>PMOS I/O compensation value sent to I/Os when SW_CTRL = 1
....
....
Note: If compensation is needed, it is recommended to use automatic compensation
This bit field is secure if SDMMC2 is set to secure in the ETZPC.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>maximum compensation of fast conditions</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x8</name>
                    <description>compensation for typical conditions</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xE</name>
                    <description>maximum compensation of slow conditions</description>
                    <value>0xE</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ANSRC</name>
                <description>NMOS I/O Compensation value provided by compensation cell
Value sent to I/Os when SW_CTRL = 0 and READY = 1</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>APSRC</name>
                <description>PMOS I/O Compensation value provided by compensation cell
Value sent to I/Os compensation when SW_CTRL = 0 and READY = 1</description>
                <bitOffset>28</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_CMPSD2ENSETR</name>
            <displayName>SYSCFG_CMPSD2ENSETR</displayName>
            <description>SYSCFG VDDSD2 compensation cell enable set register	</description>
            <addressOffset>0x44</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Compensation cell enable
Set by software.
Note: The CSI oscillator must be enabled and ready (controlled in RCC) before EN can be set to 1. Similarly, the CSI oscillator can be disabled only if EN is set to 0.
This bit is secure if SDMMC2 is set to secure in the ETZPC.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>power_down</name>
                    <description>Writing '0' has no effect, reading '0 means I/O compensation cell in power-down mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>enabled</name>
                    <description>Writing '1' enables I/O compensation cell, reading '1 means I/O compensation cell is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_CMPSD2ENCLRR</name>
            <displayName>SYSCFG_CMPSD2ENCLRR</displayName>
            <description>SYSCFG VDDSD2 compensation cell enable clear register	</description>
            <addressOffset>0x48</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Compensation cell enable
Cleared by software.
Note: The CSI oscillator must be enabled and ready (controlled in RCC) before EN can be set to 1. Similarly, the CSI oscillator can be disabled only if EN is set to 0.
This bit is secure if SDMMC2 is set to secure in the ETZPC.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>power_down</name>
                    <description>Writing '0' has no effect, reading '0 means I/O compensation cell in powerdown mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>enabled</name>
                    <description>Writing '1' clear MPU_EN bit, reading '1 means I/O compensation cell is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_HSLVEN0R</name>
            <displayName>SYSCFG_HSLVEN0R</displayName>
            <description>SYSCFG high-speed low-voltage enable register 0</description>
            <addressOffset>0x50</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HSLVEN</name>
                <description>High-speed low-voltage I/O mode enable.
Controls the speed of _h and _vh type I/Os associated with an interface when that interface is selected in the AFMUX
When writing:
Others: disables high speed mode
When reading:</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1018</name>
                    <description>enables high speed mode</description>
                    <value>0x1018</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>high speed mode enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>high speed mode disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_HSLVEN1R</name>
            <displayName>SYSCFG_HSLVEN1R</displayName>
            <description>SYSCFG high-speed low-voltage enable register 1</description>
            <addressOffset>0x54</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HSLVEN</name>
                <description>High-speed low-voltage I/O mode enable.
Controls the speed of _h and _vh type I/Os associated with an interface when that interface is selected in the AFMUX
When writing:
Others: disables high speed mode
When reading:</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1018</name>
                    <description>enables high speed mode</description>
                    <value>0x1018</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>high speed mode enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>high speed mode disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_HSLVEN2R</name>
            <displayName>SYSCFG_HSLVEN2R</displayName>
            <description>SYSCFG high-speed low-voltage enable register 2</description>
            <addressOffset>0x58</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HSLVEN</name>
                <description>High-speed low-voltage I/O mode enable.
Controls the speed of _h and _vh type I/Os associated with an interface when that interface is selected in the AFMUX
When writing:
Others: disables high speed mode
When reading:</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1018</name>
                    <description>enables high speed mode</description>
                    <value>0x1018</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>high speed mode enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>high speed mode disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_HSLVEN3R</name>
            <displayName>SYSCFG_HSLVEN3R</displayName>
            <description>SYSCFG high-speed low-voltage enable register 3</description>
            <addressOffset>0x5c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HSLVEN</name>
                <description>High-speed low-voltage I/O mode enable.
Controls the speed of _h and _vh type I/Os associated with an interface when that interface is selected in the AFMUX
When writing:
Others: disables high speed mode
When reading:</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1018</name>
                    <description>enables high speed mode</description>
                    <value>0x1018</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>high speed mode enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>high speed mode disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_HSLVEN4R</name>
            <displayName>SYSCFG_HSLVEN4R</displayName>
            <description>SYSCFG high-speed low-voltage enable register 4</description>
            <addressOffset>0x60</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HSLVEN</name>
                <description>High-speed low-voltage I/O mode enable.
Controls the speed of _h and _vh type I/Os associated with an interface when that interface is selected in the AFMUX
When writing:
Others: disables high speed mode
When reading:</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1018</name>
                    <description>enables high speed mode</description>
                    <value>0x1018</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>high speed mode enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>high speed mode disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_HSLVEN5R</name>
            <displayName>SYSCFG_HSLVEN5R</displayName>
            <description>SYSCFG high-speed low-voltage enable register 5</description>
            <addressOffset>0x64</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HSLVEN</name>
                <description>High-speed low-voltage I/O mode enable.
Controls the speed of _h and _vh type I/Os associated with an interface when that interface is selected in the AFMUX
When writing:
Others: disables high speed mode
When reading:</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1018</name>
                    <description>enables high speed mode</description>
                    <value>0x1018</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>high speed mode enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>high speed mode disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_HSLVEN6R</name>
            <displayName>SYSCFG_HSLVEN6R</displayName>
            <description>SYSCFG high-speed low-voltage enable register 6</description>
            <addressOffset>0x68</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HSLVEN</name>
                <description>High-speed low-voltage I/O mode enable.
Controls the speed of _h and _vh type I/Os associated with an interface when that interface is selected in the AFMUX
When writing:
Others: disables high speed mode
When reading:</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1018</name>
                    <description>enables high speed mode</description>
                    <value>0x1018</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>high speed mode enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>high speed mode disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_HSLVEN7R</name>
            <displayName>SYSCFG_HSLVEN7R</displayName>
            <description>SYSCFG high-speed low-voltage enable register 7</description>
            <addressOffset>0x6c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HSLVEN</name>
                <description>High-speed low-voltage I/O mode enable.
Controls the speed of _h and _vh type I/Os associated with an interface when that interface is selected in the AFMUX
When writing:
Others: disables high speed mode
When reading:</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1018</name>
                    <description>enables high speed mode</description>
                    <value>0x1018</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>high speed mode enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>high speed mode disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_HSLVEN8R</name>
            <displayName>SYSCFG_HSLVEN8R</displayName>
            <description>SYSCFG high-speed low-voltage enable register 8</description>
            <addressOffset>0x70</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HSLVEN</name>
                <description>High-speed low-voltage I/O mode enable.
Controls the speed of _h and _vh type I/Os associated with an interface when that interface is selected in the AFMUX
When writing:
Others: disables high speed mode
When reading:</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1018</name>
                    <description>enables high speed mode</description>
                    <value>0x1018</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>high speed mode enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>high speed mode disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
