STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>SYSCFG_HSLVEN9R</name>
            <displayName>SYSCFG_HSLVEN9R</displayName>
            <description>SYSCFG high-speed low-voltage enable register 9</description>
            <addressOffset>0x74</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HSLVEN</name>
                <description>High-speed low-voltage I/O mode enable.
Controls the speed of _h and _vh type I/Os associated with an interface when that interface is selected in the AFMUX
When writing:
Others: disables high speed mode
When reading:</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1018</name>
                    <description>enables high speed mode</description>
                    <value>0x1018</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>high speed mode enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>high speed mode disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_HSLVEN10R</name>
            <displayName>SYSCFG_HSLVEN10R</displayName>
            <description>SYSCFG high-speed low-voltage enable register 10</description>
            <addressOffset>0x78</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HSLVEN</name>
                <description>High-speed low-voltage I/O mode enable.
Controls the speed of _h and _vh type I/Os associated with an interface when that interface is selected in the AFMUX
When writing:
Others: disables high speed mode
When reading:</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1018</name>
                    <description>enables high speed mode</description>
                    <value>0x1018</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>high speed mode enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>high speed mode disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_HSLVEN11R</name>
            <displayName>SYSCFG_HSLVEN11R</displayName>
            <description>SYSCFG high-speed low-voltage enable register 11</description>
            <addressOffset>0x7c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HSLVEN</name>
                <description>High-speed low-voltage I/O mode enable.
Controls the speed of _h and _vh type I/Os associated with an interface when that interface is selected in the AFMUX
When writing:
Others: disables high speed mode
When reading:</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1018</name>
                    <description>enables high speed mode</description>
                    <value>0x1018</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>high speed mode enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>high speed mode disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_IDC</name>
            <displayName>SYSCFG_IDC</displayName>
            <description>SYSCFG identity code register </description>
            <addressOffset>0x380</addressOffset>
            <size>0x20</size>
            <resetValue>0x10006501</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DEV_ID</name>
                <description>device ID</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x501</name>
                    <description>STM32MP13xx</description>
                    <value>0x501</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REV_ID</name>
                <description>device revision
0x1000 = Rev. 1</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_VERR</name>
            <displayName>SYSCFG_VERR</displayName>
            <description>SYSCFG version register </description>
            <addressOffset>0x3f4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000030</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MINREV</name>
                <description>Minor revision
These bits return the SYSCFG minor revision.
Minor revision is 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>MAJREV</name>
                <description>Major revision
These bits return the SYSCFG major revision.
Major revision is 3.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_IPIDR</name>
            <displayName>SYSCFG_IPIDR</displayName>
            <description>SYSCFG identification register </description>
            <addressOffset>0x3f8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00030001</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ID</name>
                <description>SYSCFG identifier
These bits return the SYSCFG identifier value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_SIDR</name>
            <displayName>SYSCFG_SIDR</displayName>
            <description>SYSCFG size identification register </description>
            <addressOffset>0x3fc</addressOffset>
            <size>0x20</size>
            <resetValue>0xA3C5DD01</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SID</name>
                <description>Size identification
These bits return the size of the memory region allocated to SYSCFG registers.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
