STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
      </registers>
    </peripheral>
	<peripheral derivedFrom="TIM2">
      <name>TIM3</name>
      <baseAddress>0x40001000</baseAddress>
	  <interrupt>
        <name>TIM3</name>
        <description>TIM3 global interrupt</description>
        <value>30</value>
      </interrupt>
    </peripheral>
	<peripheral derivedFrom="TIM2">
      <name>TIM4</name>
      <baseAddress>0x40002000</baseAddress>
	  <interrupt>
        <name>TIM4</name>
        <description>TIM4 global interrupt</description>
        <value>31</value>
      </interrupt>
    </peripheral>
	<peripheral derivedFrom="TIM2">
      <name>TIM5</name>
      <baseAddress>0x40003000</baseAddress>
	  <interrupt>
        <name>TIM5</name>
        <description>TIM5 global interrupt</description>
        <value>51</value>
      </interrupt>
    </peripheral>
	<peripheral>
      <name>TIM6</name>
      <description>TIM6</description>
      <groupName>TIM6</groupName>
      <baseAddress>0x40004000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
	  <interrupt>
        <name>TIM6</name>
        <description>TIM6 global interrupt</description>
        <value>55</value>
      </interrupt>
      <registers>
        <register>
          <name>TIM6_CR1</name>
          <displayName>TIM6_CR1</displayName>
          <description>TIM6 control register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CEN</name>
              <description>CEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UDIS</name>
              <description>UDIS</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>URS</name>
              <description>URS</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPM</name>
              <description>OPM</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>                       
            <field>
              <name>ARPE</name>
              <description>ARPE</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UIFREMAP</name>
              <description>UIFREMAP</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TIM6_CR2</name>
          <displayName>TIM6_CR2</displayName>
          <description>TIM6 control register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>           
            <field>
              <name>MMS</name>
              <description>MMS</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TIM6_DIER</name>
          <displayName>TIM6_DIER</displayName>
          <description>TIM6 DMA/interrupt enable register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UIE</name>
              <description>UIE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UDE</name>
              <description>UDE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>                      
          </fields>
        </register>
        <register>
          <name>TIM6_SR</name>
          <displayName>TIM6_SR</displayName>
          <description>TIM6 status register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UIF</name>
              <description>UIF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>            
          </fields>
        </register>
        <register>
          <name>TIM6_EGR</name>
          <displayName>TIM6_EGR</displayName>
          <description>TIM6 event generation register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x10</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UG</name>
              <description>UG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>                       
          </fields>
        </register>
        <register>
          <name>TIM6_CNT</name>
          <displayName>TIM6_CNT</displayName>
          <description>TIM6 counter</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UIFCPY</name>
              <description>UIFCPY</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIM6_PSC</name>
          <displayName>TIM6_PSC</displayName>
          <description>TIM6 prescaler</description>
          <addressOffset>0x28</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PSC</name>
              <description>PSC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TIM6_ARR</name>
          <displayName>TIM6_ARR</displayName>
          <description>TIM6 auto-reload register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <fields>
            <field>
              <name>ARR</name>
              <description>ARR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
