STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
          <register>
            <name>TZC_REGION_ATTRIBUTE8</name>
            <displayName>TZC_REGION_ATTRIBUTE8</displayName>
            <description>TZC region 8 attribute register</description>
            <addressOffset>0x210</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>FILTER_EN</name>
                <description>Region enable for the filter</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>disable filter for the region</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>enable filter for the region</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S_RD_EN</name>
                <description>Secure global read enable</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>S_WR_EN</name>
                <description>Secure global write enable</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>secure write to the region are not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>permit secure write into the region</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TZC_REGION_ID_ACCESS8</name>
            <displayName>TZC_REGION_ID_ACCESS8</displayName>
            <description>TZC region 8 ID access register</description>
            <addressOffset>0x214</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>NSAID_RD_EN</name>
                <description>Region read enable for each NSAID
Bit 0 is associated to NSAID = 0 ... bit 15 is associated to NSAID = 15.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>forbids read non-secure to the region for this NSAID</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>permits read non-secure to the region for this NSAID</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NSAID_WR_EN</name>
                <description>Region write enable for each NSAID
Bit 16 is associated to NSAID = 0 .. bit 31 is associated to NSAID = 15</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>forbids write non-secure to the region for this NSAID</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>permits write non-secure to the region for this NSAID</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TZC_PID4</name>
            <displayName>TZC_PID4</displayName>
            <description>TZC peripheral ID 4 register </description>
            <addressOffset>0xfd0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000004</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PER_ID_4</name>
                <description>Peripheral ID 4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TZC_PID5</name>
            <displayName>TZC_PID5</displayName>
            <description>TZC peripheral ID 5 register </description>
            <addressOffset>0xfd4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PER_ID_5</name>
                <description>Peripheral ID 5</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TZC_PID6</name>
            <displayName>TZC_PID6</displayName>
            <description>TZC peripheral ID 6 register </description>
            <addressOffset>0xfd8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PER_ID_6</name>
                <description>Peripheral ID 6</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TZC_PID7</name>
            <displayName>TZC_PID7</displayName>
            <description>TZC peripheral ID 7 register </description>
            <addressOffset>0xfdc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PER_ID_7</name>
                <description>Peripheral ID 7</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TZC_PID0</name>
            <displayName>TZC_PID0</displayName>
            <description>TZC peripheral ID 0 register </description>
            <addressOffset>0xfe0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000060</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PER_ID_0</name>
                <description>Peripheral ID 0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TZC_PID1</name>
            <displayName>TZC_PID1</displayName>
            <description>TZC peripheral ID 1 register </description>
            <addressOffset>0xfe4</addressOffset>
            <size>0x20</size>
            <resetValue>0x000000B4</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PER_ID_1</name>
                <description>Peripheral ID 1</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TZC_PID2</name>
            <displayName>TZC_PID2</displayName>
            <description>TZC peripheral ID 2 register </description>
            <addressOffset>0xfe8</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000002B</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PER_ID_2</name>
                <description>Peripheral ID 2</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TZC_PID3</name>
            <displayName>TZC_PID3</displayName>
            <description>TZC peripheral ID 3 register </description>
            <addressOffset>0xfec</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PER_ID_3</name>
                <description>Peripheral ID 3</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TZC_CID0</name>
            <displayName>TZC_CID0</displayName>
            <description>TZC component ID 0 register </description>
            <addressOffset>0xff0</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000000D</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>COMP_ID_0</name>
                <description>Component ID 0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TZC_CID1</name>
            <displayName>TZC_CID1</displayName>
            <description>TZC component ID 1 register </description>
            <addressOffset>0xff4</addressOffset>
            <size>0x20</size>
            <resetValue>0x000000F0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>COMP_ID_1</name>
                <description>Component ID 0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TZC_CID2</name>
            <displayName>TZC_CID2</displayName>
            <description>TZC component ID 2 register </description>
            <addressOffset>0xff8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000005</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>COMP_ID_2</name>
                <description>Component ID 2</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TZC_CID3</name>
            <displayName>TZC_CID3</displayName>
            <description>TZC component ID 3 register </description>
            <addressOffset>0xffc</addressOffset>
            <size>0x20</size>
            <resetValue>0x000000B1</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>COMP_ID_3</name>
                <description>Component ID 3</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
