STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP13xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>USART2</name>
      <baseAddress>0x4C001000</baseAddress>
	  <interrupt>
        <name>USART2</name>
        <description>USART2 global interrupt</description>
        <value>39</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>USART3</name>
      <baseAddress>0x4000F000</baseAddress>
	  <interrupt>
        <name>USART3</name>
        <description>USART3 global interrupt</description>
        <value>40</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>USART4</name>
      <baseAddress>0x40010000</baseAddress>
	  <interrupt>
        <name>USART4</name>
        <description>USART4 global interrupt</description>
        <value>53</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>USART5</name>
      <baseAddress>0x40011000</baseAddress>
	  <interrupt>
        <name>USART5</name>
        <description>USART5 global interrupt</description>
        <value>54</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>USART6</name>
      <baseAddress>0x44003000</baseAddress>
	  <interrupt>
        <name>USART6</name>
        <description>USART6 global interrupt</description>
        <value>72</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>USART7</name>
      <baseAddress>0x40018000</baseAddress>
	  <interrupt>
        <name>USART7</name>
        <description>USART7 global interrupt</description>
        <value>83</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>USART8</name>
      <baseAddress>0x40019000</baseAddress>
	  <interrupt>
        <name>USART8</name>
        <description>USART8 global interrupt</description>
        <value>84</value>
      </interrupt>
    </peripheral>
	<peripheral>
        <name>USBPHYC</name>
        <description>USBPHYC</description>
		<groupName>USBPHYC</groupName>
        <baseAddress>0x5A006000</baseAddress>
        <addressBlock>
          <offset>0x0</offset>
          <size>0x1000</size>
          <usage>registers</usage>
        </addressBlock>
        <registers>
          <register>
            <name>USBPHYC_PLL</name>
            <displayName>USBPHYC_PLL</displayName>
            <description>USBPHYC PLL control register </description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <resetValue>0xC0000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PLLNDIV</name>
                <description>Loop division factor of PLL (integer part)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PLLODF</name>
                <description>PLL output division factor</description>
                <bitOffset>7</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PLLFRACIN</name>
                <description>PLL fractional input
PLLFRACIN is the fractional input of the PLL divider.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PLLEN</name>
                <description>PLL enable
This bit enables the PLL.</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>PLL disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>PLL enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PLLSTRB</name>
                <description>PLL strobe
This bit allows to control an asynchronous strobe signal provided as an input to the fractional controller. A rising edge of PLLSTRB signal indicates to the fractional controller that a new fractional word is to be loaded.</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Strobe set to 0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Strobe set to 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PLLSTRBYP</name>
                <description>PLL strobe bypass
Bypass the strobe signal. If set to 1 before setting PLLEN=1, then the PLL will start up in fractional mode depending on the setting of PLLFRACCTL.</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Do not bypass the strobe signal</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Bypass the strobe signal</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PLLFRACCTL</name>
                <description>PLL fractional mode control</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Fractional mode off</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Fractional mode on</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PLLDITHEN0</name>
                <description>PLL dither 2 (triangular)
This bit enables the triangular dither for the PLL.</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Enables the triangular PDF dither input to SDM of PLL (not recommended)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Disables the triangular PDF dither input to SDM of PLL</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PLLDITHEN1</name>
                <description>PLL dither 1 (rectangular)
This bit enables the rectangular dither for the PLL.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Enables the rectangular PDF dither input to SDM of PLL (not recommended)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Disables the rectangular PDF dither input to SDM of PLL</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>USBPHYC_MISC</name>
            <displayName>USBPHYC_MISC</displayName>
            <description>USBPHYC misc control register </description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SWITHOST</name>
                <description>Switch host
Controls main switch connecting USB PHY 2nd port between USB host controller and USB OTG controller. This register is static.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Select OTG controller for 2nd PHY port</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Select Host controller for 2nd PHY port</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PPCKDIS</name>
                <description>Intelligent per HS PHY port clock gating control
This register is static.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No clock gating. PHY dedicated 60 MHz Port1/Port2 clocks are always delivered to target controller. PHY 48 MHz output clock is always delivered to target controller.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Intelligent clock gating for Port1. Port1 60 MHz input clock gated (Port1 is unused). Port2 dedicated 60 MHz is delivered in case of parallel data comm is requested on target controller (Host or OTG). PHY 48 MHz is delivered in case serial comm is requested on target controller (Host if SWITHOST = 1 else OTG).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>Intelligent clock gating for Port2. Port2 60 MHz input clock gated (Port2 is unused). Port1 dedicated 60 MHz is delivered in case of parallel data comm is requested on target controller (Host). PHY 48 MHz is delivered in case serial comm is requested on target controller (Host if SWITHOST = 1 else OTG).</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>Intelligent clock gating for Port1 and Port2. Port1 dedicated 60 MHz is delivered in case of parallel data comm is requested on target (Host). Port2 dedicated 60 MHz is delivered in case of parallel data comm is requested on target (Host if SWITHOST = 1 else OTG). PHY 48 MHz output clock is delivered in case serial comm is requested on target controller (Host or OTG).</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
